{"modelTopology":{"class_name":"Model","config":{"name":"policy-model","layers":[{"name":"policy-model_tankInput","class_name":"InputLayer","config":{"batch_input_shape":[null,8],"dtype":"float32","sparse":false,"name":"policy-model_tankInput"},"inbound_nodes":[]},{"name":"policy-model_allies_denseQ","class_name":"Dense","config":{"units":32,"activation":"linear","use_bias":false,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"policy-model_allies_denseQ","trainable":true},"inbound_nodes":[[["policy-model_tankInput",0,0,{}]]]},{"name":"policy-model_alliesInput","class_name":"InputLayer","config":{"batch_input_shape":[null,3,7],"dtype":"float32","sparse":false,"name":"policy-model_alliesInput"},"inbound_nodes":[]},{"name":"policy-model_enemies_denseQ","class_name":"Dense","config":{"units":32,"activation":"linear","use_bias":false,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"policy-model_enemies_denseQ","trainable":true},"inbound_nodes":[[["policy-model_tankInput",0,0,{}]]]},{"name":"policy-model_enemiesInput","class_name":"InputLayer","config":{"batch_input_shape":[null,3,7],"dtype":"float32","sparse":false,"name":"policy-model_enemiesInput"},"inbound_nodes":[]},{"name":"policy-model_bullets_denseQ","class_name":"Dense","config":{"units":32,"activation":"linear","use_bias":false,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"policy-model_bullets_denseQ","trainable":true},"inbound_nodes":[[["policy-model_tankInput",0,0,{}]]]},{"name":"policy-model_bulletsInput","class_name":"InputLayer","config":{"batch_input_shape":[null,10,4],"dtype":"float32","sparse":false,"name":"policy-model_bulletsInput"},"inbound_nodes":[]},{"name":"reshape_Reshape2","class_name":"Reshape","config":{"target_shape":[1,32],"name":"reshape_Reshape2","trainable":true},"inbound_nodes":[[["policy-model_allies_denseQ",0,0,{}]]]},{"name":"policy-model_allies_denseK","class_name":"Dense","config":{"units":32,"activation":"linear","use_bias":false,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"policy-model_allies_denseK","trainable":true},"inbound_nodes":[[["policy-model_alliesInput",0,0,{}]]]},{"name":"reshape_Reshape1","class_name":"Reshape","config":{"target_shape":[1,32],"name":"reshape_Reshape1","trainable":true},"inbound_nodes":[[["policy-model_enemies_denseQ",0,0,{}]]]},{"name":"policy-model_enemies_denseK","class_name":"Dense","config":{"units":32,"activation":"linear","use_bias":false,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"policy-model_enemies_denseK","trainable":true},"inbound_nodes":[[["policy-model_enemiesInput",0,0,{}]]]},{"name":"reshape_Reshape3","class_name":"Reshape","config":{"target_shape":[1,32],"name":"reshape_Reshape3","trainable":true},"inbound_nodes":[[["policy-model_bullets_denseQ",0,0,{}]]]},{"name":"policy-model_bullets_denseK","class_name":"Dense","config":{"units":32,"activation":"linear","use_bias":false,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"policy-model_bullets_denseK","trainable":true},"inbound_nodes":[[["policy-model_bulletsInput",0,0,{}]]]},{"name":"dot_Dot3","class_name":"Dot","config":{"axes":-1,"normalize":false,"name":"dot_Dot3","trainable":true},"inbound_nodes":[[["reshape_Reshape2",0,0,{}],["policy-model_allies_denseK",0,0,{}]]]},{"name":"policy-model_alliesMaskInput","class_name":"InputLayer","config":{"batch_input_shape":[null,3],"dtype":"float32","sparse":false,"name":"policy-model_alliesMaskInput"},"inbound_nodes":[]},{"name":"dot_Dot1","class_name":"Dot","config":{"axes":-1,"normalize":false,"name":"dot_Dot1","trainable":true},"inbound_nodes":[[["reshape_Reshape1",0,0,{}],["policy-model_enemies_denseK",0,0,{}]]]},{"name":"policy-model_enemiesMaskInput","class_name":"InputLayer","config":{"batch_input_shape":[null,3],"dtype":"float32","sparse":false,"name":"policy-model_enemiesMaskInput"},"inbound_nodes":[]},{"name":"dot_Dot5","class_name":"Dot","config":{"axes":-1,"normalize":false,"name":"dot_Dot5","trainable":true},"inbound_nodes":[[["reshape_Reshape3",0,0,{}],["policy-model_bullets_denseK",0,0,{}]]]},{"name":"policy-model_bulletsMaskInput","class_name":"InputLayer","config":{"batch_input_shape":[null,10],"dtype":"float32","sparse":false,"name":"policy-model_bulletsMaskInput"},"inbound_nodes":[]},{"name":"policy-model_allies_AttentionMaskLayer","class_name":"AttentionMaskLayer","config":{"name":"policy-model_allies_AttentionMaskLayer","trainable":true},"inbound_nodes":[[["dot_Dot3",0,0,{}],["policy-model_alliesMaskInput",0,0,{}]]]},{"name":"policy-model_enemies_AttentionMaskLayer","class_name":"AttentionMaskLayer","config":{"name":"policy-model_enemies_AttentionMaskLayer","trainable":true},"inbound_nodes":[[["dot_Dot1",0,0,{}],["policy-model_enemiesMaskInput",0,0,{}]]]},{"name":"policy-model_bullets_AttentionMaskLayer","class_name":"AttentionMaskLayer","config":{"name":"policy-model_bullets_AttentionMaskLayer","trainable":true},"inbound_nodes":[[["dot_Dot5",0,0,{}],["policy-model_bulletsMaskInput",0,0,{}]]]},{"name":"activation_Activation2","class_name":"Activation","config":{"activation":"softmax","name":"activation_Activation2","trainable":true},"inbound_nodes":[[["policy-model_allies_AttentionMaskLayer",0,0,{}]]]},{"name":"policy-model_allies_denseV","class_name":"Dense","config":{"units":32,"activation":"linear","use_bias":false,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"policy-model_allies_denseV","trainable":true},"inbound_nodes":[[["policy-model_alliesInput",0,0,{}]]]},{"name":"activation_Activation1","class_name":"Activation","config":{"activation":"softmax","name":"activation_Activation1","trainable":true},"inbound_nodes":[[["policy-model_enemies_AttentionMaskLayer",0,0,{}]]]},{"name":"policy-model_enemies_denseV","class_name":"Dense","config":{"units":32,"activation":"linear","use_bias":false,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"policy-model_enemies_denseV","trainable":true},"inbound_nodes":[[["policy-model_enemiesInput",0,0,{}]]]},{"name":"activation_Activation3","class_name":"Activation","config":{"activation":"softmax","name":"activation_Activation3","trainable":true},"inbound_nodes":[[["policy-model_bullets_AttentionMaskLayer",0,0,{}]]]},{"name":"policy-model_bullets_denseV","class_name":"Dense","config":{"units":32,"activation":"linear","use_bias":false,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"policy-model_bullets_denseV","trainable":true},"inbound_nodes":[[["policy-model_bulletsInput",0,0,{}]]]},{"name":"dot_Dot4","class_name":"Dot","config":{"axes":[2,1],"normalize":false,"name":"dot_Dot4","trainable":true},"inbound_nodes":[[["activation_Activation2",0,0,{}],["policy-model_allies_denseV",0,0,{}]]]},{"name":"dot_Dot2","class_name":"Dot","config":{"axes":[2,1],"normalize":false,"name":"dot_Dot2","trainable":true},"inbound_nodes":[[["activation_Activation1",0,0,{}],["policy-model_enemies_denseV",0,0,{}]]]},{"name":"dot_Dot6","class_name":"Dot","config":{"axes":[2,1],"normalize":false,"name":"dot_Dot6","trainable":true},"inbound_nodes":[[["activation_Activation3",0,0,{}],["policy-model_bullets_denseV",0,0,{}]]]},{"name":"policy-model_battlefieldInput","class_name":"InputLayer","config":{"batch_input_shape":[null,4],"dtype":"float32","sparse":false,"name":"policy-model_battlefieldInput"},"inbound_nodes":[]},{"name":"flatten_Flatten2","class_name":"Flatten","config":{"name":"flatten_Flatten2","trainable":true},"inbound_nodes":[[["dot_Dot4",0,0,{}]]]},{"name":"flatten_Flatten1","class_name":"Flatten","config":{"name":"flatten_Flatten1","trainable":true},"inbound_nodes":[[["dot_Dot2",0,0,{}]]]},{"name":"flatten_Flatten3","class_name":"Flatten","config":{"name":"flatten_Flatten3","trainable":true},"inbound_nodes":[[["dot_Dot6",0,0,{}]]]},{"name":"policy-model_merged","class_name":"Concatenate","config":{"axis":-1,"name":"policy-model_merged","trainable":true},"inbound_nodes":[[["policy-model_battlefieldInput",0,0,{}],["policy-model_tankInput",0,0,{}],["flatten_Flatten2",0,0,{}],["flatten_Flatten1",0,0,{}],["flatten_Flatten3",0,0,{}]]]},{"name":"policy-model_merged/policy-model_merged/dense0","class_name":"Dense","config":{"units":256,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"uniform","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"policy-model_merged/policy-model_merged/dense0","trainable":true},"inbound_nodes":[[["policy-model_merged",0,0,{}]]]},{"name":"policy-model_merged/policy-model_merged/dense1","class_name":"Dense","config":{"units":128,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"uniform","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"policy-model_merged/policy-model_merged/dense1","trainable":true},"inbound_nodes":[[["policy-model_merged/policy-model_merged/dense0",0,0,{}]]]},{"name":"policy-model_merged/policy-model_merged/dense2","class_name":"Dense","config":{"units":64,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"uniform","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"policy-model_merged/policy-model_merged/dense2","trainable":true},"inbound_nodes":[[["policy-model_merged/policy-model_merged/dense1",0,0,{}]]]},{"name":"policy-model_output","class_name":"Dense","config":{"units":10,"activation":"linear","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"policy-model_output","trainable":true},"inbound_nodes":[[["policy-model_merged/policy-model_merged/dense2",0,0,{}]]]}],"input_layers":[["policy-model_battlefieldInput",0,0],["policy-model_tankInput",0,0],["policy-model_enemiesInput",0,0],["policy-model_enemiesMaskInput",0,0],["policy-model_alliesInput",0,0],["policy-model_alliesMaskInput",0,0],["policy-model_bulletsInput",0,0],["policy-model_bulletsMaskInput",0,0]],"output_layers":[["policy-model_output",0,0]]},"keras_version":"tfjs-layers 4.22.0","backend":"tensor_flow.js"},"format":"layers-model","generatedBy":"TensorFlow.js tfjs-layers v4.22.0","convertedBy":null,"weightsManifest":[{"paths":["./policy-model.weights.bin"],"weights":[{"name":"policy-model_allies_denseQ/kernel","shape":[8,32],"dtype":"float32"},{"name":"policy-model_enemies_denseQ/kernel","shape":[8,32],"dtype":"float32"},{"name":"policy-model_bullets_denseQ/kernel","shape":[8,32],"dtype":"float32"},{"name":"policy-model_allies_denseK/kernel","shape":[7,32],"dtype":"float32"},{"name":"policy-model_enemies_denseK/kernel","shape":[7,32],"dtype":"float32"},{"name":"policy-model_bullets_denseK/kernel","shape":[4,32],"dtype":"float32"},{"name":"policy-model_allies_denseV/kernel","shape":[7,32],"dtype":"float32"},{"name":"policy-model_enemies_denseV/kernel","shape":[7,32],"dtype":"float32"},{"name":"policy-model_bullets_denseV/kernel","shape":[4,32],"dtype":"float32"},{"name":"policy-model_merged/policy-model_merged/dense0/kernel","shape":[108,256],"dtype":"float32"},{"name":"policy-model_merged/policy-model_merged/dense0/bias","shape":[256],"dtype":"float32"},{"name":"policy-model_merged/policy-model_merged/dense1/kernel","shape":[256,128],"dtype":"float32"},{"name":"policy-model_merged/policy-model_merged/dense1/bias","shape":[128],"dtype":"float32"},{"name":"policy-model_merged/policy-model_merged/dense2/kernel","shape":[128,64],"dtype":"float32"},{"name":"policy-model_merged/policy-model_merged/dense2/bias","shape":[64],"dtype":"float32"},{"name":"policy-model_output/kernel","shape":[64,10],"dtype":"float32"},{"name":"policy-model_output/bias","shape":[10],"dtype":"float32"},{"name":"iter","shape":[],"dtype":"int32","group":"optimizer"},{"name":"policy-model_allies_denseK/kernel/m","shape":[7,32],"dtype":"float32","group":"optimizer"},{"name":"policy-model_allies_denseQ/kernel/m","shape":[8,32],"dtype":"float32","group":"optimizer"},{"name":"policy-model_allies_denseV/kernel/m","shape":[7,32],"dtype":"float32","group":"optimizer"},{"name":"policy-model_bullets_denseK/kernel/m","shape":[4,32],"dtype":"float32","group":"optimizer"},{"name":"policy-model_bullets_denseQ/kernel/m","shape":[8,32],"dtype":"float32","group":"optimizer"},{"name":"policy-model_bullets_denseV/kernel/m","shape":[4,32],"dtype":"float32","group":"optimizer"},{"name":"policy-model_enemies_denseK/kernel/m","shape":[7,32],"dtype":"float32","group":"optimizer"},{"name":"policy-model_enemies_denseQ/kernel/m","shape":[8,32],"dtype":"float32","group":"optimizer"},{"name":"policy-model_enemies_denseV/kernel/m","shape":[7,32],"dtype":"float32","group":"optimizer"},{"name":"policy-model_merged/policy-model_merged/dense0/bias/m","shape":[256],"dtype":"float32","group":"optimizer"},{"name":"policy-model_merged/policy-model_merged/dense0/kernel/m","shape":[108,256],"dtype":"float32","group":"optimizer"},{"name":"policy-model_merged/policy-model_merged/dense1/bias/m","shape":[128],"dtype":"float32","group":"optimizer"},{"name":"policy-model_merged/policy-model_merged/dense1/kernel/m","shape":[256,128],"dtype":"float32","group":"optimizer"},{"name":"policy-model_merged/policy-model_merged/dense2/bias/m","shape":[64],"dtype":"float32","group":"optimizer"},{"name":"policy-model_merged/policy-model_merged/dense2/kernel/m","shape":[128,64],"dtype":"float32","group":"optimizer"},{"name":"policy-model_output/bias/m","shape":[10],"dtype":"float32","group":"optimizer"},{"name":"policy-model_output/kernel/m","shape":[64,10],"dtype":"float32","group":"optimizer"},{"name":"policy-model_allies_denseK/kernel/v","shape":[7,32],"dtype":"float32","group":"optimizer"},{"name":"policy-model_allies_denseQ/kernel/v","shape":[8,32],"dtype":"float32","group":"optimizer"},{"name":"policy-model_allies_denseV/kernel/v","shape":[7,32],"dtype":"float32","group":"optimizer"},{"name":"policy-model_bullets_denseK/kernel/v","shape":[4,32],"dtype":"float32","group":"optimizer"},{"name":"policy-model_bullets_denseQ/kernel/v","shape":[8,32],"dtype":"float32","group":"optimizer"},{"name":"policy-model_bullets_denseV/kernel/v","shape":[4,32],"dtype":"float32","group":"optimizer"},{"name":"policy-model_enemies_denseK/kernel/v","shape":[7,32],"dtype":"float32","group":"optimizer"},{"name":"policy-model_enemies_denseQ/kernel/v","shape":[8,32],"dtype":"float32","group":"optimizer"},{"name":"policy-model_enemies_denseV/kernel/v","shape":[7,32],"dtype":"float32","group":"optimizer"},{"name":"policy-model_merged/policy-model_merged/dense0/bias/v","shape":[256],"dtype":"float32","group":"optimizer"},{"name":"policy-model_merged/policy-model_merged/dense0/kernel/v","shape":[108,256],"dtype":"float32","group":"optimizer"},{"name":"policy-model_merged/policy-model_merged/dense1/bias/v","shape":[128],"dtype":"float32","group":"optimizer"},{"name":"policy-model_merged/policy-model_merged/dense1/kernel/v","shape":[256,128],"dtype":"float32","group":"optimizer"},{"name":"policy-model_merged/policy-model_merged/dense2/bias/v","shape":[64],"dtype":"float32","group":"optimizer"},{"name":"policy-model_merged/policy-model_merged/dense2/kernel/v","shape":[128,64],"dtype":"float32","group":"optimizer"},{"name":"policy-model_output/bias/v","shape":[10],"dtype":"float32","group":"optimizer"},{"name":"policy-model_output/kernel/v","shape":[64,10],"dtype":"float32","group":"optimizer"}]}],"trainingConfig":{"loss":"mean_squared_error","metrics":{},"optimizer_config":{"class_name":"Adam","config":{"learningRate":0.00011489644998808594,"beta1":0.9,"beta2":0.999,"epsilon":1e-7}}}}