{"modelTopology":{"class_name":"Model","config":{"name":"policy-model","layers":[{"name":"policy-model_bulletsInput","class_name":"InputLayer","config":{"batch_input_shape":[null,8,4],"dtype":"float32","sparse":false,"name":"policy-model_bulletsInput"},"inbound_nodes":[]},{"name":"policy-model_tankInput","class_name":"InputLayer","config":{"batch_input_shape":[null,10],"dtype":"float32","sparse":false,"name":"policy-model_tankInput"},"inbound_nodes":[]},{"name":"bullets_tokenTypeEmbedding","class_name":"VariableLayer","config":{"name":"bullets_tokenTypeEmbedding","trainable":true,"shape":[3],"initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}}},"inbound_nodes":[[["policy-model_bulletsInput",0,0,{}]]]},{"name":"policy-model_tankInput_3d","class_name":"Reshape","config":{"target_shape":[1,10],"name":"policy-model_tankInput_3d","trainable":true},"inbound_nodes":[[["policy-model_tankInput",0,0,{}]]]},{"name":"bullets_tokenTypeEmb_repeat","class_name":"RepeatVector","config":{"n":8,"name":"bullets_tokenTypeEmb_repeat","trainable":true},"inbound_nodes":[[["bullets_tokenTypeEmbedding",0,0,{}]]]},{"name":"tank_tokenTypeEmbedding","class_name":"VariableLayer","config":{"name":"tank_tokenTypeEmbedding","trainable":true,"shape":[3],"initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}}},"inbound_nodes":[[["policy-model_tankInput_3d",0,0,{}]]]},{"name":"policy-model_tankTypeInput","class_name":"InputLayer","config":{"batch_input_shape":[null,1],"dtype":"float32","sparse":false,"name":"policy-model_tankTypeInput"},"inbound_nodes":[]},{"name":"policy-model_turretRaysInput","class_name":"InputLayer","config":{"batch_input_shape":[null,1,3],"dtype":"float32","sparse":false,"name":"policy-model_turretRaysInput"},"inbound_nodes":[]},{"name":"bullets_concat","class_name":"Concatenate","config":{"axis":-1,"name":"bullets_concat","trainable":true},"inbound_nodes":[[["policy-model_bulletsInput",0,0,{}],["bullets_tokenTypeEmb_repeat",0,0,{}]]]},{"name":"policy-model_envRaysInput","class_name":"InputLayer","config":{"batch_input_shape":[null,12,3],"dtype":"float32","sparse":false,"name":"policy-model_envRaysInput"},"inbound_nodes":[]},{"name":"policy-model_alliesInput","class_name":"InputLayer","config":{"batch_input_shape":[null,5,5],"dtype":"float32","sparse":false,"name":"policy-model_alliesInput"},"inbound_nodes":[]},{"name":"policy-model_enemiesInput","class_name":"InputLayer","config":{"batch_input_shape":[null,5,5],"dtype":"float32","sparse":false,"name":"policy-model_enemiesInput"},"inbound_nodes":[]},{"name":"tank_tokenTypeEmb_repeat","class_name":"RepeatVector","config":{"n":1,"name":"tank_tokenTypeEmb_repeat","trainable":true},"inbound_nodes":[[["tank_tokenTypeEmbedding",0,0,{}]]]},{"name":"vehicleType_sharedEmbedding","class_name":"Embedding","config":{"input_dim":6,"output_dim":3,"embeddings_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"embeddings_regularizer":null,"activity_regularizer":null,"embeddings_constraint":null,"mask_zero":null,"input_length":null,"name":"vehicleType_sharedEmbedding","trainable":true,"batch_input_shape":[null,null],"dtype":"float32"},"inbound_nodes":[[["policy-model_tankTypeInput",0,0,{}]],[["policy-model_enemiesTypesInput",0,0,{}]],[["policy-model_alliesTypesInput",0,0,{}]]]},{"name":"turretRays_tokenTypeEmbedding","class_name":"VariableLayer","config":{"name":"turretRays_tokenTypeEmbedding","trainable":true,"shape":[3],"initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}}},"inbound_nodes":[[["policy-model_turretRaysInput",0,0,{}]]]},{"name":"policy-model_turretRaysTypes","class_name":"InputLayer","config":{"batch_input_shape":[null,1],"dtype":"float32","sparse":false,"name":"policy-model_turretRaysTypes"},"inbound_nodes":[]},{"name":"bullets_tokProj","class_name":"Dense","config":{"units":32,"activation":"linear","use_bias":false,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"bullets_tokProj","trainable":true},"inbound_nodes":[[["bullets_concat",0,0,{}]]]},{"name":"envRays_tokenTypeEmbedding","class_name":"VariableLayer","config":{"name":"envRays_tokenTypeEmbedding","trainable":true,"shape":[3],"initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}}},"inbound_nodes":[[["policy-model_envRaysInput",0,0,{}]]]},{"name":"policy-model_envRaysTypes","class_name":"InputLayer","config":{"batch_input_shape":[null,12],"dtype":"float32","sparse":false,"name":"policy-model_envRaysTypes"},"inbound_nodes":[]},{"name":"allies_tokenTypeEmbedding","class_name":"VariableLayer","config":{"name":"allies_tokenTypeEmbedding","trainable":true,"shape":[3],"initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}}},"inbound_nodes":[[["policy-model_alliesInput",0,0,{}]]]},{"name":"policy-model_alliesTypesInput","class_name":"InputLayer","config":{"batch_input_shape":[null,5],"dtype":"float32","sparse":false,"name":"policy-model_alliesTypesInput"},"inbound_nodes":[]},{"name":"enemies_tokenTypeEmbedding","class_name":"VariableLayer","config":{"name":"enemies_tokenTypeEmbedding","trainable":true,"shape":[3],"initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}}},"inbound_nodes":[[["policy-model_enemiesInput",0,0,{}]]]},{"name":"policy-model_enemiesTypesInput","class_name":"InputLayer","config":{"batch_input_shape":[null,5],"dtype":"float32","sparse":false,"name":"policy-model_enemiesTypesInput"},"inbound_nodes":[]},{"name":"tank_concat","class_name":"Concatenate","config":{"axis":-1,"name":"tank_concat","trainable":true},"inbound_nodes":[[["policy-model_tankInput_3d",0,0,{}],["tank_tokenTypeEmb_repeat",0,0,{}],["vehicleType_sharedEmbedding",0,0,{}]]]},{"name":"turretRays_tokenTypeEmb_repeat","class_name":"RepeatVector","config":{"n":1,"name":"turretRays_tokenTypeEmb_repeat","trainable":true},"inbound_nodes":[[["turretRays_tokenTypeEmbedding",0,0,{}]]]},{"name":"rayHitType_sharedEmbedding","class_name":"Embedding","config":{"input_dim":4,"output_dim":3,"embeddings_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"embeddings_regularizer":null,"activity_regularizer":null,"embeddings_constraint":null,"mask_zero":null,"input_length":null,"name":"rayHitType_sharedEmbedding","trainable":true,"batch_input_shape":[null,null],"dtype":"float32"},"inbound_nodes":[[["policy-model_envRaysTypes",0,0,{}]],[["policy-model_turretRaysTypes",0,0,{}]]]},{"name":"policy-model_clsBulletsToken","class_name":"VariableLayer","config":{"name":"policy-model_clsBulletsToken","trainable":true,"shape":[1,32],"initializer":{"class_name":"TruncatedNormal","config":{"mean":0,"stddev":0.05,"seed":null}}},"inbound_nodes":[[["bullets_tokProj",0,0,{}]]]},{"name":"envRays_tokenTypeEmb_repeat","class_name":"RepeatVector","config":{"n":12,"name":"envRays_tokenTypeEmb_repeat","trainable":true},"inbound_nodes":[[["envRays_tokenTypeEmbedding",0,0,{}]]]},{"name":"allies_tokenTypeEmb_repeat","class_name":"RepeatVector","config":{"n":5,"name":"allies_tokenTypeEmb_repeat","trainable":true},"inbound_nodes":[[["allies_tokenTypeEmbedding",0,0,{}]]]},{"name":"enemies_tokenTypeEmb_repeat","class_name":"RepeatVector","config":{"n":5,"name":"enemies_tokenTypeEmb_repeat","trainable":true},"inbound_nodes":[[["enemies_tokenTypeEmbedding",0,0,{}]]]},{"name":"tank_tokProj","class_name":"Dense","config":{"units":32,"activation":"linear","use_bias":false,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"tank_tokProj","trainable":true},"inbound_nodes":[[["tank_concat",0,0,{}]]]},{"name":"turretRays_concat","class_name":"Concatenate","config":{"axis":-1,"name":"turretRays_concat","trainable":true},"inbound_nodes":[[["policy-model_turretRaysInput",0,0,{}],["turretRays_tokenTypeEmb_repeat",0,0,{}],["rayHitType_sharedEmbedding",1,0,{}]]]},{"name":"policy-model_clsBulletsToken/policy-model_clsBulletsToken_qMaskLike","class_name":"MaskLike","config":{"name":"policy-model_clsBulletsToken/policy-model_clsBulletsToken_qMaskLike","trainable":true},"inbound_nodes":[[["policy-model_clsBulletsToken",0,0,{}]]]},{"name":"policy-model_bulletsMaskInput","class_name":"InputLayer","config":{"batch_input_shape":[null,8],"dtype":"float32","sparse":false,"name":"policy-model_bulletsMaskInput"},"inbound_nodes":[]},{"name":"envRays_concat","class_name":"Concatenate","config":{"axis":-1,"name":"envRays_concat","trainable":true},"inbound_nodes":[[["policy-model_envRaysInput",0,0,{}],["envRays_tokenTypeEmb_repeat",0,0,{}],["rayHitType_sharedEmbedding",0,0,{}]]]},{"name":"allies_concat","class_name":"Concatenate","config":{"axis":-1,"name":"allies_concat","trainable":true},"inbound_nodes":[[["policy-model_alliesInput",0,0,{}],["allies_tokenTypeEmb_repeat",0,0,{}],["vehicleType_sharedEmbedding",2,0,{}]]]},{"name":"enemies_concat","class_name":"Concatenate","config":{"axis":-1,"name":"enemies_concat","trainable":true},"inbound_nodes":[[["policy-model_enemiesInput",0,0,{}],["enemies_tokenTypeEmb_repeat",0,0,{}],["vehicleType_sharedEmbedding",1,0,{}]]]},{"name":"policy-model_clsToken","class_name":"VariableLayer","config":{"name":"policy-model_clsToken","trainable":true,"shape":[1,32],"initializer":{"class_name":"TruncatedNormal","config":{"mean":0,"stddev":0.05,"seed":null}}},"inbound_nodes":[[["tank_tokProj",0,0,{}]]]},{"name":"turretRays_tokProj","class_name":"Dense","config":{"units":32,"activation":"linear","use_bias":false,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"turretRays_tokProj","trainable":true},"inbound_nodes":[[["turretRays_concat",0,0,{}]]]},{"name":"policy-model_clsBulletsAttention_MultiHeadAttentionLayer","class_name":"MultiHeadAttention","config":{"name":"policy-model_clsBulletsAttention_MultiHeadAttentionLayer","trainable":true,"key_dim":16,"num_heads":2},"inbound_nodes":[[["policy-model_clsBulletsToken",0,0,{}],["policy-model_clsBulletsToken/policy-model_clsBulletsToken_qMaskLike",0,0,{}],["bullets_tokProj",0,0,{}],["policy-model_bulletsMaskInput",0,0,{}]]]},{"name":"envRays_tokProj","class_name":"Dense","config":{"units":32,"activation":"linear","use_bias":false,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"envRays_tokProj","trainable":true},"inbound_nodes":[[["envRays_concat",0,0,{}]]]},{"name":"allies_tokProj","class_name":"Dense","config":{"units":32,"activation":"linear","use_bias":false,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"allies_tokProj","trainable":true},"inbound_nodes":[[["allies_concat",0,0,{}]]]},{"name":"enemies_tokProj","class_name":"Dense","config":{"units":32,"activation":"linear","use_bias":false,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"enemies_tokProj","trainable":true},"inbound_nodes":[[["enemies_concat",0,0,{}]]]},{"name":"policy-model_inputTransformer_contextToken0","class_name":"Concatenate","config":{"axis":1,"name":"policy-model_inputTransformer_contextToken0","trainable":true},"inbound_nodes":[[["policy-model_clsToken",0,0,{}],["tank_tokProj",0,0,{}],["turretRays_tokProj",0,0,{}],["policy-model_clsBulletsAttention_MultiHeadAttentionLayer",0,0,{}],["envRays_tokProj",0,0,{}],["allies_tokProj",0,0,{}],["enemies_tokProj",0,0,{}]]]},{"name":"policy-model_maskLike","class_name":"MaskLike","config":{"name":"policy-model_maskLike","trainable":true},"inbound_nodes":[[["tank_tokProj",0,0,{}]],[["envRays_tokProj",0,0,{}]],[["turretRays_tokProj",0,0,{}]],[["tank_tokProj",0,0,{}]],[["envRays_tokProj",0,0,{}]],[["turretRays_tokProj",0,0,{}]],[["tank_tokProj",0,0,{}]],[["envRays_tokProj",0,0,{}]],[["turretRays_tokProj",0,0,{}]],[["tank_tokProj",0,0,{}]],[["envRays_tokProj",0,0,{}]],[["turretRays_tokProj",0,0,{}]],[["tank_tokProj",0,0,{}]],[["envRays_tokProj",0,0,{}]],[["turretRays_tokProj",0,0,{}]],[["tank_tokProj",0,0,{}]],[["envRays_tokProj",0,0,{}]],[["turretRays_tokProj",0,0,{}]],[["tank_tokProj",0,0,{}]],[["envRays_tokProj",0,0,{}]],[["turretRays_tokProj",0,0,{}]],[["tank_tokProj",0,0,{}]],[["envRays_tokProj",0,0,{}]],[["turretRays_tokProj",0,0,{}]],[["tank_tokProj",0,0,{}]],[["envRays_tokProj",0,0,{}]],[["turretRays_tokProj",0,0,{}]],[["tank_tokProj",0,0,{}]],[["envRays_tokProj",0,0,{}]],[["turretRays_tokProj",0,0,{}]],[["tank_tokProj",0,0,{}]],[["envRays_tokProj",0,0,{}]],[["turretRays_tokProj",0,0,{}]],[["tank_tokProj",0,0,{}]],[["envRays_tokProj",0,0,{}]],[["turretRays_tokProj",0,0,{}]]]},{"name":"policy-model_maskSquash","class_name":"MaskSquashLayer","config":{"name":"policy-model_maskSquash","trainable":true},"inbound_nodes":[[["policy-model_bulletsMaskInput",0,0,{}]],[["policy-model_bulletsMaskInput",0,0,{}]],[["policy-model_bulletsMaskInput",0,0,{}]],[["policy-model_bulletsMaskInput",0,0,{}]],[["policy-model_bulletsMaskInput",0,0,{}]],[["policy-model_bulletsMaskInput",0,0,{}]],[["policy-model_bulletsMaskInput",0,0,{}]],[["policy-model_bulletsMaskInput",0,0,{}]],[["policy-model_bulletsMaskInput",0,0,{}]],[["policy-model_bulletsMaskInput",0,0,{}]],[["policy-model_bulletsMaskInput",0,0,{}]],[["policy-model_bulletsMaskInput",0,0,{}]]]},{"name":"policy-model_alliesMaskInput","class_name":"InputLayer","config":{"batch_input_shape":[null,5],"dtype":"float32","sparse":false,"name":"policy-model_alliesMaskInput"},"inbound_nodes":[]},{"name":"policy-model_enemiesMaskInput","class_name":"InputLayer","config":{"batch_input_shape":[null,5],"dtype":"float32","sparse":false,"name":"policy-model_enemiesMaskInput"},"inbound_nodes":[]},{"name":"policy-model_inputTransformer/depth0_QNorm_policy-model_inputTransformer_contextToken0/policy-model_inputTransformer_contextToken0","class_name":"RMSNormLayer","config":{"name":"policy-model_inputTransformer/depth0_QNorm_policy-model_inputTransformer_contextToken0/policy-model_inputTransformer_contextToken0","trainable":true,"axis":-1,"epsilon":0.000001,"scale":true},"inbound_nodes":[[["policy-model_inputTransformer_contextToken0",0,0,{}]]]},{"name":"policy-model_inputTransformer/depth0_contextTokenMask0","class_name":"Concatenate","config":{"axis":1,"name":"policy-model_inputTransformer/depth0_contextTokenMask0","trainable":true},"inbound_nodes":[[["policy-model_maskLike",0,0,{}],["policy-model_maskLike",0,0,{}],["policy-model_maskLike",2,0,{}],["policy-model_maskSquash",0,0,{}],["policy-model_maskLike",1,0,{}],["policy-model_alliesMaskInput",0,0,{}],["policy-model_enemiesMaskInput",0,0,{}]]]},{"name":"policy-model_inputTransformer/depth0_KVNorm_policy-model_inputTransformer_contextToken0/policy-model_inputTransformer_contextToken0","class_name":"RMSNormLayer","config":{"name":"policy-model_inputTransformer/depth0_KVNorm_policy-model_inputTransformer_contextToken0/policy-model_inputTransformer_contextToken0","trainable":true,"axis":-1,"epsilon":0.000001,"scale":true},"inbound_nodes":[[["policy-model_inputTransformer_contextToken0",0,0,{}]]]},{"name":"policy-model_inputTransformer/depth0_MultiHeadAttentionLayer","class_name":"MultiHeadAttention","config":{"name":"policy-model_inputTransformer/depth0_MultiHeadAttentionLayer","trainable":true,"key_dim":16,"num_heads":2},"inbound_nodes":[[["policy-model_inputTransformer/depth0_QNorm_policy-model_inputTransformer_contextToken0/policy-model_inputTransformer_contextToken0",0,0,{}],["policy-model_inputTransformer/depth0_contextTokenMask0",0,0,{}],["policy-model_inputTransformer/depth0_KVNorm_policy-model_inputTransformer_contextToken0/policy-model_inputTransformer_contextToken0",0,0,{}],["policy-model_inputTransformer/depth0_contextTokenMask0",0,0,{}]]]},{"name":"policy-model_inputTransformer/depth0_residual","class_name":"Add","config":{"name":"policy-model_inputTransformer/depth0_residual","trainable":true},"inbound_nodes":[[["policy-model_inputTransformer_contextToken0",0,0,{}],["policy-model_inputTransformer/depth0_MultiHeadAttentionLayer",0,0,{}]]]},{"name":"policy-model_inputTransformer/depth0_ln2","class_name":"RMSNormLayer","config":{"name":"policy-model_inputTransformer/depth0_ln2","trainable":true,"axis":-1,"epsilon":0.000001,"scale":true},"inbound_nodes":[[["policy-model_inputTransformer/depth0_residual",0,0,{}]]]},{"name":"policy-model_inputTransformer/depth0_ffn1","class_name":"Dense","config":{"units":128,"activation":"relu","use_bias":false,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"policy-model_inputTransformer/depth0_ffn1","trainable":true},"inbound_nodes":[[["policy-model_inputTransformer/depth0_ln2",0,0,{}]]]},{"name":"policy-model_inputTransformer/depth0_ffn2","class_name":"Dense","config":{"units":32,"activation":"linear","use_bias":false,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"policy-model_inputTransformer/depth0_ffn2","trainable":true},"inbound_nodes":[[["policy-model_inputTransformer/depth0_ffn1",0,0,{}]]]},{"name":"policy-model_inputTransformer/depth0_ffnAdd","class_name":"Add","config":{"name":"policy-model_inputTransformer/depth0_ffnAdd","trainable":true},"inbound_nodes":[[["policy-model_inputTransformer/depth0_residual",0,0,{}],["policy-model_inputTransformer/depth0_ffn2",0,0,{}]]]},{"name":"policy-model_inputTransformer/depth1_QNorm_policy-model_inputTransformer/depth0_ffnAdd/policy-model_inputTransformer/depth0_ffnAdd","class_name":"RMSNormLayer","config":{"name":"policy-model_inputTransformer/depth1_QNorm_policy-model_inputTransformer/depth0_ffnAdd/policy-model_inputTransformer/depth0_ffnAdd","trainable":true,"axis":-1,"epsilon":0.000001,"scale":true},"inbound_nodes":[[["policy-model_inputTransformer/depth0_ffnAdd",0,0,{}]]]},{"name":"policy-model_inputTransformer/depth1_contextTokenMask1","class_name":"Concatenate","config":{"axis":1,"name":"policy-model_inputTransformer/depth1_contextTokenMask1","trainable":true},"inbound_nodes":[[["policy-model_maskLike",3,0,{}],["policy-model_maskLike",3,0,{}],["policy-model_maskLike",5,0,{}],["policy-model_maskSquash",1,0,{}],["policy-model_maskLike",4,0,{}],["policy-model_alliesMaskInput",0,0,{}],["policy-model_enemiesMaskInput",0,0,{}]]]},{"name":"policy-model_inputTransformer/depth1_KVNorm_policy-model_inputTransformer/depth0_ffnAdd/policy-model_inputTransformer/depth0_ffnAdd","class_name":"RMSNormLayer","config":{"name":"policy-model_inputTransformer/depth1_KVNorm_policy-model_inputTransformer/depth0_ffnAdd/policy-model_inputTransformer/depth0_ffnAdd","trainable":true,"axis":-1,"epsilon":0.000001,"scale":true},"inbound_nodes":[[["policy-model_inputTransformer/depth0_ffnAdd",0,0,{}]]]},{"name":"policy-model_inputTransformer/depth1_MultiHeadAttentionLayer","class_name":"MultiHeadAttention","config":{"name":"policy-model_inputTransformer/depth1_MultiHeadAttentionLayer","trainable":true,"key_dim":16,"num_heads":2},"inbound_nodes":[[["policy-model_inputTransformer/depth1_QNorm_policy-model_inputTransformer/depth0_ffnAdd/policy-model_inputTransformer/depth0_ffnAdd",0,0,{}],["policy-model_inputTransformer/depth1_contextTokenMask1",0,0,{}],["policy-model_inputTransformer/depth1_KVNorm_policy-model_inputTransformer/depth0_ffnAdd/policy-model_inputTransformer/depth0_ffnAdd",0,0,{}],["policy-model_inputTransformer/depth1_contextTokenMask1",0,0,{}]]]},{"name":"policy-model_inputTransformer/depth1_residual","class_name":"Add","config":{"name":"policy-model_inputTransformer/depth1_residual","trainable":true},"inbound_nodes":[[["policy-model_inputTransformer/depth0_ffnAdd",0,0,{}],["policy-model_inputTransformer/depth1_MultiHeadAttentionLayer",0,0,{}]]]},{"name":"policy-model_inputTransformer/depth1_ln2","class_name":"RMSNormLayer","config":{"name":"policy-model_inputTransformer/depth1_ln2","trainable":true,"axis":-1,"epsilon":0.000001,"scale":true},"inbound_nodes":[[["policy-model_inputTransformer/depth1_residual",0,0,{}]]]},{"name":"policy-model_inputTransformer/depth1_ffn1","class_name":"Dense","config":{"units":128,"activation":"relu","use_bias":false,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"policy-model_inputTransformer/depth1_ffn1","trainable":true},"inbound_nodes":[[["policy-model_inputTransformer/depth1_ln2",0,0,{}]]]},{"name":"policy-model_inputTransformer/depth1_ffn2","class_name":"Dense","config":{"units":32,"activation":"linear","use_bias":false,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"policy-model_inputTransformer/depth1_ffn2","trainable":true},"inbound_nodes":[[["policy-model_inputTransformer/depth1_ffn1",0,0,{}]]]},{"name":"policy-model_inputTransformer/depth1_ffnAdd","class_name":"Add","config":{"name":"policy-model_inputTransformer/depth1_ffnAdd","trainable":true},"inbound_nodes":[[["policy-model_inputTransformer/depth1_residual",0,0,{}],["policy-model_inputTransformer/depth1_ffn2",0,0,{}]]]},{"name":"policy-model_inputTransformer/depth2_QNorm_policy-model_inputTransformer/depth1_ffnAdd/policy-model_inputTransformer/depth1_ffnAdd","class_name":"RMSNormLayer","config":{"name":"policy-model_inputTransformer/depth2_QNorm_policy-model_inputTransformer/depth1_ffnAdd/policy-model_inputTransformer/depth1_ffnAdd","trainable":true,"axis":-1,"epsilon":0.000001,"scale":true},"inbound_nodes":[[["policy-model_inputTransformer/depth1_ffnAdd",0,0,{}]]]},{"name":"policy-model_inputTransformer/depth2_contextTokenMask2","class_name":"Concatenate","config":{"axis":1,"name":"policy-model_inputTransformer/depth2_contextTokenMask2","trainable":true},"inbound_nodes":[[["policy-model_maskLike",6,0,{}],["policy-model_maskLike",6,0,{}],["policy-model_maskLike",8,0,{}],["policy-model_maskSquash",2,0,{}],["policy-model_maskLike",7,0,{}],["policy-model_alliesMaskInput",0,0,{}],["policy-model_enemiesMaskInput",0,0,{}]]]},{"name":"policy-model_inputTransformer/depth2_KVNorm_policy-model_inputTransformer/depth1_ffnAdd/policy-model_inputTransformer/depth1_ffnAdd","class_name":"RMSNormLayer","config":{"name":"policy-model_inputTransformer/depth2_KVNorm_policy-model_inputTransformer/depth1_ffnAdd/policy-model_inputTransformer/depth1_ffnAdd","trainable":true,"axis":-1,"epsilon":0.000001,"scale":true},"inbound_nodes":[[["policy-model_inputTransformer/depth1_ffnAdd",0,0,{}]]]},{"name":"policy-model_inputTransformer/depth2_MultiHeadAttentionLayer","class_name":"MultiHeadAttention","config":{"name":"policy-model_inputTransformer/depth2_MultiHeadAttentionLayer","trainable":true,"key_dim":16,"num_heads":2},"inbound_nodes":[[["policy-model_inputTransformer/depth2_QNorm_policy-model_inputTransformer/depth1_ffnAdd/policy-model_inputTransformer/depth1_ffnAdd",0,0,{}],["policy-model_inputTransformer/depth2_contextTokenMask2",0,0,{}],["policy-model_inputTransformer/depth2_KVNorm_policy-model_inputTransformer/depth1_ffnAdd/policy-model_inputTransformer/depth1_ffnAdd",0,0,{}],["policy-model_inputTransformer/depth2_contextTokenMask2",0,0,{}]]]},{"name":"policy-model_inputTransformer/depth2_residual","class_name":"Add","config":{"name":"policy-model_inputTransformer/depth2_residual","trainable":true},"inbound_nodes":[[["policy-model_inputTransformer/depth1_ffnAdd",0,0,{}],["policy-model_inputTransformer/depth2_MultiHeadAttentionLayer",0,0,{}]]]},{"name":"policy-model_inputTransformer/depth2_ln2","class_name":"RMSNormLayer","config":{"name":"policy-model_inputTransformer/depth2_ln2","trainable":true,"axis":-1,"epsilon":0.000001,"scale":true},"inbound_nodes":[[["policy-model_inputTransformer/depth2_residual",0,0,{}]]]},{"name":"policy-model_inputTransformer/depth2_ffn1","class_name":"Dense","config":{"units":128,"activation":"relu","use_bias":false,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"policy-model_inputTransformer/depth2_ffn1","trainable":true},"inbound_nodes":[[["policy-model_inputTransformer/depth2_ln2",0,0,{}]]]},{"name":"policy-model_inputTransformer/depth2_ffn2","class_name":"Dense","config":{"units":32,"activation":"linear","use_bias":false,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"policy-model_inputTransformer/depth2_ffn2","trainable":true},"inbound_nodes":[[["policy-model_inputTransformer/depth2_ffn1",0,0,{}]]]},{"name":"policy-model_inputTransformer/depth2_ffnAdd","class_name":"Add","config":{"name":"policy-model_inputTransformer/depth2_ffnAdd","trainable":true},"inbound_nodes":[[["policy-model_inputTransformer/depth2_residual",0,0,{}],["policy-model_inputTransformer/depth2_ffn2",0,0,{}]]]},{"name":"policy-model_inputTransformer/depth3_QNorm_policy-model_inputTransformer/depth2_ffnAdd/policy-model_inputTransformer/depth2_ffnAdd","class_name":"RMSNormLayer","config":{"name":"policy-model_inputTransformer/depth3_QNorm_policy-model_inputTransformer/depth2_ffnAdd/policy-model_inputTransformer/depth2_ffnAdd","trainable":true,"axis":-1,"epsilon":0.000001,"scale":true},"inbound_nodes":[[["policy-model_inputTransformer/depth2_ffnAdd",0,0,{}]]]},{"name":"policy-model_inputTransformer/depth3_contextTokenMask3","class_name":"Concatenate","config":{"axis":1,"name":"policy-model_inputTransformer/depth3_contextTokenMask3","trainable":true},"inbound_nodes":[[["policy-model_maskLike",9,0,{}],["policy-model_maskLike",9,0,{}],["policy-model_maskLike",11,0,{}],["policy-model_maskSquash",3,0,{}],["policy-model_maskLike",10,0,{}],["policy-model_alliesMaskInput",0,0,{}],["policy-model_enemiesMaskInput",0,0,{}]]]},{"name":"policy-model_inputTransformer/depth3_KVNorm_policy-model_inputTransformer/depth2_ffnAdd/policy-model_inputTransformer/depth2_ffnAdd","class_name":"RMSNormLayer","config":{"name":"policy-model_inputTransformer/depth3_KVNorm_policy-model_inputTransformer/depth2_ffnAdd/policy-model_inputTransformer/depth2_ffnAdd","trainable":true,"axis":-1,"epsilon":0.000001,"scale":true},"inbound_nodes":[[["policy-model_inputTransformer/depth2_ffnAdd",0,0,{}]]]},{"name":"policy-model_inputTransformer/depth3_MultiHeadAttentionLayer","class_name":"MultiHeadAttention","config":{"name":"policy-model_inputTransformer/depth3_MultiHeadAttentionLayer","trainable":true,"key_dim":16,"num_heads":2},"inbound_nodes":[[["policy-model_inputTransformer/depth3_QNorm_policy-model_inputTransformer/depth2_ffnAdd/policy-model_inputTransformer/depth2_ffnAdd",0,0,{}],["policy-model_inputTransformer/depth3_contextTokenMask3",0,0,{}],["policy-model_inputTransformer/depth3_KVNorm_policy-model_inputTransformer/depth2_ffnAdd/policy-model_inputTransformer/depth2_ffnAdd",0,0,{}],["policy-model_inputTransformer/depth3_contextTokenMask3",0,0,{}]]]},{"name":"policy-model_inputTransformer/depth3_residual","class_name":"Add","config":{"name":"policy-model_inputTransformer/depth3_residual","trainable":true},"inbound_nodes":[[["policy-model_inputTransformer/depth2_ffnAdd",0,0,{}],["policy-model_inputTransformer/depth3_MultiHeadAttentionLayer",0,0,{}]]]},{"name":"policy-model_inputTransformer/depth3_ln2","class_name":"RMSNormLayer","config":{"name":"policy-model_inputTransformer/depth3_ln2","trainable":true,"axis":-1,"epsilon":0.000001,"scale":true},"inbound_nodes":[[["policy-model_inputTransformer/depth3_residual",0,0,{}]]]},{"name":"policy-model_inputTransformer/depth3_ffn1","class_name":"Dense","config":{"units":128,"activation":"relu","use_bias":false,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"policy-model_inputTransformer/depth3_ffn1","trainable":true},"inbound_nodes":[[["policy-model_inputTransformer/depth3_ln2",0,0,{}]]]},{"name":"policy-model_inputTransformer/depth3_ffn2","class_name":"Dense","config":{"units":32,"activation":"linear","use_bias":false,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"policy-model_inputTransformer/depth3_ffn2","trainable":true},"inbound_nodes":[[["policy-model_inputTransformer/depth3_ffn1",0,0,{}]]]},{"name":"policy-model_inputTransformer/depth3_ffnAdd","class_name":"Add","config":{"name":"policy-model_inputTransformer/depth3_ffnAdd","trainable":true},"inbound_nodes":[[["policy-model_inputTransformer/depth3_residual",0,0,{}],["policy-model_inputTransformer/depth3_ffn2",0,0,{}]]]},{"name":"policy-model_inputTransformer/depth4_QNorm_policy-model_inputTransformer/depth3_ffnAdd/policy-model_inputTransformer/depth3_ffnAdd","class_name":"RMSNormLayer","config":{"name":"policy-model_inputTransformer/depth4_QNorm_policy-model_inputTransformer/depth3_ffnAdd/policy-model_inputTransformer/depth3_ffnAdd","trainable":true,"axis":-1,"epsilon":0.000001,"scale":true},"inbound_nodes":[[["policy-model_inputTransformer/depth3_ffnAdd",0,0,{}]]]},{"name":"policy-model_inputTransformer/depth4_contextTokenMask4","class_name":"Concatenate","config":{"axis":1,"name":"policy-model_inputTransformer/depth4_contextTokenMask4","trainable":true},"inbound_nodes":[[["policy-model_maskLike",12,0,{}],["policy-model_maskLike",12,0,{}],["policy-model_maskLike",14,0,{}],["policy-model_maskSquash",4,0,{}],["policy-model_maskLike",13,0,{}],["policy-model_alliesMaskInput",0,0,{}],["policy-model_enemiesMaskInput",0,0,{}]]]},{"name":"policy-model_inputTransformer/depth4_KVNorm_policy-model_inputTransformer/depth3_ffnAdd/policy-model_inputTransformer/depth3_ffnAdd","class_name":"RMSNormLayer","config":{"name":"policy-model_inputTransformer/depth4_KVNorm_policy-model_inputTransformer/depth3_ffnAdd/policy-model_inputTransformer/depth3_ffnAdd","trainable":true,"axis":-1,"epsilon":0.000001,"scale":true},"inbound_nodes":[[["policy-model_inputTransformer/depth3_ffnAdd",0,0,{}]]]},{"name":"policy-model_inputTransformer/depth4_MultiHeadAttentionLayer","class_name":"MultiHeadAttention","config":{"name":"policy-model_inputTransformer/depth4_MultiHeadAttentionLayer","trainable":true,"key_dim":16,"num_heads":2},"inbound_nodes":[[["policy-model_inputTransformer/depth4_QNorm_policy-model_inputTransformer/depth3_ffnAdd/policy-model_inputTransformer/depth3_ffnAdd",0,0,{}],["policy-model_inputTransformer/depth4_contextTokenMask4",0,0,{}],["policy-model_inputTransformer/depth4_KVNorm_policy-model_inputTransformer/depth3_ffnAdd/policy-model_inputTransformer/depth3_ffnAdd",0,0,{}],["policy-model_inputTransformer/depth4_contextTokenMask4",0,0,{}]]]},{"name":"policy-model_inputTransformer/depth4_residual","class_name":"Add","config":{"name":"policy-model_inputTransformer/depth4_residual","trainable":true},"inbound_nodes":[[["policy-model_inputTransformer/depth3_ffnAdd",0,0,{}],["policy-model_inputTransformer/depth4_MultiHeadAttentionLayer",0,0,{}]]]},{"name":"policy-model_inputTransformer/depth4_ln2","class_name":"RMSNormLayer","config":{"name":"policy-model_inputTransformer/depth4_ln2","trainable":true,"axis":-1,"epsilon":0.000001,"scale":true},"inbound_nodes":[[["policy-model_inputTransformer/depth4_residual",0,0,{}]]]},{"name":"policy-model_inputTransformer/depth4_ffn1","class_name":"Dense","config":{"units":128,"activation":"relu","use_bias":false,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"policy-model_inputTransformer/depth4_ffn1","trainable":true},"inbound_nodes":[[["policy-model_inputTransformer/depth4_ln2",0,0,{}]]]},{"name":"policy-model_inputTransformer/depth4_ffn2","class_name":"Dense","config":{"units":32,"activation":"linear","use_bias":false,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"policy-model_inputTransformer/depth4_ffn2","trainable":true},"inbound_nodes":[[["policy-model_inputTransformer/depth4_ffn1",0,0,{}]]]},{"name":"policy-model_inputTransformer/depth4_ffnAdd","class_name":"Add","config":{"name":"policy-model_inputTransformer/depth4_ffnAdd","trainable":true},"inbound_nodes":[[["policy-model_inputTransformer/depth4_residual",0,0,{}],["policy-model_inputTransformer/depth4_ffn2",0,0,{}]]]},{"name":"policy-model_inputTransformer/depth5_QNorm_policy-model_inputTransformer/depth4_ffnAdd/policy-model_inputTransformer/depth4_ffnAdd","class_name":"RMSNormLayer","config":{"name":"policy-model_inputTransformer/depth5_QNorm_policy-model_inputTransformer/depth4_ffnAdd/policy-model_inputTransformer/depth4_ffnAdd","trainable":true,"axis":-1,"epsilon":0.000001,"scale":true},"inbound_nodes":[[["policy-model_inputTransformer/depth4_ffnAdd",0,0,{}]]]},{"name":"policy-model_inputTransformer/depth5_contextTokenMask5","class_name":"Concatenate","config":{"axis":1,"name":"policy-model_inputTransformer/depth5_contextTokenMask5","trainable":true},"inbound_nodes":[[["policy-model_maskLike",15,0,{}],["policy-model_maskLike",15,0,{}],["policy-model_maskLike",17,0,{}],["policy-model_maskSquash",5,0,{}],["policy-model_maskLike",16,0,{}],["policy-model_alliesMaskInput",0,0,{}],["policy-model_enemiesMaskInput",0,0,{}]]]},{"name":"policy-model_inputTransformer/depth5_KVNorm_policy-model_inputTransformer/depth4_ffnAdd/policy-model_inputTransformer/depth4_ffnAdd","class_name":"RMSNormLayer","config":{"name":"policy-model_inputTransformer/depth5_KVNorm_policy-model_inputTransformer/depth4_ffnAdd/policy-model_inputTransformer/depth4_ffnAdd","trainable":true,"axis":-1,"epsilon":0.000001,"scale":true},"inbound_nodes":[[["policy-model_inputTransformer/depth4_ffnAdd",0,0,{}]]]},{"name":"policy-model_inputTransformer/depth5_MultiHeadAttentionLayer","class_name":"MultiHeadAttention","config":{"name":"policy-model_inputTransformer/depth5_MultiHeadAttentionLayer","trainable":true,"key_dim":16,"num_heads":2},"inbound_nodes":[[["policy-model_inputTransformer/depth5_QNorm_policy-model_inputTransformer/depth4_ffnAdd/policy-model_inputTransformer/depth4_ffnAdd",0,0,{}],["policy-model_inputTransformer/depth5_contextTokenMask5",0,0,{}],["policy-model_inputTransformer/depth5_KVNorm_policy-model_inputTransformer/depth4_ffnAdd/policy-model_inputTransformer/depth4_ffnAdd",0,0,{}],["policy-model_inputTransformer/depth5_contextTokenMask5",0,0,{}]]]},{"name":"policy-model_inputTransformer/depth5_residual","class_name":"Add","config":{"name":"policy-model_inputTransformer/depth5_residual","trainable":true},"inbound_nodes":[[["policy-model_inputTransformer/depth4_ffnAdd",0,0,{}],["policy-model_inputTransformer/depth5_MultiHeadAttentionLayer",0,0,{}]]]},{"name":"policy-model_inputTransformer/depth5_ln2","class_name":"RMSNormLayer","config":{"name":"policy-model_inputTransformer/depth5_ln2","trainable":true,"axis":-1,"epsilon":0.000001,"scale":true},"inbound_nodes":[[["policy-model_inputTransformer/depth5_residual",0,0,{}]]]},{"name":"policy-model_inputTransformer/depth5_ffn1","class_name":"Dense","config":{"units":128,"activation":"relu","use_bias":false,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"policy-model_inputTransformer/depth5_ffn1","trainable":true},"inbound_nodes":[[["policy-model_inputTransformer/depth5_ln2",0,0,{}]]]},{"name":"policy-model_inputTransformer/depth5_ffn2","class_name":"Dense","config":{"units":32,"activation":"linear","use_bias":false,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"policy-model_inputTransformer/depth5_ffn2","trainable":true},"inbound_nodes":[[["policy-model_inputTransformer/depth5_ffn1",0,0,{}]]]},{"name":"policy-model_inputTransformer/depth5_ffnAdd","class_name":"Add","config":{"name":"policy-model_inputTransformer/depth5_ffnAdd","trainable":true},"inbound_nodes":[[["policy-model_inputTransformer/depth5_residual",0,0,{}],["policy-model_inputTransformer/depth5_ffn2",0,0,{}]]]},{"name":"policy-model_inputTransformer/depth6_QNorm_policy-model_inputTransformer/depth5_ffnAdd/policy-model_inputTransformer/depth5_ffnAdd","class_name":"RMSNormLayer","config":{"name":"policy-model_inputTransformer/depth6_QNorm_policy-model_inputTransformer/depth5_ffnAdd/policy-model_inputTransformer/depth5_ffnAdd","trainable":true,"axis":-1,"epsilon":0.000001,"scale":true},"inbound_nodes":[[["policy-model_inputTransformer/depth5_ffnAdd",0,0,{}]]]},{"name":"policy-model_inputTransformer/depth6_contextTokenMask6","class_name":"Concatenate","config":{"axis":1,"name":"policy-model_inputTransformer/depth6_contextTokenMask6","trainable":true},"inbound_nodes":[[["policy-model_maskLike",18,0,{}],["policy-model_maskLike",18,0,{}],["policy-model_maskLike",20,0,{}],["policy-model_maskSquash",6,0,{}],["policy-model_maskLike",19,0,{}],["policy-model_alliesMaskInput",0,0,{}],["policy-model_enemiesMaskInput",0,0,{}]]]},{"name":"policy-model_inputTransformer/depth6_KVNorm_policy-model_inputTransformer/depth5_ffnAdd/policy-model_inputTransformer/depth5_ffnAdd","class_name":"RMSNormLayer","config":{"name":"policy-model_inputTransformer/depth6_KVNorm_policy-model_inputTransformer/depth5_ffnAdd/policy-model_inputTransformer/depth5_ffnAdd","trainable":true,"axis":-1,"epsilon":0.000001,"scale":true},"inbound_nodes":[[["policy-model_inputTransformer/depth5_ffnAdd",0,0,{}]]]},{"name":"policy-model_inputTransformer/depth6_MultiHeadAttentionLayer","class_name":"MultiHeadAttention","config":{"name":"policy-model_inputTransformer/depth6_MultiHeadAttentionLayer","trainable":true,"key_dim":16,"num_heads":2},"inbound_nodes":[[["policy-model_inputTransformer/depth6_QNorm_policy-model_inputTransformer/depth5_ffnAdd/policy-model_inputTransformer/depth5_ffnAdd",0,0,{}],["policy-model_inputTransformer/depth6_contextTokenMask6",0,0,{}],["policy-model_inputTransformer/depth6_KVNorm_policy-model_inputTransformer/depth5_ffnAdd/policy-model_inputTransformer/depth5_ffnAdd",0,0,{}],["policy-model_inputTransformer/depth6_contextTokenMask6",0,0,{}]]]},{"name":"policy-model_inputTransformer/depth6_residual","class_name":"Add","config":{"name":"policy-model_inputTransformer/depth6_residual","trainable":true},"inbound_nodes":[[["policy-model_inputTransformer/depth5_ffnAdd",0,0,{}],["policy-model_inputTransformer/depth6_MultiHeadAttentionLayer",0,0,{}]]]},{"name":"policy-model_inputTransformer/depth6_ln2","class_name":"RMSNormLayer","config":{"name":"policy-model_inputTransformer/depth6_ln2","trainable":true,"axis":-1,"epsilon":0.000001,"scale":true},"inbound_nodes":[[["policy-model_inputTransformer/depth6_residual",0,0,{}]]]},{"name":"policy-model_inputTransformer/depth6_ffn1","class_name":"Dense","config":{"units":128,"activation":"relu","use_bias":false,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"policy-model_inputTransformer/depth6_ffn1","trainable":true},"inbound_nodes":[[["policy-model_inputTransformer/depth6_ln2",0,0,{}]]]},{"name":"policy-model_inputTransformer/depth6_ffn2","class_name":"Dense","config":{"units":32,"activation":"linear","use_bias":false,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"policy-model_inputTransformer/depth6_ffn2","trainable":true},"inbound_nodes":[[["policy-model_inputTransformer/depth6_ffn1",0,0,{}]]]},{"name":"policy-model_inputTransformer/depth6_ffnAdd","class_name":"Add","config":{"name":"policy-model_inputTransformer/depth6_ffnAdd","trainable":true},"inbound_nodes":[[["policy-model_inputTransformer/depth6_residual",0,0,{}],["policy-model_inputTransformer/depth6_ffn2",0,0,{}]]]},{"name":"policy-model_inputTransformer/depth7_QNorm_policy-model_inputTransformer/depth6_ffnAdd/policy-model_inputTransformer/depth6_ffnAdd","class_name":"RMSNormLayer","config":{"name":"policy-model_inputTransformer/depth7_QNorm_policy-model_inputTransformer/depth6_ffnAdd/policy-model_inputTransformer/depth6_ffnAdd","trainable":true,"axis":-1,"epsilon":0.000001,"scale":true},"inbound_nodes":[[["policy-model_inputTransformer/depth6_ffnAdd",0,0,{}]]]},{"name":"policy-model_inputTransformer/depth7_contextTokenMask7","class_name":"Concatenate","config":{"axis":1,"name":"policy-model_inputTransformer/depth7_contextTokenMask7","trainable":true},"inbound_nodes":[[["policy-model_maskLike",21,0,{}],["policy-model_maskLike",21,0,{}],["policy-model_maskLike",23,0,{}],["policy-model_maskSquash",7,0,{}],["policy-model_maskLike",22,0,{}],["policy-model_alliesMaskInput",0,0,{}],["policy-model_enemiesMaskInput",0,0,{}]]]},{"name":"policy-model_inputTransformer/depth7_KVNorm_policy-model_inputTransformer/depth6_ffnAdd/policy-model_inputTransformer/depth6_ffnAdd","class_name":"RMSNormLayer","config":{"name":"policy-model_inputTransformer/depth7_KVNorm_policy-model_inputTransformer/depth6_ffnAdd/policy-model_inputTransformer/depth6_ffnAdd","trainable":true,"axis":-1,"epsilon":0.000001,"scale":true},"inbound_nodes":[[["policy-model_inputTransformer/depth6_ffnAdd",0,0,{}]]]},{"name":"policy-model_inputTransformer/depth7_MultiHeadAttentionLayer","class_name":"MultiHeadAttention","config":{"name":"policy-model_inputTransformer/depth7_MultiHeadAttentionLayer","trainable":true,"key_dim":16,"num_heads":2},"inbound_nodes":[[["policy-model_inputTransformer/depth7_QNorm_policy-model_inputTransformer/depth6_ffnAdd/policy-model_inputTransformer/depth6_ffnAdd",0,0,{}],["policy-model_inputTransformer/depth7_contextTokenMask7",0,0,{}],["policy-model_inputTransformer/depth7_KVNorm_policy-model_inputTransformer/depth6_ffnAdd/policy-model_inputTransformer/depth6_ffnAdd",0,0,{}],["policy-model_inputTransformer/depth7_contextTokenMask7",0,0,{}]]]},{"name":"policy-model_inputTransformer/depth7_residual","class_name":"Add","config":{"name":"policy-model_inputTransformer/depth7_residual","trainable":true},"inbound_nodes":[[["policy-model_inputTransformer/depth6_ffnAdd",0,0,{}],["policy-model_inputTransformer/depth7_MultiHeadAttentionLayer",0,0,{}]]]},{"name":"policy-model_inputTransformer/depth7_ln2","class_name":"RMSNormLayer","config":{"name":"policy-model_inputTransformer/depth7_ln2","trainable":true,"axis":-1,"epsilon":0.000001,"scale":true},"inbound_nodes":[[["policy-model_inputTransformer/depth7_residual",0,0,{}]]]},{"name":"policy-model_inputTransformer/depth7_ffn1","class_name":"Dense","config":{"units":128,"activation":"relu","use_bias":false,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"policy-model_inputTransformer/depth7_ffn1","trainable":true},"inbound_nodes":[[["policy-model_inputTransformer/depth7_ln2",0,0,{}]]]},{"name":"policy-model_inputTransformer/depth7_ffn2","class_name":"Dense","config":{"units":32,"activation":"linear","use_bias":false,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"policy-model_inputTransformer/depth7_ffn2","trainable":true},"inbound_nodes":[[["policy-model_inputTransformer/depth7_ffn1",0,0,{}]]]},{"name":"policy-model_inputTransformer/depth7_ffnAdd","class_name":"Add","config":{"name":"policy-model_inputTransformer/depth7_ffnAdd","trainable":true},"inbound_nodes":[[["policy-model_inputTransformer/depth7_residual",0,0,{}],["policy-model_inputTransformer/depth7_ffn2",0,0,{}]]]},{"name":"policy-model_inputTransformer/depth8_QNorm_policy-model_inputTransformer/depth7_ffnAdd/policy-model_inputTransformer/depth7_ffnAdd","class_name":"RMSNormLayer","config":{"name":"policy-model_inputTransformer/depth8_QNorm_policy-model_inputTransformer/depth7_ffnAdd/policy-model_inputTransformer/depth7_ffnAdd","trainable":true,"axis":-1,"epsilon":0.000001,"scale":true},"inbound_nodes":[[["policy-model_inputTransformer/depth7_ffnAdd",0,0,{}]]]},{"name":"policy-model_inputTransformer/depth8_contextTokenMask8","class_name":"Concatenate","config":{"axis":1,"name":"policy-model_inputTransformer/depth8_contextTokenMask8","trainable":true},"inbound_nodes":[[["policy-model_maskLike",24,0,{}],["policy-model_maskLike",24,0,{}],["policy-model_maskLike",26,0,{}],["policy-model_maskSquash",8,0,{}],["policy-model_maskLike",25,0,{}],["policy-model_alliesMaskInput",0,0,{}],["policy-model_enemiesMaskInput",0,0,{}]]]},{"name":"policy-model_inputTransformer/depth8_KVNorm_policy-model_inputTransformer/depth7_ffnAdd/policy-model_inputTransformer/depth7_ffnAdd","class_name":"RMSNormLayer","config":{"name":"policy-model_inputTransformer/depth8_KVNorm_policy-model_inputTransformer/depth7_ffnAdd/policy-model_inputTransformer/depth7_ffnAdd","trainable":true,"axis":-1,"epsilon":0.000001,"scale":true},"inbound_nodes":[[["policy-model_inputTransformer/depth7_ffnAdd",0,0,{}]]]},{"name":"policy-model_inputTransformer/depth8_MultiHeadAttentionLayer","class_name":"MultiHeadAttention","config":{"name":"policy-model_inputTransformer/depth8_MultiHeadAttentionLayer","trainable":true,"key_dim":16,"num_heads":2},"inbound_nodes":[[["policy-model_inputTransformer/depth8_QNorm_policy-model_inputTransformer/depth7_ffnAdd/policy-model_inputTransformer/depth7_ffnAdd",0,0,{}],["policy-model_inputTransformer/depth8_contextTokenMask8",0,0,{}],["policy-model_inputTransformer/depth8_KVNorm_policy-model_inputTransformer/depth7_ffnAdd/policy-model_inputTransformer/depth7_ffnAdd",0,0,{}],["policy-model_inputTransformer/depth8_contextTokenMask8",0,0,{}]]]},