{"modelTopology":{"class_name":"Model","config":{"name":"value-model","layers":[{"name":"value-model_tankInput","class_name":"InputLayer","config":{"batch_input_shape":[null,10],"dtype":"float32","sparse":false,"name":"value-model_tankInput"},"inbound_nodes":[]},{"name":"value-model_tankInput_tokProj","class_name":"Dense","config":{"units":16,"activation":"linear","use_bias":false,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"value-model_tankInput_tokProj","trainable":true},"inbound_nodes":[[["value-model_tankInput",0,0,{}]]]},{"name":"value-model_bulletsInput","class_name":"InputLayer","config":{"batch_input_shape":[null,8,4],"dtype":"float32","sparse":false,"name":"value-model_bulletsInput"},"inbound_nodes":[]},{"name":"value-model_tankInput_tokProj/value-model_tankInput_tokProj_typeEmbedding","class_name":"VariableLayer","config":{"name":"value-model_tankInput_tokProj/value-model_tankInput_tokProj_typeEmbedding","trainable":true,"shape":[16],"initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}}},"inbound_nodes":[[["value-model_tankInput_tokProj",0,0,{}]]]},{"name":"value-model_alliesInput","class_name":"InputLayer","config":{"batch_input_shape":[null,3,10],"dtype":"float32","sparse":false,"name":"value-model_alliesInput"},"inbound_nodes":[]},{"name":"value-model_enemiesInput","class_name":"InputLayer","config":{"batch_input_shape":[null,3,10],"dtype":"float32","sparse":false,"name":"value-model_enemiesInput"},"inbound_nodes":[]},{"name":"value-model_bulletsInput_tokProj","class_name":"Dense","config":{"units":16,"activation":"linear","use_bias":false,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"value-model_bulletsInput_tokProj","trainable":true},"inbound_nodes":[[["value-model_bulletsInput",0,0,{}]]]},{"name":"value-model_tankInput_tokProj/value-model_tankInput_tokProj_withTypeEmbedding","class_name":"Add","config":{"name":"value-model_tankInput_tokProj/value-model_tankInput_tokProj_withTypeEmbedding","trainable":true},"inbound_nodes":[[["value-model_tankInput_tokProj",0,0,{}],["value-model_tankInput_tokProj/value-model_tankInput_tokProj_typeEmbedding",0,0,{}]]]},{"name":"value-model_alliesInput_tokProj","class_name":"Dense","config":{"units":16,"activation":"linear","use_bias":false,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"value-model_alliesInput_tokProj","trainable":true},"inbound_nodes":[[["value-model_alliesInput",0,0,{}]]]},{"name":"value-model_enemiesInput_tokProj","class_name":"Dense","config":{"units":16,"activation":"linear","use_bias":false,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"value-model_enemiesInput_tokProj","trainable":true},"inbound_nodes":[[["value-model_enemiesInput",0,0,{}]]]},{"name":"value-model_clsBulletsToken","class_name":"VariableLayer","config":{"name":"value-model_clsBulletsToken","trainable":true,"shape":[1,16],"initializer":{"class_name":"TruncatedNormal","config":{"mean":0,"stddev":0.05,"seed":null}}},"inbound_nodes":[[["value-model_bulletsInput_tokProj",0,0,{}]]]},{"name":"value-model_tankInput_tokProj/value-model_tankInput_tokProj_withTypeEmbedding/value-model_tankInput_tokProj/value-model_tankInput_tokProj_withTypeEmbedding_reshape","class_name":"Reshape","config":{"target_shape":[1,16],"name":"value-model_tankInput_tokProj/value-model_tankInput_tokProj_withTypeEmbedding/value-model_tankInput_tokProj/value-model_tankInput_tokProj_withTypeEmbedding_reshape","trainable":true},"inbound_nodes":[[["value-model_tankInput_tokProj/value-model_tankInput_tokProj_withTypeEmbedding",0,0,{}]]]},{"name":"value-model_alliesInput_tokProj/value-model_alliesInput_tokProj_typeEmbedding","class_name":"VariableLayer","config":{"name":"value-model_alliesInput_tokProj/value-model_alliesInput_tokProj_typeEmbedding","trainable":true,"shape":[16],"initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}}},"inbound_nodes":[[["value-model_alliesInput_tokProj",0,0,{}]]]},{"name":"value-model_enemiesInput_tokProj/value-model_enemiesInput_tokProj_typeEmbedding","class_name":"VariableLayer","config":{"name":"value-model_enemiesInput_tokProj/value-model_enemiesInput_tokProj_typeEmbedding","trainable":true,"shape":[16],"initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}}},"inbound_nodes":[[["value-model_enemiesInput_tokProj",0,0,{}]]]},{"name":"value-model_clsBulletsToken/value-model_clsBulletsToken_qMaskLike","class_name":"MaskLike","config":{"name":"value-model_clsBulletsToken/value-model_clsBulletsToken_qMaskLike","trainable":true},"inbound_nodes":[[["value-model_clsBulletsToken",0,0,{}]]]},{"name":"value-model_bulletsMaskInput","class_name":"InputLayer","config":{"batch_input_shape":[null,8],"dtype":"float32","sparse":false,"name":"value-model_bulletsMaskInput"},"inbound_nodes":[]},{"name":"value-model_clsToken","class_name":"VariableLayer","config":{"name":"value-model_clsToken","trainable":true,"shape":[1,16],"initializer":{"class_name":"TruncatedNormal","config":{"mean":0,"stddev":0.05,"seed":null}}},"inbound_nodes":[[["value-model_tankInput_tokProj/value-model_tankInput_tokProj_withTypeEmbedding/value-model_tankInput_tokProj/value-model_tankInput_tokProj_withTypeEmbedding_reshape",0,0,{}]]]},{"name":"value-model_alliesInput_tokProj/value-model_alliesInput_tokProj_withTypeEmbedding","class_name":"Add","config":{"name":"value-model_alliesInput_tokProj/value-model_alliesInput_tokProj_withTypeEmbedding","trainable":true},"inbound_nodes":[[["value-model_alliesInput_tokProj",0,0,{}],["value-model_alliesInput_tokProj/value-model_alliesInput_tokProj_typeEmbedding",0,0,{}]]]},{"name":"value-model_enemiesInput_tokProj/value-model_enemiesInput_tokProj_withTypeEmbedding","class_name":"Add","config":{"name":"value-model_enemiesInput_tokProj/value-model_enemiesInput_tokProj_withTypeEmbedding","trainable":true},"inbound_nodes":[[["value-model_enemiesInput_tokProj",0,0,{}],["value-model_enemiesInput_tokProj/value-model_enemiesInput_tokProj_typeEmbedding",0,0,{}]]]},{"name":"value-model_clsBulletsAttention_MultiHeadAttentionLayer","class_name":"MultiHeadAttention","config":{"name":"value-model_clsBulletsAttention_MultiHeadAttentionLayer","trainable":true,"key_dim":16,"num_heads":1},"inbound_nodes":[[["value-model_clsBulletsToken",0,0,{}],["value-model_clsBulletsToken/value-model_clsBulletsToken_qMaskLike",0,0,{}],["value-model_bulletsInput_tokProj",0,0,{}],["value-model_bulletsMaskInput",0,0,{}]]]},{"name":"value-model_contextToken0","class_name":"Concatenate","config":{"axis":1,"name":"value-model_contextToken0","trainable":true},"inbound_nodes":[[["value-model_clsToken",0,0,{}],["value-model_tankInput_tokProj/value-model_tankInput_tokProj_withTypeEmbedding/value-model_tankInput_tokProj/value-model_tankInput_tokProj_withTypeEmbedding_reshape",0,0,{}],["value-model_alliesInput_tokProj/value-model_alliesInput_tokProj_withTypeEmbedding",0,0,{}],["value-model_enemiesInput_tokProj/value-model_enemiesInput_tokProj_withTypeEmbedding",0,0,{}],["value-model_clsBulletsAttention_MultiHeadAttentionLayer",0,0,{}]]]},{"name":"value-model_maskLike","class_name":"MaskLike","config":{"name":"value-model_maskLike","trainable":true},"inbound_nodes":[[["value-model_tankInput_tokProj/value-model_tankInput_tokProj_withTypeEmbedding/value-model_tankInput_tokProj/value-model_tankInput_tokProj_withTypeEmbedding_reshape",0,0,{}]],[["value-model_tankInput_tokProj/value-model_tankInput_tokProj_withTypeEmbedding/value-model_tankInput_tokProj/value-model_tankInput_tokProj_withTypeEmbedding_reshape",0,0,{}]]]},{"name":"value-model_alliesMaskInput","class_name":"InputLayer","config":{"batch_input_shape":[null,3],"dtype":"float32","sparse":false,"name":"value-model_alliesMaskInput"},"inbound_nodes":[]},{"name":"value-model_enemiesMaskInput","class_name":"InputLayer","config":{"batch_input_shape":[null,3],"dtype":"float32","sparse":false,"name":"value-model_enemiesMaskInput"},"inbound_nodes":[]},{"name":"value-model_maskSquash","class_name":"MaskSquashLayer","config":{"name":"value-model_maskSquash","trainable":true},"inbound_nodes":[[["value-model_bulletsMaskInput",0,0,{}]],[["value-model_bulletsMaskInput",0,0,{}]]]},{"name":"value-model_transformedTokens/depth0_QNorm_value-model_contextToken0/value-model_contextToken0","class_name":"RMSNormLayer","config":{"name":"value-model_transformedTokens/depth0_QNorm_value-model_contextToken0/value-model_contextToken0","trainable":true,"axis":-1,"epsilon":0.000001,"scale":true},"inbound_nodes":[[["value-model_contextToken0",0,0,{}]]]},{"name":"value-model_contextTokenMask0","class_name":"Concatenate","config":{"axis":1,"name":"value-model_contextTokenMask0","trainable":true},"inbound_nodes":[[["value-model_maskLike",0,0,{}],["value-model_maskLike",0,0,{}],["value-model_alliesMaskInput",0,0,{}],["value-model_enemiesMaskInput",0,0,{}],["value-model_maskSquash",0,0,{}]]]},{"name":"value-model_transformedTokens/depth0_KVNorm_value-model_contextToken0/value-model_contextToken0","class_name":"RMSNormLayer","config":{"name":"value-model_transformedTokens/depth0_KVNorm_value-model_contextToken0/value-model_contextToken0","trainable":true,"axis":-1,"epsilon":0.000001,"scale":true},"inbound_nodes":[[["value-model_contextToken0",0,0,{}]]]},{"name":"value-model_transformedTokens/depth0_MultiHeadAttentionLayer","class_name":"MultiHeadAttention","config":{"name":"value-model_transformedTokens/depth0_MultiHeadAttentionLayer","trainable":true,"key_dim":16,"num_heads":1},"inbound_nodes":[[["value-model_transformedTokens/depth0_QNorm_value-model_contextToken0/value-model_contextToken0",0,0,{}],["value-model_contextTokenMask0",0,0,{}],["value-model_transformedTokens/depth0_KVNorm_value-model_contextToken0/value-model_contextToken0",0,0,{}],["value-model_contextTokenMask0",0,0,{}]]]},{"name":"value-model_transformedTokens/depth0_residual","class_name":"Add","config":{"name":"value-model_transformedTokens/depth0_residual","trainable":true},"inbound_nodes":[[["value-model_contextToken0",0,0,{}],["value-model_transformedTokens/depth0_MultiHeadAttentionLayer",0,0,{}]]]},{"name":"value-model_transformedTokens/depth0_ln2","class_name":"RMSNormLayer","config":{"name":"value-model_transformedTokens/depth0_ln2","trainable":true,"axis":-1,"epsilon":0.000001,"scale":true},"inbound_nodes":[[["value-model_transformedTokens/depth0_residual",0,0,{}]]]},{"name":"value-model_transformedTokens/depth0_ffn1","class_name":"Dense","config":{"units":64,"activation":"relu","use_bias":false,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"value-model_transformedTokens/depth0_ffn1","trainable":true},"inbound_nodes":[[["value-model_transformedTokens/depth0_ln2",0,0,{}]]]},{"name":"value-model_transformedTokens/depth0_ffn2","class_name":"Dense","config":{"units":16,"activation":"linear","use_bias":false,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"value-model_transformedTokens/depth0_ffn2","trainable":true},"inbound_nodes":[[["value-model_transformedTokens/depth0_ffn1",0,0,{}]]]},{"name":"value-model_transformedTokens/depth0_ffnAdd","class_name":"Add","config":{"name":"value-model_transformedTokens/depth0_ffnAdd","trainable":true},"inbound_nodes":[[["value-model_transformedTokens/depth0_residual",0,0,{}],["value-model_transformedTokens/depth0_ffn2",0,0,{}]]]},{"name":"value-model_transformedTokens/depth1_QNorm_value-model_transformedTokens/depth0_ffnAdd/value-model_transformedTokens/depth0_ffnAdd","class_name":"RMSNormLayer","config":{"name":"value-model_transformedTokens/depth1_QNorm_value-model_transformedTokens/depth0_ffnAdd/value-model_transformedTokens/depth0_ffnAdd","trainable":true,"axis":-1,"epsilon":0.000001,"scale":true},"inbound_nodes":[[["value-model_transformedTokens/depth0_ffnAdd",0,0,{}]]]},{"name":"value-model_contextTokenMask1","class_name":"Concatenate","config":{"axis":1,"name":"value-model_contextTokenMask1","trainable":true},"inbound_nodes":[[["value-model_maskLike",1,0,{}],["value-model_maskLike",1,0,{}],["value-model_alliesMaskInput",0,0,{}],["value-model_enemiesMaskInput",0,0,{}],["value-model_maskSquash",1,0,{}]]]},{"name":"value-model_transformedTokens/depth1_KVNorm_value-model_transformedTokens/depth0_ffnAdd/value-model_transformedTokens/depth0_ffnAdd","class_name":"RMSNormLayer","config":{"name":"value-model_transformedTokens/depth1_KVNorm_value-model_transformedTokens/depth0_ffnAdd/value-model_transformedTokens/depth0_ffnAdd","trainable":true,"axis":-1,"epsilon":0.000001,"scale":true},"inbound_nodes":[[["value-model_transformedTokens/depth0_ffnAdd",0,0,{}]]]},{"name":"value-model_transformedTokens/depth1_MultiHeadAttentionLayer","class_name":"MultiHeadAttention","config":{"name":"value-model_transformedTokens/depth1_MultiHeadAttentionLayer","trainable":true,"key_dim":16,"num_heads":1},"inbound_nodes":[[["value-model_transformedTokens/depth1_QNorm_value-model_transformedTokens/depth0_ffnAdd/value-model_transformedTokens/depth0_ffnAdd",0,0,{}],["value-model_contextTokenMask1",0,0,{}],["value-model_transformedTokens/depth1_KVNorm_value-model_transformedTokens/depth0_ffnAdd/value-model_transformedTokens/depth0_ffnAdd",0,0,{}],["value-model_contextTokenMask1",0,0,{}]]]},{"name":"value-model_transformedTokens/depth1_residual","class_name":"Add","config":{"name":"value-model_transformedTokens/depth1_residual","trainable":true},"inbound_nodes":[[["value-model_transformedTokens/depth0_ffnAdd",0,0,{}],["value-model_transformedTokens/depth1_MultiHeadAttentionLayer",0,0,{}]]]},{"name":"value-model_transformedTokens/depth1_ln2","class_name":"RMSNormLayer","config":{"name":"value-model_transformedTokens/depth1_ln2","trainable":true,"axis":-1,"epsilon":0.000001,"scale":true},"inbound_nodes":[[["value-model_transformedTokens/depth1_residual",0,0,{}]]]},{"name":"value-model_transformedTokens/depth1_ffn1","class_name":"Dense","config":{"units":64,"activation":"relu","use_bias":false,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"value-model_transformedTokens/depth1_ffn1","trainable":true},"inbound_nodes":[[["value-model_transformedTokens/depth1_ln2",0,0,{}]]]},{"name":"value-model_transformedTokens/depth1_ffn2","class_name":"Dense","config":{"units":16,"activation":"linear","use_bias":false,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"value-model_transformedTokens/depth1_ffn2","trainable":true},"inbound_nodes":[[["value-model_transformedTokens/depth1_ffn1",0,0,{}]]]},{"name":"value-model_transformedTokens/depth1_ffnAdd","class_name":"Add","config":{"name":"value-model_transformedTokens/depth1_ffnAdd","trainable":true},"inbound_nodes":[[["value-model_transformedTokens/depth1_residual",0,0,{}],["value-model_transformedTokens/depth1_ffn2",0,0,{}]]]},{"name":"value-model_finalToken","class_name":"SliceLayer","config":{"name":"value-model_finalToken","trainable":true,"begin_slice":[0,0,0],"slice_size":[-1,1,-1]},"inbound_nodes":[[["value-model_transformedTokens/depth1_ffnAdd",0,0,{}]]]},{"name":"value-model_finalToken_mut_","class_name":"Flatten","config":{"name":"value-model_finalToken_mut_","trainable":true},"inbound_nodes":[[["value-model_finalToken",0,0,{}]]]},{"name":"value-model_head0/LaN_preNorm","class_name":"RMSNormLayer","config":{"name":"value-model_head0/LaN_preNorm","trainable":true,"axis":-1,"epsilon":0.000001,"scale":true},"inbound_nodes":[[["value-model_finalToken_mut_",0,0,{}]]]},{"name":"value-model_head0/LaN_branch1","class_name":"Dense","config":{"units":16,"activation":"tanh","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"value-model_head0/LaN_branch1","trainable":true},"inbound_nodes":[[["value-model_head0/LaN_preNorm",0,0,{}]]]},{"name":"value-model_head0/LaN_branch2","class_name":"Dense","config":{"units":16,"activation":"tanh","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"value-model_head0/LaN_branch2","trainable":true},"inbound_nodes":[[["value-model_head0/LaN_preNorm",0,0,{}]]]},{"name":"value-model_head0/LaN_output","class_name":"Multiply","config":{"name":"value-model_head0/LaN_output","trainable":true},"inbound_nodes":[[["value-model_head0/LaN_branch1",0,0,{}],["value-model_head0/LaN_branch2",0,0,{}]]]},{"name":"value-model_output","class_name":"Dense","config":{"units":1,"activation":"linear","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"uniform","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"value-model_output","trainable":true},"inbound_nodes":[[["value-model_head0/LaN_output",0,0,{}]]]}],"input_layers":[["value-model_tankInput",0,0],["value-model_enemiesInput",0,0],["value-model_enemiesMaskInput",0,0],["value-model_alliesInput",0,0],["value-model_alliesMaskInput",0,0],["value-model_bulletsInput",0,0],["value-model_bulletsMaskInput",0,0]],"output_layers":[["value-model_output",0,0]]},"keras_version":"tfjs-layers 4.22.0","backend":"tensor_flow.js"},"format":"layers-model","generatedBy":"TensorFlow.js tfjs-layers v4.22.0","convertedBy":null,"weightsManifest":[{"paths":["./value-model.weights.bin"],"weights":[{"name":"value-model_tankInput_tokProj/kernel","shape":[10,16],"dtype":"float32"},{"name":"value-model_tankInput_tokProj/value-model_tankInput_tokProj_typeEmbedding/variable","shape":[16],"dtype":"float32"},{"name":"value-model_bulletsInput_tokProj/kernel","shape":[4,16],"dtype":"float32"},{"name":"value-model_alliesInput_tokProj/kernel","shape":[10,16],"dtype":"float32"},{"name":"value-model_enemiesInput_tokProj/kernel","shape":[10,16],"dtype":"float32"},{"name":"value-model_clsBulletsToken/variable","shape":[1,16],"dtype":"float32"},{"name":"value-model_alliesInput_tokProj/value-model_alliesInput_tokProj_typeEmbedding/variable","shape":[16],"dtype":"float32"},{"name":"value-model_enemiesInput_tokProj/value-model_enemiesInput_tokProj_typeEmbedding/variable","shape":[16],"dtype":"float32"},{"name":"value-model_clsToken/variable","shape":[1,16],"dtype":"float32"},{"name":"value-model_clsBulletsAttention_MultiHeadAttentionLayer/wq","shape":[16,16],"dtype":"float32"},{"name":"value-model_clsBulletsAttention_MultiHeadAttentionLayer/wk","shape":[16,16],"dtype":"float32"},{"name":"value-model_clsBulletsAttention_MultiHeadAttentionLayer/wv","shape":[16,16],"dtype":"float32"},{"name":"value-model_clsBulletsAttention_MultiHeadAttentionLayer/wo","shape":[16,16],"dtype":"float32"},{"name":"value-model_transformedTokens/depth0_QNorm_value-model_contextToken0/value-model_contextToken0/scale","shape":[1,16],"dtype":"float32"},{"name":"value-model_transformedTokens/depth0_KVNorm_value-model_contextToken0/value-model_contextToken0/scale","shape":[1,16],"dtype":"float32"},{"name":"value-model_transformedTokens/depth0_MultiHeadAttentionLayer/wq","shape":[16,16],"dtype":"float32"},{"name":"value-model_transformedTokens/depth0_MultiHeadAttentionLayer/wk","shape":[16,16],"dtype":"float32"},{"name":"value-model_transformedTokens/depth0_MultiHeadAttentionLayer/wv","shape":[16,16],"dtype":"float32"},{"name":"value-model_transformedTokens/depth0_MultiHeadAttentionLayer/wo","shape":[16,16],"dtype":"float32"},{"name":"value-model_transformedTokens/depth0_ln2/scale","shape":[1,16],"dtype":"float32"},{"name":"value-model_transformedTokens/depth0_ffn1/kernel","shape":[16,64],"dtype":"float32"},{"name":"value-model_transformedTokens/depth0_ffn2/kernel","shape":[64,16],"dtype":"float32"},{"name":"value-model_transformedTokens/depth1_QNorm_value-model_transformedTokens/depth0_ffnAdd/value-model_transformedTokens/depth0_ffnAdd/scale","shape":[1,16],"dtype":"float32"},{"name":"value-model_transformedTokens/depth1_KVNorm_value-model_transformedTokens/depth0_ffnAdd/value-model_transformedTokens/depth0_ffnAdd/scale","shape":[1,16],"dtype":"float32"},{"name":"value-model_transformedTokens/depth1_MultiHeadAttentionLayer/wq","shape":[16,16],"dtype":"float32"},{"name":"value-model_transformedTokens/depth1_MultiHeadAttentionLayer/wk","shape":[16,16],"dtype":"float32"},{"name":"value-model_transformedTokens/depth1_MultiHeadAttentionLayer/wv","shape":[16,16],"dtype":"float32"},{"name":"value-model_transformedTokens/depth1_MultiHeadAttentionLayer/wo","shape":[16,16],"dtype":"float32"},{"name":"value-model_transformedTokens/depth1_ln2/scale","shape":[1,16],"dtype":"float32"},{"name":"value-model_transformedTokens/depth1_ffn1/kernel","shape":[16,64],"dtype":"float32"},{"name":"value-model_transformedTokens/depth1_ffn2/kernel","shape":[64,16],"dtype":"float32"},{"name":"value-model_head0/LaN_preNorm/scale","shape":[16],"dtype":"float32"},{"name":"value-model_head0/LaN_branch1/kernel","shape":[16,16],"dtype":"float32"},{"name":"value-model_head0/LaN_branch1/bias","shape":[16],"dtype":"float32"},{"name":"value-model_head0/LaN_branch2/kernel","shape":[16,16],"dtype":"float32"},{"name":"value-model_head0/LaN_branch2/bias","shape":[16],"dtype":"float32"},{"name":"value-model_output/kernel","shape":[16,1],"dtype":"float32"},{"name":"value-model_output/bias","shape":[1],"dtype":"float32"},{"name":"iter","shape":[],"dtype":"int32","group":"optimizer"},{"name":"value-model_alliesInput_tokProj/kernel/m","shape":[10,16],"dtype":"float32","group":"optimizer"},{"name":"value-model_alliesInput_tokProj/value-model_alliesInput_tokProj_typeEmbedding/variable/m","shape":[16],"dtype":"float32","group":"optimizer"},{"name":"value-model_bulletsInput_tokProj/kernel/m","shape":[4,16],"dtype":"float32","group":"optimizer"},{"name":"value-model_clsBulletsAttention_MultiHeadAttentionLayer/wk/m","shape":[16,16],"dtype":"float32","group":"optimizer"},{"name":"value-model_clsBulletsAttention_MultiHeadAttentionLayer/wo/m","shape":[16,16],"dtype":"float32","group":"optimizer"},{"name":"value-model_clsBulletsAttention_MultiHeadAttentionLayer/wq/m","shape":[16,16],"dtype":"float32","group":"optimizer"},{"name":"value-model_clsBulletsAttention_MultiHeadAttentionLayer/wv/m","shape":[16,16],"dtype":"float32","group":"optimizer"},{"name":"value-model_clsBulletsToken/variable/m","shape":[1,16],"dtype":"float32","group":"optimizer"},{"name":"value-model_clsToken/variable/m","shape":[1,16],"dtype":"float32","group":"optimizer"},{"name":"value-model_enemiesInput_tokProj/kernel/m","shape":[10,16],"dtype":"float32","group":"optimizer"},{"name":"value-model_enemiesInput_tokProj/value-model_enemiesInput_tokProj_typeEmbedding/variable/m","shape":[16],"dtype":"float32","group":"optimizer"},{"name":"value-model_head0/LaN_branch1/bias/m","shape":[16],"dtype":"float32","group":"optimizer"},{"name":"value-model_head0/LaN_branch1/kernel/m","shape":[16,16],"dtype":"float32","group":"optimizer"},{"name":"value-model_head0/LaN_branch2/bias/m","shape":[16],"dtype":"float32","group":"optimizer"},{"name":"value-model_head0/LaN_branch2/kernel/m","shape":[16,16],"dtype":"float32","group":"optimizer"},{"name":"value-model_head0/LaN_preNorm/scale/m","shape":[16],"dtype":"float32","group":"optimizer"},{"name":"value-model_output/bias/m","shape":[1],"dtype":"float32","group":"optimizer"},{"name":"value-model_output/kernel/m","shape":[16,1],"dtype":"float32","group":"optimizer"},{"name":"value-model_tankInput_tokProj/kernel/m","shape":[10,16],"dtype":"float32","group":"optimizer"},{"name":"value-model_tankInput_tokProj/value-model_tankInput_tokProj_typeEmbedding/variable/m","shape":[16],"dtype":"float32","group":"optimizer"},{"name":"value-model_transformedTokens/depth0_ffn1/kernel/m","shape":[16,64],"dtype":"float32","group":"optimizer"},{"name":"value-model_transformedTokens/depth0_ffn2/kernel/m","shape":[64,16],"dtype":"float32","group":"optimizer"},{"name":"value-model_transformedTokens/depth0_KVNorm_value-model_contextToken0/value-model_contextToken0/scale/m","shape":[1,16],"dtype":"float32","group":"optimizer"},{"name":"value-model_transformedTokens/depth0_ln2/scale/m","shape":[1,16],"dtype":"float32","group":"optimizer"},{"name":"value-model_transformedTokens/depth0_MultiHeadAttentionLayer/wk/m","shape":[16,16],"dtype":"float32","group":"optimizer"},{"name":"value-model_transformedTokens/depth0_MultiHeadAttentionLayer/wo/m","shape":[16,16],"dtype":"float32","group":"optimizer"},{"name":"value-model_transformedTokens/depth0_MultiHeadAttentionLayer/wq/m","shape":[16,16],"dtype":"float32","group":"optimizer"},{"name":"value-model_transformedTokens/depth0_MultiHeadAttentionLayer/wv/m","shape":[16,16],"dtype":"float32","group":"optimizer"},{"name":"value-model_transformedTokens/depth0_QNorm_value-model_contextToken0/value-model_contextToken0/scale/m","shape":[1,16],"dtype":"float32","group":"optimizer"},{"name":"value-model_transformedTokens/depth1_ffn1/kernel/m","shape":[16,64],"dtype":"float32","group":"optimizer"},{"name":"value-model_transformedTokens/depth1_ffn2/kernel/m","shape":[64,16],"dtype":"float32","group":"optimizer"},{"name":"value-model_transformedTokens/depth1_KVNorm_value-model_transformedTokens/depth0_ffnAdd/value-model_transformedTokens/depth0_ffnAdd/scale/m","shape":[1,16],"dtype":"float32","group":"optimizer"},{"name":"value-model_transformedTokens/depth1_ln2/scale/m","shape":[1,16],"dtype":"float32","group":"optimizer"},{"name":"value-model_transformedTokens/depth1_MultiHeadAttentionLayer/wk/m","shape":[16,16],"dtype":"float32","group":"optimizer"},{"name":"value-model_transformedTokens/depth1_MultiHeadAttentionLayer/wo/m","shape":[16,16],"dtype":"float32","group":"optimizer"},{"name":"value-model_transformedTokens/depth1_MultiHeadAttentionLayer/wq/m","shape":[16,16],"dtype":"float32","group":"optimizer"},{"name":"value-model_transformedTokens/depth1_MultiHeadAttentionLayer/wv/m","shape":[16,16],"dtype":"float32","group":"optimizer"},{"name":"value-model_transformedTokens/depth1_QNorm_value-model_transformedTokens/depth0_ffnAdd/value-model_transformedTokens/depth0_ffnAdd/scale/m","shape":[1,16],"dtype":"float32","group":"optimizer"},{"name":"value-model_alliesInput_tokProj/kernel/v","shape":[10,16],"dtype":"float32","group":"optimizer"},{"name":"value-model_alliesInput_tokProj/value-model_alliesInput_tokProj_typeEmbedding/variable/v","shape":[16],"dtype":"float32","group":"optimizer"},{"name":"value-model_bulletsInput_tokProj/kernel/v","shape":[4,16],"dtype":"float32","group":"optimizer"},{"name":"value-model_clsBulletsAttention_MultiHeadAttentionLayer/wk/v","shape":[16,16],"dtype":"float32","group":"optimizer"},{"name":"value-model_clsBulletsAttention_MultiHeadAttentionLayer/wo/v","shape":[16,16],"dtype":"float32","group":"optimizer"},{"name":"value-model_clsBulletsAttention_MultiHeadAttentionLayer/wq/v","shape":[16,16],"dtype":"float32","group":"optimizer"},{"name":"value-model_clsBulletsAttention_MultiHeadAttentionLayer/wv/v","shape":[16,16],"dtype":"float32","group":"optimizer"},{"name":"value-model_clsBulletsToken/variable/v","shape":[1,16],"dtype":"float32","group":"optimizer"},{"name":"value-model_clsToken/variable/v","shape":[1,16],"dtype":"float32","group":"optimizer"},{"name":"value-model_enemiesInput_tokProj/kernel/v","shape":[10,16],"dtype":"float32","group":"optimizer"},{"name":"value-model_enemiesInput_tokProj/value-model_enemiesInput_tokProj_typeEmbedding/variable/v","shape":[16],"dtype":"float32","group":"optimizer"},{"name":"value-model_head0/LaN_branch1/bias/v","shape":[16],"dtype":"float32","group":"optimizer"},{"name":"value-model_head0/LaN_branch1/kernel/v","shape":[16,16],"dtype":"float32","group":"optimizer"},{"name":"value-model_head0/LaN_branch2/bias/v","shape":[16],"dtype":"float32","group":"optimizer"},{"name":"value-model_head0/LaN_branch2/kernel/v","shape":[16,16],"dtype":"float32","group":"optimizer"},{"name":"value-model_head0/LaN_preNorm/scale/v","shape":[16],"dtype":"float32","group":"optimizer"},{"name":"value-model_output/bias/v","shape":[1],"dtype":"float32","group":"optimizer"},{"name":"value-model_output/kernel/v","shape":[16,1],"dtype":"float32","group":"optimizer"},{"name":"value-model_tankInput_tokProj/kernel/v","shape":[10,16],"dtype":"float32","group":"optimizer"},{"name":"value-model_tankInput_tokProj/value-model_tankInput_tokProj_typeEmbedding/variable/v","shape":[16],"dtype":"float32","group":"optimizer"},{"name":"value-model_transformedTokens/depth0_ffn1/kernel/v","shape":[16,64],"dtype":"float32","group":"optimizer"},{"name":"value-model_transformedTokens/depth0_ffn2/kernel/v","shape":[64,16],"dtype":"float32","group":"optimizer"},{"name":"value-model_transformedTokens/depth0_KVNorm_value-model_contextToken0/value-model_contextToken0/scale/v","shape":[1,16],"dtype":"float32","group":"optimizer"},{"name":"value-model_transformedTokens/depth0_ln2/scale/v","shape":[1,16],"dtype":"float32","group":"optimizer"},{"name":"value-model_transformedTokens/depth0_MultiHeadAttentionLayer/wk/v","shape":[16,16],"dtype":"float32","group":"optimizer"},{"name":"value-model_transformedTokens/depth0_MultiHeadAttentionLayer/wo/v","shape":[16,16],"dtype":"float32","group":"optimizer"},{"name":"value-model_transformedTokens/depth0_MultiHeadAttentionLayer/wq/v","shape":[16,16],"dtype":"float32","group":"optimizer"},{"name":"value-model_transformedTokens/depth0_MultiHeadAttentionLayer/wv/v","shape":[16,16],"dtype":"float32","group":"optimizer"},{"name":"value-model_transformedTokens/depth0_QNorm_value-model_contextToken0/value-model_contextToken0/scale/v","shape":[1,16],"dtype":"float32","group":"optimizer"},{"name":"value-model_transformedTokens/depth1_ffn1/kernel/v","shape":[16,64],"dtype":"float32","group":"optimizer"},{"name":"value-model_transformedTokens/depth1_ffn2/kernel/v","shape":[64,16],"dtype":"float32","group":"optimizer"},{"name":"value-model_transformedTokens/depth1_KVNorm_value-model_transformedTokens/depth0_ffnAdd/value-model_transformedTokens/depth0_ffnAdd/scale/v","shape":[1,16],"dtype":"float32","group":"optimizer"},{"name":"value-model_transformedTokens/depth1_ln2/scale/v","shape":[1,16],"dtype":"float32","group":"optimizer"},{"name":"value-model_transformedTokens/depth1_MultiHeadAttentionLayer/wk/v","shape":[16,16],"dtype":"float32","group":"optimizer"},{"name":"value-model_transformedTokens/depth1_MultiHeadAttentionLayer/wo/v","shape":[16,16],"dtype":"float32","group":"optimizer"},{"name":"value-model_transformedTokens/depth1_MultiHeadAttentionLayer/wq/v","shape":[16,16],"dtype":"float32","group":"optimizer"},{"name":"value-model_transformedTokens/depth1_MultiHeadAttentionLayer/wv/v","shape":[16,16],"dtype":"float32","group":"optimizer"},{"name":"value-model_transformedTokens/depth1_QNorm_value-model_transformedTokens/depth0_ffnAdd/value-model_transformedTokens/depth0_ffnAdd/scale/v","shape":[1,16],"dtype":"float32","group":"optimizer"}]}],"userDefinedMetadata":{"lr":0.001,"expIteration":1675823,"emaStdReturns":1.522155741692186,"rewardRatio":0.06801746098350925},"trainingConfig":{"loss":"mean_squared_error","metrics":{},"optimizer_config":{"class_name":"AdamW","config":{"learningRate":0.001,"beta1":0.9,"beta2":0.999,"epsilon":1e-7,"weightDecay":0.0001}}}}