{"modelTopology":{"class_name":"Model","config":{"name":"value-model","layers":[{"name":"value-model_tankInput","class_name":"InputLayer","config":{"batch_input_shape":[null,7],"dtype":"float32","sparse":false,"name":"value-model_tankInput"},"inbound_nodes":[]},{"name":"value-model_tankInput_tokProj","class_name":"Dense","config":{"units":16,"activation":"linear","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"value-model_tankInput_tokProj","trainable":true},"inbound_nodes":[[["value-model_tankInput",0,0,{}]]]},{"name":"value-model_tankInput_tokProj/value-model_tankInput_tokProj_reshape","class_name":"Reshape","config":{"target_shape":[1,16],"name":"value-model_tankInput_tokProj/value-model_tankInput_tokProj_reshape","trainable":true},"inbound_nodes":[[["value-model_tankInput_tokProj",0,0,{}]]]},{"name":"value-model_enemiesInput","class_name":"InputLayer","config":{"batch_input_shape":[null,3,8],"dtype":"float32","sparse":false,"name":"value-model_enemiesInput"},"inbound_nodes":[]},{"name":"value-model_alliesInput","class_name":"InputLayer","config":{"batch_input_shape":[null,3,8],"dtype":"float32","sparse":false,"name":"value-model_alliesInput"},"inbound_nodes":[]},{"name":"value-model_bulletsInput","class_name":"InputLayer","config":{"batch_input_shape":[null,8,4],"dtype":"float32","sparse":false,"name":"value-model_bulletsInput"},"inbound_nodes":[]},{"name":"value-model_tankToEnemiesAttn_QNorm_value-model_tankInput_tokProj/value-model_tankInput_tokProj_reshape/value-model_tankInput_tokProj/value-model_tankInput_tokProj_reshape","class_name":"LayerNormalization","config":{"axis":[2],"epsilon":0.00001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"name":"value-model_tankToEnemiesAttn_QNorm_value-model_tankInput_tokProj/value-model_tankInput_tokProj_reshape/value-model_tankInput_tokProj/value-model_tankInput_tokProj_reshape","trainable":true},"inbound_nodes":[[["value-model_tankInput_tokProj/value-model_tankInput_tokProj_reshape",0,0,{}]]]},{"name":"value-model_enemiesInput_tokProj","class_name":"Dense","config":{"units":16,"activation":"linear","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"value-model_enemiesInput_tokProj","trainable":true},"inbound_nodes":[[["value-model_enemiesInput",0,0,{}]]]},{"name":"value-model_enemiesMaskInput","class_name":"InputLayer","config":{"batch_input_shape":[null,3],"dtype":"float32","sparse":false,"name":"value-model_enemiesMaskInput"},"inbound_nodes":[]},{"name":"value-model_tankToAlliesAttn_QNorm_value-model_tankInput_tokProj/value-model_tankInput_tokProj_reshape/value-model_tankInput_tokProj/value-model_tankInput_tokProj_reshape","class_name":"LayerNormalization","config":{"axis":[2],"epsilon":0.00001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"name":"value-model_tankToAlliesAttn_QNorm_value-model_tankInput_tokProj/value-model_tankInput_tokProj_reshape/value-model_tankInput_tokProj/value-model_tankInput_tokProj_reshape","trainable":true},"inbound_nodes":[[["value-model_tankInput_tokProj/value-model_tankInput_tokProj_reshape",0,0,{}]]]},{"name":"value-model_alliesInput_tokProj","class_name":"Dense","config":{"units":16,"activation":"linear","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"value-model_alliesInput_tokProj","trainable":true},"inbound_nodes":[[["value-model_alliesInput",0,0,{}]]]},{"name":"value-model_alliesMaskInput","class_name":"InputLayer","config":{"batch_input_shape":[null,3],"dtype":"float32","sparse":false,"name":"value-model_alliesMaskInput"},"inbound_nodes":[]},{"name":"value-model_tankToBulletsAttn_QNorm_value-model_tankInput_tokProj/value-model_tankInput_tokProj_reshape/value-model_tankInput_tokProj/value-model_tankInput_tokProj_reshape","class_name":"LayerNormalization","config":{"axis":[2],"epsilon":0.00001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"name":"value-model_tankToBulletsAttn_QNorm_value-model_tankInput_tokProj/value-model_tankInput_tokProj_reshape/value-model_tankInput_tokProj/value-model_tankInput_tokProj_reshape","trainable":true},"inbound_nodes":[[["value-model_tankInput_tokProj/value-model_tankInput_tokProj_reshape",0,0,{}]]]},{"name":"value-model_bulletsInput_tokProj","class_name":"Dense","config":{"units":16,"activation":"linear","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"value-model_bulletsInput_tokProj","trainable":true},"inbound_nodes":[[["value-model_bulletsInput",0,0,{}]]]},{"name":"value-model_bulletsMaskInput","class_name":"InputLayer","config":{"batch_input_shape":[null,8],"dtype":"float32","sparse":false,"name":"value-model_bulletsMaskInput"},"inbound_nodes":[]},{"name":"value-model_tankToEnemiesAttn_MultiHeadAttentionLayer","class_name":"MultiHeadAttention","config":{"name":"value-model_tankToEnemiesAttn_MultiHeadAttentionLayer","trainable":true,"key_dim":16,"num_heads":1},"inbound_nodes":[[["value-model_tankToEnemiesAttn_QNorm_value-model_tankInput_tokProj/value-model_tankInput_tokProj_reshape/value-model_tankInput_tokProj/value-model_tankInput_tokProj_reshape",0,0,{}],["value-model_enemiesInput_tokProj",0,0,{}],["value-model_enemiesMaskInput",0,0,{}]]]},{"name":"value-model_tankToAlliesAttn_MultiHeadAttentionLayer","class_name":"MultiHeadAttention","config":{"name":"value-model_tankToAlliesAttn_MultiHeadAttentionLayer","trainable":true,"key_dim":16,"num_heads":1},"inbound_nodes":[[["value-model_tankToAlliesAttn_QNorm_value-model_tankInput_tokProj/value-model_tankInput_tokProj_reshape/value-model_tankInput_tokProj/value-model_tankInput_tokProj_reshape",0,0,{}],["value-model_alliesInput_tokProj",0,0,{}],["value-model_alliesMaskInput",0,0,{}]]]},{"name":"value-model_tankToBulletsAttn_MultiHeadAttentionLayer","class_name":"MultiHeadAttention","config":{"name":"value-model_tankToBulletsAttn_MultiHeadAttentionLayer","trainable":true,"key_dim":16,"num_heads":1},"inbound_nodes":[[["value-model_tankToBulletsAttn_QNorm_value-model_tankInput_tokProj/value-model_tankInput_tokProj_reshape/value-model_tankInput_tokProj/value-model_tankInput_tokProj_reshape",0,0,{}],["value-model_bulletsInput_tokProj",0,0,{}],["value-model_bulletsMaskInput",0,0,{}]]]},{"name":"value-model_tankToEnemiesAttn_output","class_name":"Dense","config":{"units":16,"activation":"linear","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"value-model_tankToEnemiesAttn_output","trainable":true},"inbound_nodes":[[["value-model_tankToEnemiesAttn_MultiHeadAttentionLayer",0,0,{}]]]},{"name":"value-model_tankToAlliesAttn_output","class_name":"Dense","config":{"units":16,"activation":"linear","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"value-model_tankToAlliesAttn_output","trainable":true},"inbound_nodes":[[["value-model_tankToAlliesAttn_MultiHeadAttentionLayer",0,0,{}]]]},{"name":"value-model_tankToBulletsAttn_output","class_name":"Dense","config":{"units":16,"activation":"linear","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"value-model_tankToBulletsAttn_output","trainable":true},"inbound_nodes":[[["value-model_tankToBulletsAttn_MultiHeadAttentionLayer",0,0,{}]]]},{"name":"value-model_controllerInput","class_name":"InputLayer","config":{"batch_input_shape":[null,4],"dtype":"float32","sparse":false,"name":"value-model_controllerInput"},"inbound_nodes":[]},{"name":"value-model_battlefieldInput","class_name":"InputLayer","config":{"batch_input_shape":[null,6],"dtype":"float32","sparse":false,"name":"value-model_battlefieldInput"},"inbound_nodes":[]},{"name":"value-model_tankToEnemiesAttn_ln2","class_name":"LayerNormalization","config":{"axis":[2],"epsilon":0.00001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"name":"value-model_tankToEnemiesAttn_ln2","trainable":true},"inbound_nodes":[[["value-model_tankToEnemiesAttn_output",0,0,{}]]]},{"name":"value-model_tankToAlliesAttn_ln2","class_name":"LayerNormalization","config":{"axis":[2],"epsilon":0.00001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"name":"value-model_tankToAlliesAttn_ln2","trainable":true},"inbound_nodes":[[["value-model_tankToAlliesAttn_output",0,0,{}]]]},{"name":"value-model_tankToBulletsAttn_ln2","class_name":"LayerNormalization","config":{"axis":[2],"epsilon":0.00001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"name":"value-model_tankToBulletsAttn_ln2","trainable":true},"inbound_nodes":[[["value-model_tankToBulletsAttn_output",0,0,{}]]]},{"name":"value-model_controllerInput_tokProj","class_name":"Dense","config":{"units":16,"activation":"linear","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"value-model_controllerInput_tokProj","trainable":true},"inbound_nodes":[[["value-model_controllerInput",0,0,{}]]]},{"name":"value-model_battlefieldInput_tokProj","class_name":"Dense","config":{"units":16,"activation":"linear","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"value-model_battlefieldInput_tokProj","trainable":true},"inbound_nodes":[[["value-model_battlefieldInput",0,0,{}]]]},{"name":"value-model_tankToEnemiesAttn_ffn1","class_name":"Dense","config":{"units":64,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"value-model_tankToEnemiesAttn_ffn1","trainable":true},"inbound_nodes":[[["value-model_tankToEnemiesAttn_ln2",0,0,{}]]]},{"name":"value-model_tankToAlliesAttn_ffn1","class_name":"Dense","config":{"units":64,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"value-model_tankToAlliesAttn_ffn1","trainable":true},"inbound_nodes":[[["value-model_tankToAlliesAttn_ln2",0,0,{}]]]},{"name":"value-model_tankToBulletsAttn_ffn1","class_name":"Dense","config":{"units":64,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"value-model_tankToBulletsAttn_ffn1","trainable":true},"inbound_nodes":[[["value-model_tankToBulletsAttn_ln2",0,0,{}]]]},{"name":"value-model_controllerInput_tokProj/value-model_controllerInput_tokProj_reshape","class_name":"Reshape","config":{"target_shape":[1,16],"name":"value-model_controllerInput_tokProj/value-model_controllerInput_tokProj_reshape","trainable":true},"inbound_nodes":[[["value-model_controllerInput_tokProj",0,0,{}]]]},{"name":"value-model_battlefieldInput_tokProj/value-model_battlefieldInput_tokProj_reshape","class_name":"Reshape","config":{"target_shape":[1,16],"name":"value-model_battlefieldInput_tokProj/value-model_battlefieldInput_tokProj_reshape","trainable":true},"inbound_nodes":[[["value-model_battlefieldInput_tokProj",0,0,{}]]]},{"name":"value-model_tankToEnemiesAttn_ffn2","class_name":"Dense","config":{"units":16,"activation":"linear","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"value-model_tankToEnemiesAttn_ffn2","trainable":true},"inbound_nodes":[[["value-model_tankToEnemiesAttn_ffn1",0,0,{}]]]},{"name":"value-model_tankToAlliesAttn_ffn2","class_name":"Dense","config":{"units":16,"activation":"linear","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"value-model_tankToAlliesAttn_ffn2","trainable":true},"inbound_nodes":[[["value-model_tankToAlliesAttn_ffn1",0,0,{}]]]},{"name":"value-model_tankToBulletsAttn_ffn2","class_name":"Dense","config":{"units":16,"activation":"linear","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"value-model_tankToBulletsAttn_ffn2","trainable":true},"inbound_nodes":[[["value-model_tankToBulletsAttn_ffn1",0,0,{}]]]},{"name":"value-model_envToken","class_name":"Concatenate","config":{"axis":1,"name":"value-model_envToken","trainable":true},"inbound_nodes":[[["value-model_controllerInput_tokProj/value-model_controllerInput_tokProj_reshape",0,0,{}],["value-model_battlefieldInput_tokProj/value-model_battlefieldInput_tokProj_reshape",0,0,{}],["value-model_tankInput_tokProj/value-model_tankInput_tokProj_reshape",0,0,{}],["value-model_tankToEnemiesAttn_ffn2",0,0,{}],["value-model_tankToAlliesAttn_ffn2",0,0,{}],["value-model_tankToBulletsAttn_ffn2",0,0,{}]]]},{"name":"value-model_transformedEnvToken/transformer0_QNorm_value-model_envToken/value-model_envToken","class_name":"LayerNormalization","config":{"axis":[2],"epsilon":0.00001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"name":"value-model_transformedEnvToken/transformer0_QNorm_value-model_envToken/value-model_envToken","trainable":true},"inbound_nodes":[[["value-model_envToken",0,0,{}]]]},{"name":"value-model_transformedEnvToken/transformer0_MultiHeadAttentionLayer","class_name":"MultiHeadAttention","config":{"name":"value-model_transformedEnvToken/transformer0_MultiHeadAttentionLayer","trainable":true,"key_dim":16,"num_heads":1},"inbound_nodes":[[["value-model_transformedEnvToken/transformer0_QNorm_value-model_envToken/value-model_envToken",0,0,{}],["value-model_transformedEnvToken/transformer0_QNorm_value-model_envToken/value-model_envToken",0,0,{}]]]},{"name":"value-model_transformedEnvToken/transformer0_output","class_name":"Dense","config":{"units":16,"activation":"linear","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"value-model_transformedEnvToken/transformer0_output","trainable":true},"inbound_nodes":[[["value-model_transformedEnvToken/transformer0_MultiHeadAttentionLayer",0,0,{}]]]},{"name":"value-model_transformedEnvToken/transformer0_residual","class_name":"Add","config":{"name":"value-model_transformedEnvToken/transformer0_residual","trainable":true},"inbound_nodes":[[["value-model_envToken",0,0,{}],["value-model_transformedEnvToken/transformer0_output",0,0,{}]]]},{"name":"value-model_transformedEnvToken/transformer0_ln2","class_name":"LayerNormalization","config":{"axis":[2],"epsilon":0.00001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"name":"value-model_transformedEnvToken/transformer0_ln2","trainable":true},"inbound_nodes":[[["value-model_transformedEnvToken/transformer0_residual",0,0,{}]]]},{"name":"value-model_transformedEnvToken/transformer0_ffn1","class_name":"Dense","config":{"units":64,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"value-model_transformedEnvToken/transformer0_ffn1","trainable":true},"inbound_nodes":[[["value-model_transformedEnvToken/transformer0_ln2",0,0,{}]]]},{"name":"value-model_transformedEnvToken/transformer0_ffn2","class_name":"Dense","config":{"units":16,"activation":"linear","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"value-model_transformedEnvToken/transformer0_ffn2","trainable":true},"inbound_nodes":[[["value-model_transformedEnvToken/transformer0_ffn1",0,0,{}]]]},{"name":"value-model_transformedEnvToken/transformer0_ffnAdd","class_name":"Add","config":{"name":"value-model_transformedEnvToken/transformer0_ffnAdd","trainable":true},"inbound_nodes":[[["value-model_transformedEnvToken/transformer0_residual",0,0,{}],["value-model_transformedEnvToken/transformer0_ffn2",0,0,{}]]]},{"name":"value-model_transformedEnvToken/transformer1_QNorm_value-model_transformedEnvToken/transformer0_ffnAdd/value-model_transformedEnvToken/transformer0_ffnAdd","class_name":"LayerNormalization","config":{"axis":[2],"epsilon":0.00001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"name":"value-model_transformedEnvToken/transformer1_QNorm_value-model_transformedEnvToken/transformer0_ffnAdd/value-model_transformedEnvToken/transformer0_ffnAdd","trainable":true},"inbound_nodes":[[["value-model_transformedEnvToken/transformer0_ffnAdd",0,0,{}]]]},{"name":"value-model_transformedEnvToken/transformer1_MultiHeadAttentionLayer","class_name":"MultiHeadAttention","config":{"name":"value-model_transformedEnvToken/transformer1_MultiHeadAttentionLayer","trainable":true,"key_dim":16,"num_heads":1},"inbound_nodes":[[["value-model_transformedEnvToken/transformer1_QNorm_value-model_transformedEnvToken/transformer0_ffnAdd/value-model_transformedEnvToken/transformer0_ffnAdd",0,0,{}],["value-model_transformedEnvToken/transformer1_QNorm_value-model_transformedEnvToken/transformer0_ffnAdd/value-model_transformedEnvToken/transformer0_ffnAdd",0,0,{}]]]},{"name":"value-model_transformedEnvToken/transformer1_output","class_name":"Dense","config":{"units":16,"activation":"linear","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"value-model_transformedEnvToken/transformer1_output","trainable":true},"inbound_nodes":[[["value-model_transformedEnvToken/transformer1_MultiHeadAttentionLayer",0,0,{}]]]},{"name":"value-model_transformedEnvToken/transformer1_residual","class_name":"Add","config":{"name":"value-model_transformedEnvToken/transformer1_residual","trainable":true},"inbound_nodes":[[["value-model_transformedEnvToken/transformer0_ffnAdd",0,0,{}],["value-model_transformedEnvToken/transformer1_output",0,0,{}]]]},{"name":"value-model_transformedEnvToken/transformer1_ln2","class_name":"LayerNormalization","config":{"axis":[2],"epsilon":0.00001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"name":"value-model_transformedEnvToken/transformer1_ln2","trainable":true},"inbound_nodes":[[["value-model_transformedEnvToken/transformer1_residual",0,0,{}]]]},{"name":"value-model_transformedEnvToken/transformer1_ffn1","class_name":"Dense","config":{"units":64,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"value-model_transformedEnvToken/transformer1_ffn1","trainable":true},"inbound_nodes":[[["value-model_transformedEnvToken/transformer1_ln2",0,0,{}]]]},{"name":"value-model_transformedEnvToken/transformer1_ffn2","class_name":"Dense","config":{"units":16,"activation":"linear","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"value-model_transformedEnvToken/transformer1_ffn2","trainable":true},"inbound_nodes":[[["value-model_transformedEnvToken/transformer1_ffn1",0,0,{}]]]},{"name":"value-model_transformedEnvToken/transformer1_ffnAdd","class_name":"Add","config":{"name":"value-model_transformedEnvToken/transformer1_ffnAdd","trainable":true},"inbound_nodes":[[["value-model_transformedEnvToken/transformer1_residual",0,0,{}],["value-model_transformedEnvToken/transformer1_ffn2",0,0,{}]]]},{"name":"value-model_flattenFinalToken","class_name":"Flatten","config":{"name":"value-model_flattenFinalToken","trainable":true},"inbound_nodes":[[["value-model_transformedEnvToken/transformer1_ffnAdd",0,0,{}]]]},{"name":"value-model_normFinalToken","class_name":"LayerNormalization","config":{"axis":[1],"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"name":"value-model_normFinalToken","trainable":true},"inbound_nodes":[[["value-model_flattenFinalToken",0,0,{}]]]},{"name":"value-model_finalMLP/dense0","class_name":"Dense","config":{"units":128,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"uniform","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"value-model_finalMLP/dense0","trainable":true},"inbound_nodes":[[["value-model_normFinalToken",0,0,{}]]]},{"name":"value-model_finalMLP/dense1","class_name":"Dense","config":{"units":64,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"uniform","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"value-model_finalMLP/dense1","trainable":true},"inbound_nodes":[[["value-model_finalMLP/dense0",0,0,{}]]]},{"name":"value-model_finalMLP/dense2","class_name":"Dense","config":{"units":32,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"uniform","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"value-model_finalMLP/dense2","trainable":true},"inbound_nodes":[[["value-model_finalMLP/dense1",0,0,{}]]]},{"name":"value-model_output","class_name":"Dense","config":{"units":1,"activation":"linear","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"value-model_output","trainable":true},"inbound_nodes":[[["value-model_finalMLP/dense2",0,0,{}]]]}],"input_layers":[["value-model_controllerInput",0,0],["value-model_battlefieldInput",0,0],["value-model_tankInput",0,0],["value-model_enemiesInput",0,0],["value-model_enemiesMaskInput",0,0],["value-model_alliesInput",0,0],["value-model_alliesMaskInput",0,0],["value-model_bulletsInput",0,0],["value-model_bulletsMaskInput",0,0]],"output_layers":[["value-model_output",0,0]]},"keras_version":"tfjs-layers 4.22.0","backend":"tensor_flow.js"},"weightsManifest":[{"paths":["weights.bin"],"weights":[{"name":"value-model_tankInput_tokProj/kernel","shape":[7,16],"dtype":"float32"},{"name":"value-model_tankInput_tokProj/bias","shape":[16],"dtype":"float32"},{"name":"value-model_tankToEnemiesAttn_QNorm_value-model_tankInput_tokProj/value-model_tankInput_tokProj_reshape/value-model_tankInput_tokProj/value-model_tankInput_tokProj_reshape/gamma","shape":[16],"dtype":"float32"},{"name":"value-model_tankToEnemiesAttn_QNorm_value-model_tankInput_tokProj/value-model_tankInput_tokProj_reshape/value-model_tankInput_tokProj/value-model_tankInput_tokProj_reshape/beta","shape":[16],"dtype":"float32"},{"name":"value-model_enemiesInput_tokProj/kernel","shape":[8,16],"dtype":"float32"},{"name":"value-model_enemiesInput_tokProj/bias","shape":[16],"dtype":"float32"},{"name":"value-model_tankToAlliesAttn_QNorm_value-model_tankInput_tokProj/value-model_tankInput_tokProj_reshape/value-model_tankInput_tokProj/value-model_tankInput_tokProj_reshape/gamma","shape":[16],"dtype":"float32"},{"name":"value-model_tankToAlliesAttn_QNorm_value-model_tankInput_tokProj/value-model_tankInput_tokProj_reshape/value-model_tankInput_tokProj/value-model_tankInput_tokProj_reshape/beta","shape":[16],"dtype":"float32"},{"name":"value-model_alliesInput_tokProj/kernel","shape":[8,16],"dtype":"float32"},{"name":"value-model_alliesInput_tokProj/bias","shape":[16],"dtype":"float32"},{"name":"value-model_tankToBulletsAttn_QNorm_value-model_tankInput_tokProj/value-model_tankInput_tokProj_reshape/value-model_tankInput_tokProj/value-model_tankInput_tokProj_reshape/gamma","shape":[16],"dtype":"float32"},{"name":"value-model_tankToBulletsAttn_QNorm_value-model_tankInput_tokProj/value-model_tankInput_tokProj_reshape/value-model_tankInput_tokProj/value-model_tankInput_tokProj_reshape/beta","shape":[16],"dtype":"float32"},{"name":"value-model_bulletsInput_tokProj/kernel","shape":[4,16],"dtype":"float32"},{"name":"value-model_bulletsInput_tokProj/bias","shape":[16],"dtype":"float32"},{"name":"value-model_tankToEnemiesAttn_MultiHeadAttentionLayer/wq","shape":[16,16],"dtype":"float32"},{"name":"value-model_tankToEnemiesAttn_MultiHeadAttentionLayer/wk","shape":[16,16],"dtype":"float32"},{"name":"value-model_tankToEnemiesAttn_MultiHeadAttentionLayer/wv","shape":[16,16],"dtype":"float32"},{"name":"value-model_tankToAlliesAttn_MultiHeadAttentionLayer/wq","shape":[16,16],"dtype":"float32"},{"name":"value-model_tankToAlliesAttn_MultiHeadAttentionLayer/wk","shape":[16,16],"dtype":"float32"},{"name":"value-model_tankToAlliesAttn_MultiHeadAttentionLayer/wv","shape":[16,16],"dtype":"float32"},{"name":"value-model_tankToBulletsAttn_MultiHeadAttentionLayer/wq","shape":[16,16],"dtype":"float32"},{"name":"value-model_tankToBulletsAttn_MultiHeadAttentionLayer/wk","shape":[16,16],"dtype":"float32"},{"name":"value-model_tankToBulletsAttn_MultiHeadAttentionLayer/wv","shape":[16,16],"dtype":"float32"},{"name":"value-model_tankToEnemiesAttn_output/kernel","shape":[16,16],"dtype":"float32"},{"name":"value-model_tankToEnemiesAttn_output/bias","shape":[16],"dtype":"float32"},{"name":"value-model_tankToAlliesAttn_output/kernel","shape":[16,16],"dtype":"float32"},{"name":"value-model_tankToAlliesAttn_output/bias","shape":[16],"dtype":"float32"},{"name":"value-model_tankToBulletsAttn_output/kernel","shape":[16,16],"dtype":"float32"},{"name":"value-model_tankToBulletsAttn_output/bias","shape":[16],"dtype":"float32"},{"name":"value-model_tankToEnemiesAttn_ln2/gamma","shape":[16],"dtype":"float32"},{"name":"value-model_tankToEnemiesAttn_ln2/beta","shape":[16],"dtype":"float32"},{"name":"value-model_tankToAlliesAttn_ln2/gamma","shape":[16],"dtype":"float32"},{"name":"value-model_tankToAlliesAttn_ln2/beta","shape":[16],"dtype":"float32"},{"name":"value-model_tankToBulletsAttn_ln2/gamma","shape":[16],"dtype":"float32"},{"name":"value-model_tankToBulletsAttn_ln2/beta","shape":[16],"dtype":"float32"},{"name":"value-model_controllerInput_tokProj/kernel","shape":[4,16],"dtype":"float32"},{"name":"value-model_controllerInput_tokProj/bias","shape":[16],"dtype":"float32"},{"name":"value-model_battlefieldInput_tokProj/kernel","shape":[6,16],"dtype":"float32"},{"name":"value-model_battlefieldInput_tokProj/bias","shape":[16],"dtype":"float32"},{"name":"value-model_tankToEnemiesAttn_ffn1/kernel","shape":[16,64],"dtype":"float32"},{"name":"value-model_tankToEnemiesAttn_ffn1/bias","shape":[64],"dtype":"float32"},{"name":"value-model_tankToAlliesAttn_ffn1/kernel","shape":[16,64],"dtype":"float32"},{"name":"value-model_tankToAlliesAttn_ffn1/bias","shape":[64],"dtype":"float32"},{"name":"value-model_tankToBulletsAttn_ffn1/kernel","shape":[16,64],"dtype":"float32"},{"name":"value-model_tankToBulletsAttn_ffn1/bias","shape":[64],"dtype":"float32"},{"name":"value-model_tankToEnemiesAttn_ffn2/kernel","shape":[64,16],"dtype":"float32"},{"name":"value-model_tankToEnemiesAttn_ffn2/bias","shape":[16],"dtype":"float32"},{"name":"value-model_tankToAlliesAttn_ffn2/kernel","shape":[64,16],"dtype":"float32"},{"name":"value-model_tankToAlliesAttn_ffn2/bias","shape":[16],"dtype":"float32"},{"name":"value-model_tankToBulletsAttn_ffn2/kernel","shape":[64,16],"dtype":"float32"},{"name":"value-model_tankToBulletsAttn_ffn2/bias","shape":[16],"dtype":"float32"},{"name":"value-model_transformedEnvToken/transformer0_QNorm_value-model_envToken/value-model_envToken/gamma","shape":[16],"dtype":"float32"},{"name":"value-model_transformedEnvToken/transformer0_QNorm_value-model_envToken/value-model_envToken/beta","shape":[16],"dtype":"float32"},{"name":"value-model_transformedEnvToken/transformer0_MultiHeadAttentionLayer/wq","shape":[16,16],"dtype":"float32"},{"name":"value-model_transformedEnvToken/transformer0_MultiHeadAttentionLayer/wk","shape":[16,16],"dtype":"float32"},{"name":"value-model_transformedEnvToken/transformer0_MultiHeadAttentionLayer/wv","shape":[16,16],"dtype":"float32"},{"name":"value-model_transformedEnvToken/transformer0_output/kernel","shape":[16,16],"dtype":"float32"},{"name":"value-model_transformedEnvToken/transformer0_output/bias","shape":[16],"dtype":"float32"},{"name":"value-model_transformedEnvToken/transformer0_ln2/gamma","shape":[16],"dtype":"float32"},{"name":"value-model_transformedEnvToken/transformer0_ln2/beta","shape":[16],"dtype":"float32"},{"name":"value-model_transformedEnvToken/transformer0_ffn1/kernel","shape":[16,64],"dtype":"float32"},{"name":"value-model_transformedEnvToken/transformer0_ffn1/bias","shape":[64],"dtype":"float32"},{"name":"value-model_transformedEnvToken/transformer0_ffn2/kernel","shape":[64,16],"dtype":"float32"},{"name":"value-model_transformedEnvToken/transformer0_ffn2/bias","shape":[16],"dtype":"float32"},{"name":"value-model_transformedEnvToken/transformer1_QNorm_value-model_transformedEnvToken/transformer0_ffnAdd/value-model_transformedEnvToken/transformer0_ffnAdd/gamma","shape":[16],"dtype":"float32"},{"name":"value-model_transformedEnvToken/transformer1_QNorm_value-model_transformedEnvToken/transformer0_ffnAdd/value-model_transformedEnvToken/transformer0_ffnAdd/beta","shape":[16],"dtype":"float32"},{"name":"value-model_transformedEnvToken/transformer1_MultiHeadAttentionLayer/wq","shape":[16,16],"dtype":"float32"},{"name":"value-model_transformedEnvToken/transformer1_MultiHeadAttentionLayer/wk","shape":[16,16],"dtype":"float32"},{"name":"value-model_transformedEnvToken/transformer1_MultiHeadAttentionLayer/wv","shape":[16,16],"dtype":"float32"},{"name":"value-model_transformedEnvToken/transformer1_output/kernel","shape":[16,16],"dtype":"float32"},{"name":"value-model_transformedEnvToken/transformer1_output/bias","shape":[16],"dtype":"float32"},{"name":"value-model_transformedEnvToken/transformer1_ln2/gamma","shape":[16],"dtype":"float32"},{"name":"value-model_transformedEnvToken/transformer1_ln2/beta","shape":[16],"dtype":"float32"},{"name":"value-model_transformedEnvToken/transformer1_ffn1/kernel","shape":[16,64],"dtype":"float32"},{"name":"value-model_transformedEnvToken/transformer1_ffn1/bias","shape":[64],"dtype":"float32"},{"name":"value-model_transformedEnvToken/transformer1_ffn2/kernel","shape":[64,16],"dtype":"float32"},{"name":"value-model_transformedEnvToken/transformer1_ffn2/bias","shape":[16],"dtype":"float32"},{"name":"value-model_normFinalToken/gamma","shape":[96],"dtype":"float32"},{"name":"value-model_normFinalToken/beta","shape":[96],"dtype":"float32"},{"name":"value-model_finalMLP/dense0/kernel","shape":[96,128],"dtype":"float32"},{"name":"value-model_finalMLP/dense0/bias","shape":[128],"dtype":"float32"},{"name":"value-model_finalMLP/dense1/kernel","shape":[128,64],"dtype":"float32"},{"name":"value-model_finalMLP/dense1/bias","shape":[64],"dtype":"float32"},{"name":"value-model_finalMLP/dense2/kernel","shape":[64,32],"dtype":"float32"},{"name":"value-model_finalMLP/dense2/bias","shape":[32],"dtype":"float32"},{"name":"value-model_output/kernel","shape":[32,1],"dtype":"float32"},{"name":"value-model_output/bias","shape":[1],"dtype":"float32"},{"name":"iter","shape":[],"dtype":"int32","group":"optimizer"}]}],"format":"layers-model","generatedBy":"TensorFlow.js tfjs-layers v4.22.0","convertedBy":null,"trainingConfig":{"loss":"mean_squared_error","metrics":{},"optimizer_config":{"class_name":"PatchedAdamOptimizer","config":{"learningRate":0.00001,"beta1":0.9,"beta2":0.999,"epsilon":1e-7}}}}-model_finalMLP/dense0/kernel","shape":[384,512],"dtype":"float32"},{"name":"policy-model_finalMLP/dense0/bias","shape":[512],"dtype":"float32"},{"name":"policy-model_finalMLP/dense1/kernel","shape":[512,256],"dtype":"float32"},{"name":"policy-model_finalMLP/dense1/bias","shape":[256],"dtype":"float32"},{"name":"policy-model_finalMLP/dense2/kernel","shape":[256,256],"dtype":"float32"},{"name":"policy-model_finalMLP/dense2/bias","shape":[256],"dtype":"float32"},{"name":"policy-model_finalMLP/dense3/kernel","shape":[256,128],"dtype":"float32"},{"name":"policy-model_finalMLP/dense3/bias","shape":[128],"dtype":"float32"},{"name":"policy-model_output/kernel","shape":[128,8],"dtype":"float32"},{"name":"policy-model_output/bias","shape":[8],"dtype":"float32"},{"name":"iter","shape":[],"dtype":"int32","group":"optimizer"}]}],"format":"layers-model","generatedBy":"TensorFlow.js tfjs-layers v4.22.0","convertedBy":null,"trainingConfig":{"loss":"mean_squared_error","metrics":{},"optimizer_config":{"class_name":"PatchedAdamOptimizer","config":{"learningRate":0.00001,"beta1":0.9,"beta2":0.999,"epsilon":1e-7}}}}