{"modelTopology":{"class_name":"Model","config":{"name":"policy-model","layers":[{"name":"policy-model_tankInput","class_name":"InputLayer","config":{"batch_input_shape":[null,7],"dtype":"float32","sparse":false,"name":"policy-model_tankInput"},"inbound_nodes":[]},{"name":"policy-model_tankInput_1_tokProj","class_name":"Dense","config":{"units":64,"activation":"linear","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"policy-model_tankInput_1_tokProj","trainable":true},"inbound_nodes":[[["policy-model_tankInput",0,0,{}]]]},{"name":"policy-model_tankInput_1_tokProj/policy-model_tankInput_1_tokProj_reshape","class_name":"Reshape","config":{"target_shape":[1,64],"name":"policy-model_tankInput_1_tokProj/policy-model_tankInput_1_tokProj_reshape","trainable":true},"inbound_nodes":[[["policy-model_tankInput_1_tokProj",0,0,{}]]]},{"name":"policy-model_enemiesInput","class_name":"InputLayer","config":{"batch_input_shape":[null,3,8],"dtype":"float32","sparse":false,"name":"policy-model_enemiesInput"},"inbound_nodes":[]},{"name":"policy-model_alliesInput","class_name":"InputLayer","config":{"batch_input_shape":[null,3,8],"dtype":"float32","sparse":false,"name":"policy-model_alliesInput"},"inbound_nodes":[]},{"name":"policy-model_bulletsInput","class_name":"InputLayer","config":{"batch_input_shape":[null,8,4],"dtype":"float32","sparse":false,"name":"policy-model_bulletsInput"},"inbound_nodes":[]},{"name":"policy-model_tankToEnemiesAttn_QNorm_policy-model_tankInput_1_tokProj/policy-model_tankInput_1_tokProj_reshape/policy-model_tankInput_1_tokProj/policy-model_tankInput_1_tokProj_reshape","class_name":"LayerNormalization","config":{"axis":[2],"epsilon":0.00001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"name":"policy-model_tankToEnemiesAttn_QNorm_policy-model_tankInput_1_tokProj/policy-model_tankInput_1_tokProj_reshape/policy-model_tankInput_1_tokProj/policy-model_tankInput_1_tokProj_reshape","trainable":true},"inbound_nodes":[[["policy-model_tankInput_1_tokProj/policy-model_tankInput_1_tokProj_reshape",0,0,{}]]]},{"name":"policy-model_enemiesInput_1_tokProj","class_name":"Dense","config":{"units":64,"activation":"linear","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"policy-model_enemiesInput_1_tokProj","trainable":true},"inbound_nodes":[[["policy-model_enemiesInput",0,0,{}]]]},{"name":"policy-model_enemiesMaskInput","class_name":"InputLayer","config":{"batch_input_shape":[null,3],"dtype":"float32","sparse":false,"name":"policy-model_enemiesMaskInput"},"inbound_nodes":[]},{"name":"policy-model_tankToAlliesAttn_QNorm_policy-model_tankInput_1_tokProj/policy-model_tankInput_1_tokProj_reshape/policy-model_tankInput_1_tokProj/policy-model_tankInput_1_tokProj_reshape","class_name":"LayerNormalization","config":{"axis":[2],"epsilon":0.00001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"name":"policy-model_tankToAlliesAttn_QNorm_policy-model_tankInput_1_tokProj/policy-model_tankInput_1_tokProj_reshape/policy-model_tankInput_1_tokProj/policy-model_tankInput_1_tokProj_reshape","trainable":true},"inbound_nodes":[[["policy-model_tankInput_1_tokProj/policy-model_tankInput_1_tokProj_reshape",0,0,{}]]]},{"name":"policy-model_alliesInput_1_tokProj","class_name":"Dense","config":{"units":64,"activation":"linear","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"policy-model_alliesInput_1_tokProj","trainable":true},"inbound_nodes":[[["policy-model_alliesInput",0,0,{}]]]},{"name":"policy-model_alliesMaskInput","class_name":"InputLayer","config":{"batch_input_shape":[null,3],"dtype":"float32","sparse":false,"name":"policy-model_alliesMaskInput"},"inbound_nodes":[]},{"name":"policy-model_tankToBulletsAttn_QNorm_policy-model_tankInput_1_tokProj/policy-model_tankInput_1_tokProj_reshape/policy-model_tankInput_1_tokProj/policy-model_tankInput_1_tokProj_reshape","class_name":"LayerNormalization","config":{"axis":[2],"epsilon":0.00001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"name":"policy-model_tankToBulletsAttn_QNorm_policy-model_tankInput_1_tokProj/policy-model_tankInput_1_tokProj_reshape/policy-model_tankInput_1_tokProj/policy-model_tankInput_1_tokProj_reshape","trainable":true},"inbound_nodes":[[["policy-model_tankInput_1_tokProj/policy-model_tankInput_1_tokProj_reshape",0,0,{}]]]},{"name":"policy-model_bulletsInput_1_tokProj","class_name":"Dense","config":{"units":64,"activation":"linear","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"policy-model_bulletsInput_1_tokProj","trainable":true},"inbound_nodes":[[["policy-model_bulletsInput",0,0,{}]]]},{"name":"policy-model_bulletsMaskInput","class_name":"InputLayer","config":{"batch_input_shape":[null,8],"dtype":"float32","sparse":false,"name":"policy-model_bulletsMaskInput"},"inbound_nodes":[]},{"name":"policy-model_tankToEnemiesAttn_MultiHeadAttentionLayer","class_name":"MultiHeadAttention","config":{"name":"policy-model_tankToEnemiesAttn_MultiHeadAttentionLayer","trainable":true,"key_dim":16,"num_heads":4},"inbound_nodes":[[["policy-model_tankToEnemiesAttn_QNorm_policy-model_tankInput_1_tokProj/policy-model_tankInput_1_tokProj_reshape/policy-model_tankInput_1_tokProj/policy-model_tankInput_1_tokProj_reshape",0,0,{}],["policy-model_enemiesInput_1_tokProj",0,0,{}],["policy-model_enemiesMaskInput",0,0,{}]]]},{"name":"policy-model_tankToAlliesAttn_MultiHeadAttentionLayer","class_name":"MultiHeadAttention","config":{"name":"policy-model_tankToAlliesAttn_MultiHeadAttentionLayer","trainable":true,"key_dim":16,"num_heads":4},"inbound_nodes":[[["policy-model_tankToAlliesAttn_QNorm_policy-model_tankInput_1_tokProj/policy-model_tankInput_1_tokProj_reshape/policy-model_tankInput_1_tokProj/policy-model_tankInput_1_tokProj_reshape",0,0,{}],["policy-model_alliesInput_1_tokProj",0,0,{}],["policy-model_alliesMaskInput",0,0,{}]]]},{"name":"policy-model_tankToBulletsAttn_MultiHeadAttentionLayer","class_name":"MultiHeadAttention","config":{"name":"policy-model_tankToBulletsAttn_MultiHeadAttentionLayer","trainable":true,"key_dim":16,"num_heads":4},"inbound_nodes":[[["policy-model_tankToBulletsAttn_QNorm_policy-model_tankInput_1_tokProj/policy-model_tankInput_1_tokProj_reshape/policy-model_tankInput_1_tokProj/policy-model_tankInput_1_tokProj_reshape",0,0,{}],["policy-model_bulletsInput_1_tokProj",0,0,{}],["policy-model_bulletsMaskInput",0,0,{}]]]},{"name":"policy-model_tankToEnemiesAttn_output","class_name":"Dense","config":{"units":64,"activation":"linear","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"policy-model_tankToEnemiesAttn_output","trainable":true},"inbound_nodes":[[["policy-model_tankToEnemiesAttn_MultiHeadAttentionLayer",0,0,{}]]]},{"name":"policy-model_tankToAlliesAttn_output","class_name":"Dense","config":{"units":64,"activation":"linear","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"policy-model_tankToAlliesAttn_output","trainable":true},"inbound_nodes":[[["policy-model_tankToAlliesAttn_MultiHeadAttentionLayer",0,0,{}]]]},{"name":"policy-model_tankToBulletsAttn_output","class_name":"Dense","config":{"units":64,"activation":"linear","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"policy-model_tankToBulletsAttn_output","trainable":true},"inbound_nodes":[[["policy-model_tankToBulletsAttn_MultiHeadAttentionLayer",0,0,{}]]]},{"name":"policy-model_controllerInput","class_name":"InputLayer","config":{"batch_input_shape":[null,4],"dtype":"float32","sparse":false,"name":"policy-model_controllerInput"},"inbound_nodes":[]},{"name":"policy-model_battlefieldInput","class_name":"InputLayer","config":{"batch_input_shape":[null,6],"dtype":"float32","sparse":false,"name":"policy-model_battlefieldInput"},"inbound_nodes":[]},{"name":"policy-model_tankToEnemiesAttn_ln2","class_name":"LayerNormalization","config":{"axis":[2],"epsilon":0.00001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"name":"policy-model_tankToEnemiesAttn_ln2","trainable":true},"inbound_nodes":[[["policy-model_tankToEnemiesAttn_output",0,0,{}]]]},{"name":"policy-model_tankToAlliesAttn_ln2","class_name":"LayerNormalization","config":{"axis":[2],"epsilon":0.00001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"name":"policy-model_tankToAlliesAttn_ln2","trainable":true},"inbound_nodes":[[["policy-model_tankToAlliesAttn_output",0,0,{}]]]},{"name":"policy-model_tankToBulletsAttn_ln2","class_name":"LayerNormalization","config":{"axis":[2],"epsilon":0.00001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"name":"policy-model_tankToBulletsAttn_ln2","trainable":true},"inbound_nodes":[[["policy-model_tankToBulletsAttn_output",0,0,{}]]]},{"name":"policy-model_controllerInput_1_tokProj","class_name":"Dense","config":{"units":64,"activation":"linear","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"policy-model_controllerInput_1_tokProj","trainable":true},"inbound_nodes":[[["policy-model_controllerInput",0,0,{}]]]},{"name":"policy-model_battlefieldInput_1_tokProj","class_name":"Dense","config":{"units":64,"activation":"linear","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"policy-model_battlefieldInput_1_tokProj","trainable":true},"inbound_nodes":[[["policy-model_battlefieldInput",0,0,{}]]]},{"name":"policy-model_tankToEnemiesAttn_ffn1","class_name":"Dense","config":{"units":256,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"policy-model_tankToEnemiesAttn_ffn1","trainable":true},"inbound_nodes":[[["policy-model_tankToEnemiesAttn_ln2",0,0,{}]]]},{"name":"policy-model_tankToAlliesAttn_ffn1","class_name":"Dense","config":{"units":256,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"policy-model_tankToAlliesAttn_ffn1","trainable":true},"inbound_nodes":[[["policy-model_tankToAlliesAttn_ln2",0,0,{}]]]},{"name":"policy-model_tankToBulletsAttn_ffn1","class_name":"Dense","config":{"units":256,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"policy-model_tankToBulletsAttn_ffn1","trainable":true},"inbound_nodes":[[["policy-model_tankToBulletsAttn_ln2",0,0,{}]]]},{"name":"policy-model_controllerInput_1_tokProj/policy-model_controllerInput_1_tokProj_reshape","class_name":"Reshape","config":{"target_shape":[1,64],"name":"policy-model_controllerInput_1_tokProj/policy-model_controllerInput_1_tokProj_reshape","trainable":true},"inbound_nodes":[[["policy-model_controllerInput_1_tokProj",0,0,{}]]]},{"name":"policy-model_battlefieldInput_1_tokProj/policy-model_battlefieldInput_1_tokProj_reshape","class_name":"Reshape","config":{"target_shape":[1,64],"name":"policy-model_battlefieldInput_1_tokProj/policy-model_battlefieldInput_1_tokProj_reshape","trainable":true},"inbound_nodes":[[["policy-model_battlefieldInput_1_tokProj",0,0,{}]]]},{"name":"policy-model_tankToEnemiesAttn_ffn2","class_name":"Dense","config":{"units":64,"activation":"linear","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"policy-model_tankToEnemiesAttn_ffn2","trainable":true},"inbound_nodes":[[["policy-model_tankToEnemiesAttn_ffn1",0,0,{}]]]},{"name":"policy-model_tankToAlliesAttn_ffn2","class_name":"Dense","config":{"units":64,"activation":"linear","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"policy-model_tankToAlliesAttn_ffn2","trainable":true},"inbound_nodes":[[["policy-model_tankToAlliesAttn_ffn1",0,0,{}]]]},{"name":"policy-model_tankToBulletsAttn_ffn2","class_name":"Dense","config":{"units":64,"activation":"linear","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"policy-model_tankToBulletsAttn_ffn2","trainable":true},"inbound_nodes":[[["policy-model_tankToBulletsAttn_ffn1",0,0,{}]]]},{"name":"policy-model_envToken","class_name":"Concatenate","config":{"axis":1,"name":"policy-model_envToken","trainable":true},"inbound_nodes":[[["policy-model_controllerInput_1_tokProj/policy-model_controllerInput_1_tokProj_reshape",0,0,{}],["policy-model_battlefieldInput_1_tokProj/policy-model_battlefieldInput_1_tokProj_reshape",0,0,{}],["policy-model_tankInput_1_tokProj/policy-model_tankInput_1_tokProj_reshape",0,0,{}],["policy-model_tankToEnemiesAttn_ffn2",0,0,{}],["policy-model_tankToAlliesAttn_ffn2",0,0,{}],["policy-model_tankToBulletsAttn_ffn2",0,0,{}]]]},{"name":"policy-model_transformedEnvToken/transformer0_QNorm_policy-model_envToken/policy-model_envToken_1","class_name":"LayerNormalization","config":{"axis":[2],"epsilon":0.00001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"name":"policy-model_transformedEnvToken/transformer0_QNorm_policy-model_envToken/policy-model_envToken_1","trainable":true},"inbound_nodes":[[["policy-model_envToken",0,0,{}]]]},{"name":"policy-model_transformedEnvToken/transformer0_MultiHeadAttentionLayer","class_name":"MultiHeadAttention","config":{"name":"policy-model_transformedEnvToken/transformer0_MultiHeadAttentionLayer","trainable":true,"key_dim":16,"num_heads":4},"inbound_nodes":[[["policy-model_transformedEnvToken/transformer0_QNorm_policy-model_envToken/policy-model_envToken_1",0,0,{}],["policy-model_transformedEnvToken/transformer0_QNorm_policy-model_envToken/policy-model_envToken_1",0,0,{}]]]},{"name":"policy-model_transformedEnvToken/transformer0_output","class_name":"Dense","config":{"units":64,"activation":"linear","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"policy-model_transformedEnvToken/transformer0_output","trainable":true},"inbound_nodes":[[["policy-model_transformedEnvToken/transformer0_MultiHeadAttentionLayer",0,0,{}]]]},{"name":"policy-model_transformedEnvToken/transformer0_residual","class_name":"Add","config":{"name":"policy-model_transformedEnvToken/transformer0_residual","trainable":true},"inbound_nodes":[[["policy-model_envToken",0,0,{}],["policy-model_transformedEnvToken/transformer0_output",0,0,{}]]]},{"name":"policy-model_transformedEnvToken/transformer0_ln2","class_name":"LayerNormalization","config":{"axis":[2],"epsilon":0.00001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"name":"policy-model_transformedEnvToken/transformer0_ln2","trainable":true},"inbound_nodes":[[["policy-model_transformedEnvToken/transformer0_residual",0,0,{}]]]},{"name":"policy-model_transformedEnvToken/transformer0_ffn1","class_name":"Dense","config":{"units":256,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"policy-model_transformedEnvToken/transformer0_ffn1","trainable":true},"inbound_nodes":[[["policy-model_transformedEnvToken/transformer0_ln2",0,0,{}]]]},{"name":"policy-model_transformedEnvToken/transformer0_ffn2","class_name":"Dense","config":{"units":64,"activation":"linear","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"policy-model_transformedEnvToken/transformer0_ffn2","trainable":true},"inbound_nodes":[[["policy-model_transformedEnvToken/transformer0_ffn1",0,0,{}]]]},{"name":"policy-model_transformedEnvToken/transformer0_ffnAdd","class_name":"Add","config":{"name":"policy-model_transformedEnvToken/transformer0_ffnAdd","trainable":true},"inbound_nodes":[[["policy-model_transformedEnvToken/transformer0_residual",0,0,{}],["policy-model_transformedEnvToken/transformer0_ffn2",0,0,{}]]]},{"name":"policy-model_transformedEnvToken/transformer1_QNorm_policy-model_transformedEnvToken/transformer0_ffnAdd/policy-model_transformedEnvToken/transformer0_ffnAdd_1","class_name":"LayerNormalization","config":{"axis":[2],"epsilon":0.00001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"name":"policy-model_transformedEnvToken/transformer1_QNorm_policy-model_transformedEnvToken/transformer0_ffnAdd/policy-model_transformedEnvToken/transformer0_ffnAdd_1","trainable":true},"inbound_nodes":[[["policy-model_transformedEnvToken/transformer0_ffnAdd",0,0,{}]]]},{"name":"policy-model_transformedEnvToken/transformer1_MultiHeadAttentionLayer","class_name":"MultiHeadAttention","config":{"name":"policy-model_transformedEnvToken/transformer1_MultiHeadAttentionLayer","trainable":true,"key_dim":16,"num_heads":4},"inbound_nodes":[[["policy-model_transformedEnvToken/transformer1_QNorm_policy-model_transformedEnvToken/transformer0_ffnAdd/policy-model_transformedEnvToken/transformer0_ffnAdd_1",0,0,{}],["policy-model_transformedEnvToken/transformer1_QNorm_policy-model_transformedEnvToken/transformer0_ffnAdd/policy-model_transformedEnvToken/transformer0_ffnAdd_1",0,0,{}]]]},{"name":"policy-model_transformedEnvToken/transformer1_output","class_name":"Dense","config":{"units":64,"activation":"linear","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"policy-model_transformedEnvToken/transformer1_output","trainable":true},"inbound_nodes":[[["policy-model_transformedEnvToken/transformer1_MultiHeadAttentionLayer",0,0,{}]]]},{"name":"policy-model_transformedEnvToken/transformer1_residual","class_name":"Add","config":{"name":"policy-model_transformedEnvToken/transformer1_residual","trainable":true},"inbound_nodes":[[["policy-model_transformedEnvToken/transformer0_ffnAdd",0,0,{}],["policy-model_transformedEnvToken/transformer1_output",0,0,{}]]]},{"name":"policy-model_transformedEnvToken/transformer1_ln2","class_name":"LayerNormalization","config":{"axis":[2],"epsilon":0.00001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"name":"policy-model_transformedEnvToken/transformer1_ln2","trainable":true},"inbound_nodes":[[["policy-model_transformedEnvToken/transformer1_residual",0,0,{}]]]},{"name":"policy-model_transformedEnvToken/transformer1_ffn1","class_name":"Dense","config":{"units":256,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"policy-model_transformedEnvToken/transformer1_ffn1","trainable":true},"inbound_nodes":[[["policy-model_transformedEnvToken/transformer1_ln2",0,0,{}]]]},{"name":"policy-model_transformedEnvToken/transformer1_ffn2","class_name":"Dense","config":{"units":64,"activation":"linear","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"policy-model_transformedEnvToken/transformer1_ffn2","trainable":true},"inbound_nodes":[[["policy-model_transformedEnvToken/transformer1_ffn1",0,0,{}]]]},{"name":"policy-model_transformedEnvToken/transformer1_ffnAdd","class_name":"Add","config":{"name":"policy-model_transformedEnvToken/transformer1_ffnAdd","trainable":true},"inbound_nodes":[[["policy-model_transformedEnvToken/transformer1_residual",0,0,{}],["policy-model_transformedEnvToken/transformer1_ffn2",0,0,{}]]]},{"name":"policy-model_flattenFinalToken","class_name":"Flatten","config":{"name":"policy-model_flattenFinalToken","trainable":true},"inbound_nodes":[[["policy-model_transformedEnvToken/transformer1_ffnAdd",0,0,{}]]]},{"name":"policy-model_normFinalToken","class_name":"LayerNormalization","config":{"axis":[1],"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"name":"policy-model_normFinalToken","trainable":true},"inbound_nodes":[[["policy-model_flattenFinalToken",0,0,{}]]]},{"name":"policy-model_finalMLP/dense0","class_name":"Dense","config":{"units":512,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"uniform","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"policy-model_finalMLP/dense0","trainable":true},"inbound_nodes":[[["policy-model_normFinalToken",0,0,{}]]]},{"name":"policy-model_finalMLP/dense1","class_name":"Dense","config":{"units":256,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"uniform","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"policy-model_finalMLP/dense1","trainable":true},"inbound_nodes":[[["policy-model_finalMLP/dense0",0,0,{}]]]},{"name":"policy-model_finalMLP/dense2","class_name":"Dense","config":{"units":256,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"uniform","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"policy-model_finalMLP/dense2","trainable":true},"inbound_nodes":[[["policy-model_finalMLP/dense1",0,0,{}]]]},{"name":"policy-model_finalMLP/dense3","class_name":"Dense","config":{"units":128,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"uniform","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"policy-model_finalMLP/dense3","trainable":true},"inbound_nodes":[[["policy-model_finalMLP/dense2",0,0,{}]]]},{"name":"policy-model_output","class_name":"Dense","config":{"units":8,"activation":"linear","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"policy-model_output","trainable":true},"inbound_nodes":[[["policy-model_finalMLP/dense3",0,0,{}]]]}],"input_layers":[["policy-model_controllerInput",0,0],["policy-model_battlefieldInput",0,0],["policy-model_tankInput",0,0],["policy-model_enemiesInput",0,0],["policy-model_enemiesMaskInput",0,0],["policy-model_alliesInput",0,0],["policy-model_alliesMaskInput",0,0],["policy-model_bulletsInput",0,0],["policy-model_bulletsMaskInput",0,0]],"output_layers":[["policy-model_output",0,0]]},"keras_version":"tfjs-layers 4.22.0","backend":"tensor_flow.js"},"weightsManifest":[{"paths":["weights.bin"],"weights":[{"name":"policy-model_tankInput_1_tokProj/kernel","shape":[7,64],"dtype":"float32"},{"name":"policy-model_tankInput_1_tokProj/bias","shape":[64],"dtype":"float32"},{"name":"policy-model_tankToEnemiesAttn_QNorm_policy-model_tankInput_1_tokProj/policy-model_tankInput_1_tokProj_reshape/policy-model_tankInput_1_tokProj/policy-model_tankInput_1_tokProj_reshape/gamma","shape":[64],"dtype":"float32"},{"name":"policy-model_tankToEnemiesAttn_QNorm_policy-model_tankInput_1_tokProj/policy-model_tankInput_1_tokProj_reshape/policy-model_tankInput_1_tokProj/policy-model_tankInput_1_tokProj_reshape/beta","shape":[64],"dtype":"float32"},{"name":"policy-model_enemiesInput_1_tokProj/kernel","shape":[8,64],"dtype":"float32"},{"name":"policy-model_enemiesInput_1_tokProj/bias","shape":[64],"dtype":"float32"},{"name":"policy-model_tankToAlliesAttn_QNorm_policy-model_tankInput_1_tokProj/policy-model_tankInput_1_tokProj_reshape/policy-model_tankInput_1_tokProj/policy-model_tankInput_1_tokProj_reshape/gamma","shape":[64],"dtype":"float32"},{"name":"policy-model_tankToAlliesAttn_QNorm_policy-model_tankInput_1_tokProj/policy-model_tankInput_1_tokProj_reshape/policy-model_tankInput_1_tokProj/policy-model_tankInput_1_tokProj_reshape/beta","shape":[64],"dtype":"float32"},{"name":"policy-model_alliesInput_1_tokProj/kernel","shape":[8,64],"dtype":"float32"},{"name":"policy-model_alliesInput_1_tokProj/bias","shape":[64],"dtype":"float32"},{"name":"policy-model_tankToBulletsAttn_QNorm_policy-model_tankInput_1_tokProj/policy-model_tankInput_1_tokProj_reshape/policy-model_tankInput_1_tokProj/policy-model_tankInput_1_tokProj_reshape/gamma","shape":[64],"dtype":"float32"},{"name":"policy-model_tankToBulletsAttn_QNorm_policy-model_tankInput_1_tokProj/policy-model_tankInput_1_tokProj_reshape/policy-model_tankInput_1_tokProj/policy-model_tankInput_1_tokProj_reshape/beta","shape":[64],"dtype":"float32"},{"name":"policy-model_bulletsInput_1_tokProj/kernel","shape":[4,64],"dtype":"float32"},{"name":"policy-model_bulletsInput_1_tokProj/bias","shape":[64],"dtype":"float32"},{"name":"policy-model_tankToEnemiesAttn_MultiHeadAttentionLayer/wq","shape":[64,64],"dtype":"float32"},{"name":"policy-model_tankToEnemiesAttn_MultiHeadAttentionLayer/wk","shape":[64,64],"dtype":"float32"},{"name":"policy-model_tankToEnemiesAttn_MultiHeadAttentionLayer/wv","shape":[64,64],"dtype":"float32"},{"name":"policy-model_tankToAlliesAttn_MultiHeadAttentionLayer/wq","shape":[64,64],"dtype":"float32"},{"name":"policy-model_tankToAlliesAttn_MultiHeadAttentionLayer/wk","shape":[64,64],"dtype":"float32"},{"name":"policy-model_tankToAlliesAttn_MultiHeadAttentionLayer/wv","shape":[64,64],"dtype":"float32"},{"name":"policy-model_tankToBulletsAttn_MultiHeadAttentionLayer/wq","shape":[64,64],"dtype":"float32"},{"name":"policy-model_tankToBulletsAttn_MultiHeadAttentionLayer/wk","shape":[64,64],"dtype":"float32"},{"name":"policy-model_tankToBulletsAttn_MultiHeadAttentionLayer/wv","shape":[64,64],"dtype":"float32"},{"name":"policy-model_tankToEnemiesAttn_output/kernel","shape":[64,64],"dtype":"float32"},{"name":"policy-model_tankToEnemiesAttn_output/bias","shape":[64],"dtype":"float32"},{"name":"policy-model_tankToAlliesAttn_output/kernel","shape":[64,64],"dtype":"float32"},{"name":"policy-model_tankToAlliesAttn_output/bias","shape":[64],"dtype":"float32"},{"name":"policy-model_tankToBulletsAttn_output/kernel","shape":[64,64],"dtype":"float32"},{"name":"policy-model_tankToBulletsAttn_output/bias","shape":[64],"dtype":"float32"},{"name":"policy-model_tankToEnemiesAttn_ln2/gamma","shape":[64],"dtype":"float32"},{"name":"policy-model_tankToEnemiesAttn_ln2/beta","shape":[64],"dtype":"float32"},{"name":"policy-model_tankToAlliesAttn_ln2/gamma","shape":[64],"dtype":"float32"},{"name":"policy-model_tankToAlliesAttn_ln2/beta","shape":[64],"dtype":"float32"},{"name":"policy-model_tankToBulletsAttn_ln2/gamma","shape":[64],"dtype":"float32"},{"name":"policy-model_tankToBulletsAttn_ln2/beta","shape":[64],"dtype":"float32"},{"name":"policy-model_controllerInput_1_tokProj/kernel","shape":[4,64],"dtype":"float32"},{"name":"policy-model_controllerInput_1_tokProj/bias","shape":[64],"dtype":"float32"},{"name":"policy-model_battlefieldInput_1_tokProj/kernel","shape":[6,64],"dtype":"float32"},{"name":"policy-model_battlefieldInput_1_tokProj/bias","shape":[64],"dtype":"float32"},{"name":"policy-model_tankToEnemiesAttn_ffn1/kernel","shape":[64,256],"dtype":"float32"},{"name":"policy-model_tankToEnemiesAttn_ffn1/bias","shape":[256],"dtype":"float32"},{"name":"policy-model_tankToAlliesAttn_ffn1/kernel","shape":[64,256],"dtype":"float32"},{"name":"policy-model_tankToAlliesAttn_ffn1/bias","shape":[256],"dtype":"float32"},{"name":"policy-model_tankToBulletsAttn_ffn1/kernel","shape":[64,256],"dtype":"float32"},{"name":"policy-model_tankToBulletsAttn_ffn1/bias","shape":[256],"dtype":"float32"},{"name":"policy-model_tankToEnemiesAttn_ffn2/kernel","shape":[256,64],"dtype":"float32"},{"name":"policy-model_tankToEnemiesAttn_ffn2/bias","shape":[64],"dtype":"float32"},{"name":"policy-model_tankToAlliesAttn_ffn2/kernel","shape":[256,64],"dtype":"float32"},{"name":"policy-model_tankToAlliesAttn_ffn2/bias","shape":[64],"dtype":"float32"},{"name":"policy-model_tankToBulletsAttn_ffn2/kernel","shape":[256,64],"dtype":"float32"},{"name":"policy-model_tankToBulletsAttn_ffn2/bias","shape":[64],"dtype":"float32"},{"name":"policy-model_transformedEnvToken/transformer0_QNorm_policy-model_envToken/policy-model_envToken_1/gamma","shape":[64],"dtype":"float32"},{"name":"policy-model_transformedEnvToken/transformer0_QNorm_policy-model_envToken/policy-model_envToken_1/beta","shape":[64],"dtype":"float32"},{"name":"policy-model_transformedEnvToken/transformer0_MultiHeadAttentionLayer/wq","shape":[64,64],"dtype":"float32"},{"name":"policy-model_transformedEnvToken/transformer0_MultiHeadAttentionLayer/wk","shape":[64,64],"dtype":"float32"},{"name":"policy-model_transformedEnvToken/transformer0_MultiHeadAttentionLayer/wv","shape":[64,64],"dtype":"float32"},{"name":"policy-model_transformedEnvToken/transformer0_output/kernel","shape":[64,64],"dtype":"float32"},{"name":"policy-model_transformedEnvToken/transformer0_output/bias","shape":[64],"dtype":"float32"},{"name":"policy-model_transformedEnvToken/transformer0_ln2/gamma","shape":[64],"dtype":"float32"},{"name":"policy-model_transformedEnvToken/transformer0_ln2/beta","shape":[64],"dtype":"float32"},{"name":"policy-model_transformedEnvToken/transformer0_ffn1/kernel","shape":[64,256],"dtype":"float32"},{"name":"policy-model_transformedEnvToken/transformer0_ffn1/bias","shape":[256],"dtype":"float32"},{"name":"policy-model_transformedEnvToken/transformer0_ffn2/kernel","shape":[256,64],"dtype":"float32"},{"name":"policy-model_transformedEnvToken/transformer0_ffn2/bias","shape":[64],"dtype":"float32"},{"name":"policy-model_transformedEnvToken/transformer1_QNorm_policy-model_transformedEnvToken/transformer0_ffnAdd/policy-model_transformedEnvToken/transformer0_ffnAdd_1/gamma","shape":[64],"dtype":"float32"},{"name":"policy-model_transformedEnvToken/transformer1_QNorm_policy-model_transformedEnvToken/transformer0_ffnAdd/policy-model_transformedEnvToken/transformer0_ffnAdd_1/beta","shape":[64],"dtype":"float32"},{"name":"policy-model_transformedEnvToken/transformer1_MultiHeadAttentionLayer/wq","shape":[64,64],"dtype":"float32"},{"name":"policy-model_transformedEnvToken/transformer1_MultiHeadAttentionLayer/wk","shape":[64,64],"dtype":"float32"},{"name":"policy-model_transformedEnvToken/transformer1_MultiHeadAttentionLayer/wv","shape":[64,64],"dtype":"float32"},{"name":"policy-model_transformedEnvToken/transformer1_output/kernel","shape":[64,64],"dtype":"float32"},{"name":"policy-model_transformedEnvToken/transformer1_output/bias","shape":[64],"dtype":"float32"},{"name":"policy-model_transformedEnvToken/transformer1_ln2/gamma","shape":[64],"dtype":"float32"},{"name":"policy-model_transformedEnvToken/transformer1_ln2/beta","shape":[64],"dtype":"float32"},{"name":"policy-model_transformedEnvToken/transformer1_ffn1/kernel","shape":[64,256],"dtype":"float32"},{"name":"policy-model_transformedEnvToken/transformer1_ffn1/bias","shape":[256],"dtype":"float32"},{"name":"policy-model_transformedEnvToken/transformer1_ffn2/kernel","shape":[256,64],"dtype":"float32"},{"name":"policy-model_transformedEnvToken/transformer1_ffn2/bias","shape":[64],"dtype":"float32"},{"name":"policy-model_normFinalToken/gamma","shape":[384],"dtype":"float32"},{"name":"policy-model_normFinalToken/beta","shape":[384],"dtype":"float32"},{"name":"policy-model_finalMLP/dense0/kernel","shape":[384,512],"dtype":"float32"},{"name":"policy-model_finalMLP/dense0/bias","shape":[512],"dtype":"float32"},{"name":"policy-model_finalMLP/dense1/kernel","shape":[512,256],"dtype":"float32"},{"name":"policy-model_finalMLP/dense1/bias","shape":[256],"dtype":"float32"},{"name":"policy-model_finalMLP/dense2/kernel","shape":[256,256],"dtype":"float32"},{"name":"policy-model_finalMLP/dense2/bias","shape":[256],"dtype":"float32"},{"name":"policy-model_finalMLP/dense3/kernel","shape":[256,128],"dtype":"float32"},{"name":"policy-model_finalMLP/dense3/bias","shape":[128],"dtype":"float32"},{"name":"policy-model_output/kernel","shape":[128,8],"dtype":"float32"},{"name":"policy-model_output/bias","shape":[8],"dtype":"float32"},{"name":"iter","shape":[],"dtype":"int32","group":"optimizer"}]}],"format":"layers-model","generatedBy":"TensorFlow.js tfjs-layers v4.22.0","convertedBy":null,"trainingConfig":{"loss":"mean_squared_error","metrics":{},"optimizer_config":{"class_name":"PatchedAdamOptimizer","config":{"learningRate":0.00001,"beta1":0.9,"beta2":0.999,"epsilon":1e-7}}}}