{"modelTopology":{"class_name":"Model","config":{"name":"value-model","layers":[{"name":"tankInput","class_name":"InputLayer","config":{"batch_input_shape":[null,7],"dtype":"float32","sparse":false,"name":"tankInput"},"inbound_nodes":[]},{"name":"allies_denseQ","class_name":"Dense","config":{"units":32,"activation":"linear","use_bias":false,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"allies_denseQ","trainable":true},"inbound_nodes":[[["tankInput",0,0,{}]]]},{"name":"alliesInput","class_name":"InputLayer","config":{"batch_input_shape":[null,3,7],"dtype":"float32","sparse":false,"name":"alliesInput"},"inbound_nodes":[]},{"name":"enemies_denseQ","class_name":"Dense","config":{"units":32,"activation":"linear","use_bias":false,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"enemies_denseQ","trainable":true},"inbound_nodes":[[["tankInput",0,0,{}]]]},{"name":"enemiesInput","class_name":"InputLayer","config":{"batch_input_shape":[null,3,7],"dtype":"float32","sparse":false,"name":"enemiesInput"},"inbound_nodes":[]},{"name":"bullets_denseQ","class_name":"Dense","config":{"units":32,"activation":"linear","use_bias":false,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"bullets_denseQ","trainable":true},"inbound_nodes":[[["tankInput",0,0,{}]]]},{"name":"bulletsInput","class_name":"InputLayer","config":{"batch_input_shape":[null,10,4],"dtype":"float32","sparse":false,"name":"bulletsInput"},"inbound_nodes":[]},{"name":"reshape_Reshape2","class_name":"Reshape","config":{"target_shape":[1,32],"name":"reshape_Reshape2","trainable":true},"inbound_nodes":[[["allies_denseQ",0,0,{}]]]},{"name":"allies_denseK","class_name":"Dense","config":{"units":32,"activation":"linear","use_bias":false,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"allies_denseK","trainable":true},"inbound_nodes":[[["alliesInput",0,0,{}]]]},{"name":"reshape_Reshape1","class_name":"Reshape","config":{"target_shape":[1,32],"name":"reshape_Reshape1","trainable":true},"inbound_nodes":[[["enemies_denseQ",0,0,{}]]]},{"name":"enemies_denseK","class_name":"Dense","config":{"units":32,"activation":"linear","use_bias":false,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"enemies_denseK","trainable":true},"inbound_nodes":[[["enemiesInput",0,0,{}]]]},{"name":"reshape_Reshape3","class_name":"Reshape","config":{"target_shape":[1,32],"name":"reshape_Reshape3","trainable":true},"inbound_nodes":[[["bullets_denseQ",0,0,{}]]]},{"name":"bullets_denseK","class_name":"Dense","config":{"units":32,"activation":"linear","use_bias":false,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"bullets_denseK","trainable":true},"inbound_nodes":[[["bulletsInput",0,0,{}]]]},{"name":"dot_Dot3","class_name":"Dot","config":{"axes":-1,"normalize":false,"name":"dot_Dot3","trainable":true},"inbound_nodes":[[["reshape_Reshape2",0,0,{}],["allies_denseK",0,0,{}]]]},{"name":"alliesMaskInput","class_name":"InputLayer","config":{"batch_input_shape":[null,3],"dtype":"float32","sparse":false,"name":"alliesMaskInput"},"inbound_nodes":[]},{"name":"dot_Dot1","class_name":"Dot","config":{"axes":-1,"normalize":false,"name":"dot_Dot1","trainable":true},"inbound_nodes":[[["reshape_Reshape1",0,0,{}],["enemies_denseK",0,0,{}]]]},{"name":"enemiesMaskInput","class_name":"InputLayer","config":{"batch_input_shape":[null,3],"dtype":"float32","sparse":false,"name":"enemiesMaskInput"},"inbound_nodes":[]},{"name":"dot_Dot5","class_name":"Dot","config":{"axes":-1,"normalize":false,"name":"dot_Dot5","trainable":true},"inbound_nodes":[[["reshape_Reshape3",0,0,{}],["bullets_denseK",0,0,{}]]]},{"name":"bulletsMaskInput","class_name":"InputLayer","config":{"batch_input_shape":[null,10],"dtype":"float32","sparse":false,"name":"bulletsMaskInput"},"inbound_nodes":[]},{"name":"attention_mask_layer_AttentionMaskLayer2","class_name":"AttentionMaskLayer","config":{"name":"attention_mask_layer_AttentionMaskLayer2","trainable":true},"inbound_nodes":[[["dot_Dot3",0,0,{}],["alliesMaskInput",0,0,{}]]]},{"name":"attention_mask_layer_AttentionMaskLayer1","class_name":"AttentionMaskLayer","config":{"name":"attention_mask_layer_AttentionMaskLayer1","trainable":true},"inbound_nodes":[[["dot_Dot1",0,0,{}],["enemiesMaskInput",0,0,{}]]]},{"name":"attention_mask_layer_AttentionMaskLayer3","class_name":"AttentionMaskLayer","config":{"name":"attention_mask_layer_AttentionMaskLayer3","trainable":true},"inbound_nodes":[[["dot_Dot5",0,0,{}],["bulletsMaskInput",0,0,{}]]]},{"name":"activation_Activation2","class_name":"Activation","config":{"activation":"softmax","name":"activation_Activation2","trainable":true},"inbound_nodes":[[["attention_mask_layer_AttentionMaskLayer2",0,0,{}]]]},{"name":"allies_denseV","class_name":"Dense","config":{"units":32,"activation":"linear","use_bias":false,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"allies_denseV","trainable":true},"inbound_nodes":[[["alliesInput",0,0,{}]]]},{"name":"activation_Activation1","class_name":"Activation","config":{"activation":"softmax","name":"activation_Activation1","trainable":true},"inbound_nodes":[[["attention_mask_layer_AttentionMaskLayer1",0,0,{}]]]},{"name":"enemies_denseV","class_name":"Dense","config":{"units":32,"activation":"linear","use_bias":false,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"enemies_denseV","trainable":true},"inbound_nodes":[[["enemiesInput",0,0,{}]]]},{"name":"activation_Activation3","class_name":"Activation","config":{"activation":"softmax","name":"activation_Activation3","trainable":true},"inbound_nodes":[[["attention_mask_layer_AttentionMaskLayer3",0,0,{}]]]},{"name":"bullets_denseV","class_name":"Dense","config":{"units":32,"activation":"linear","use_bias":false,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"bullets_denseV","trainable":true},"inbound_nodes":[[["bulletsInput",0,0,{}]]]},{"name":"dot_Dot4","class_name":"Dot","config":{"axes":[2,1],"normalize":false,"name":"dot_Dot4","trainable":true},"inbound_nodes":[[["activation_Activation2",0,0,{}],["allies_denseV",0,0,{}]]]},{"name":"dot_Dot2","class_name":"Dot","config":{"axes":[2,1],"normalize":false,"name":"dot_Dot2","trainable":true},"inbound_nodes":[[["activation_Activation1",0,0,{}],["enemies_denseV",0,0,{}]]]},{"name":"dot_Dot6","class_name":"Dot","config":{"axes":[2,1],"normalize":false,"name":"dot_Dot6","trainable":true},"inbound_nodes":[[["activation_Activation3",0,0,{}],["bullets_denseV",0,0,{}]]]},{"name":"battlefieldInput","class_name":"InputLayer","config":{"batch_input_shape":[null,4],"dtype":"float32","sparse":false,"name":"battlefieldInput"},"inbound_nodes":[]},{"name":"flatten_Flatten2","class_name":"Flatten","config":{"name":"flatten_Flatten2","trainable":true},"inbound_nodes":[[["dot_Dot4",0,0,{}]]]},{"name":"flatten_Flatten1","class_name":"Flatten","config":{"name":"flatten_Flatten1","trainable":true},"inbound_nodes":[[["dot_Dot2",0,0,{}]]]},{"name":"flatten_Flatten3","class_name":"Flatten","config":{"name":"flatten_Flatten3","trainable":true},"inbound_nodes":[[["dot_Dot6",0,0,{}]]]},{"name":"concatenate_Concatenate1","class_name":"Concatenate","config":{"axis":-1,"name":"concatenate_Concatenate1","trainable":true},"inbound_nodes":[[["battlefieldInput",0,0,{}],["tankInput",0,0,{}],["flatten_Flatten2",0,0,{}],["flatten_Flatten1",0,0,{}],["flatten_Flatten3",0,0,{}]]]},{"name":"concatenate_Concatenate1/concatenate_Concatenate1/dense0","class_name":"Dense","config":{"units":64,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"uniform","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"concatenate_Concatenate1/concatenate_Concatenate1/dense0","trainable":true},"inbound_nodes":[[["concatenate_Concatenate1",0,0,{}]]]},{"name":"concatenate_Concatenate1/concatenate_Concatenate1/dense1","class_name":"Dense","config":{"units":32,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"uniform","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"concatenate_Concatenate1/concatenate_Concatenate1/dense1","trainable":true},"inbound_nodes":[[["concatenate_Concatenate1/concatenate_Concatenate1/dense0",0,0,{}]]]},{"name":"value/output","class_name":"Dense","config":{"units":1,"activation":"linear","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"value/output","trainable":true},"inbound_nodes":[[["concatenate_Concatenate1/concatenate_Concatenate1/dense1",0,0,{}]]]}],"input_layers":[["battlefieldInput",0,0],["tankInput",0,0],["enemiesInput",0,0],["enemiesMaskInput",0,0],["alliesInput",0,0],["alliesMaskInput",0,0],["bulletsInput",0,0],["bulletsMaskInput",0,0]],"output_layers":[["value/output",0,0]]},"keras_version":"tfjs-layers 4.22.0","backend":"tensor_flow.js"},"format":"layers-model","generatedBy":"TensorFlow.js tfjs-layers v4.22.0","convertedBy":null,"weightsManifest":[{"paths":["./value-model.weights.bin"],"weights":[{"name":"allies_denseQ/kernel","shape":[7,32],"dtype":"float32"},{"name":"enemies_denseQ/kernel","shape":[7,32],"dtype":"float32"},{"name":"bullets_denseQ/kernel","shape":[7,32],"dtype":"float32"},{"name":"allies_denseK/kernel","shape":[7,32],"dtype":"float32"},{"name":"enemies_denseK/kernel","shape":[7,32],"dtype":"float32"},{"name":"bullets_denseK/kernel","shape":[4,32],"dtype":"float32"},{"name":"allies_denseV/kernel","shape":[7,32],"dtype":"float32"},{"name":"enemies_denseV/kernel","shape":[7,32],"dtype":"float32"},{"name":"bullets_denseV/kernel","shape":[4,32],"dtype":"float32"},{"name":"concatenate_Concatenate1/concatenate_Concatenate1/dense0/kernel","shape":[107,64],"dtype":"float32"},{"name":"concatenate_Concatenate1/concatenate_Concatenate1/dense0/bias","shape":[64],"dtype":"float32"},{"name":"concatenate_Concatenate1/concatenate_Concatenate1/dense1/kernel","shape":[64,32],"dtype":"float32"},{"name":"concatenate_Concatenate1/concatenate_Concatenate1/dense1/bias","shape":[32],"dtype":"float32"},{"name":"value/output/kernel","shape":[32,1],"dtype":"float32"},{"name":"value/output/bias","shape":[1],"dtype":"float32"},{"name":"iter","shape":[],"dtype":"int32","group":"optimizer"},{"name":"enemies_denseQ/kernel/m","shape":[7,32],"dtype":"float32","group":"optimizer"},{"name":"enemies_denseK/kernel/m","shape":[7,32],"dtype":"float32","group":"optimizer"},{"name":"enemies_denseV/kernel/m","shape":[7,32],"dtype":"float32","group":"optimizer"},{"name":"allies_denseQ/kernel/m","shape":[7,32],"dtype":"float32","group":"optimizer"},{"name":"allies_denseK/kernel/m","shape":[7,32],"dtype":"float32","group":"optimizer"},{"name":"allies_denseV/kernel/m","shape":[7,32],"dtype":"float32","group":"optimizer"},{"name":"bullets_denseQ/kernel/m","shape":[7,32],"dtype":"float32","group":"optimizer"},{"name":"bullets_denseK/kernel/m","shape":[4,32],"dtype":"float32","group":"optimizer"},{"name":"bullets_denseV/kernel/m","shape":[4,32],"dtype":"float32","group":"optimizer"},{"name":"concatenate_Concatenate1/concatenate_Concatenate1/dense0/kernel/m","shape":[107,64],"dtype":"float32","group":"optimizer"},{"name":"concatenate_Concatenate1/concatenate_Concatenate1/dense0/bias/m","shape":[64],"dtype":"float32","group":"optimizer"},{"name":"concatenate_Concatenate1/concatenate_Concatenate1/dense1/kernel/m","shape":[64,32],"dtype":"float32","group":"optimizer"},{"name":"concatenate_Concatenate1/concatenate_Concatenate1/dense1/bias/m","shape":[32],"dtype":"float32","group":"optimizer"},{"name":"value/output/kernel/m","shape":[32,1],"dtype":"float32","group":"optimizer"},{"name":"value/output/bias/m","shape":[1],"dtype":"float32","group":"optimizer"},{"name":"enemies_denseQ/kernel/v","shape":[7,32],"dtype":"float32","group":"optimizer"},{"name":"enemies_denseK/kernel/v","shape":[7,32],"dtype":"float32","group":"optimizer"},{"name":"enemies_denseV/kernel/v","shape":[7,32],"dtype":"float32","group":"optimizer"},{"name":"allies_denseQ/kernel/v","shape":[7,32],"dtype":"float32","group":"optimizer"},{"name":"allies_denseK/kernel/v","shape":[7,32],"dtype":"float32","group":"optimizer"},{"name":"allies_denseV/kernel/v","shape":[7,32],"dtype":"float32","group":"optimizer"},{"name":"bullets_denseQ/kernel/v","shape":[7,32],"dtype":"float32","group":"optimizer"},{"name":"bullets_denseK/kernel/v","shape":[4,32],"dtype":"float32","group":"optimizer"},{"name":"bullets_denseV/kernel/v","shape":[4,32],"dtype":"float32","group":"optimizer"},{"name":"concatenate_Concatenate1/concatenate_Concatenate1/dense0/kernel/v","shape":[107,64],"dtype":"float32","group":"optimizer"},{"name":"concatenate_Concatenate1/concatenate_Concatenate1/dense0/bias/v","shape":[64],"dtype":"float32","group":"optimizer"},{"name":"concatenate_Concatenate1/concatenate_Concatenate1/dense1/kernel/v","shape":[64,32],"dtype":"float32","group":"optimizer"},{"name":"concatenate_Concatenate1/concatenate_Concatenate1/dense1/bias/v","shape":[32],"dtype":"float32","group":"optimizer"},{"name":"value/output/kernel/v","shape":[32,1],"dtype":"float32","group":"optimizer"},{"name":"value/output/bias/v","shape":[1],"dtype":"float32","group":"optimizer"}]}],"trainingConfig":{"loss":"mean_squared_error","metrics":{},"optimizer_config":{"class_name":"Adam","config":{"learningRate":0.00011449126618343961,"beta1":0.9,"beta2":0.999,"epsilon":1e-7}}}}