{"modelTopology":{"class_name":"Model","config":{"name":"policy-model","layers":[{"name":"policy-model_boardInput","class_name":"InputLayer","config":{"batch_input_shape":[null,11,11,19],"dtype":"float32","sparse":false,"name":"policy-model_boardInput"},"inbound_nodes":[]},{"name":"policy-model_cellTokens","class_name":"Reshape","config":{"target_shape":[121,19],"name":"policy-model_cellTokens","trainable":true},"inbound_nodes":[[["policy-model_boardInput",0,0,{}]]]},{"name":"policy-model_cell_tokProj","class_name":"Dense","config":{"units":128,"activation":"linear","use_bias":false,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"policy-model_cell_tokProj","trainable":true},"inbound_nodes":[[["policy-model_cellTokens",0,0,{}]]]},{"name":"policy-model_encoder_inputNorm","class_name":"RMSNormLayer","config":{"name":"policy-model_encoder_inputNorm","trainable":true,"axis":-1,"epsilon":0.000001,"scale":true},"inbound_nodes":[[["policy-model_cell_tokProj",0,0,{}]]]},{"name":"policy-model_encoder/depth0_QNorm_","class_name":"RMSNormLayer","config":{"name":"policy-model_encoder/depth0_QNorm_","trainable":true,"axis":-1,"epsilon":0.000001,"scale":true},"inbound_nodes":[[["policy-model_encoder_inputNorm",0,0,{}]]]},{"name":"policy-model_encoder/depth0_qMaskLike","class_name":"MaskLike","config":{"name":"policy-model_encoder/depth0_qMaskLike","trainable":true},"inbound_nodes":[[["policy-model_encoder/depth0_QNorm_",0,0,{}]]]},{"name":"policy-model_contentMaskInput","class_name":"InputLayer","config":{"batch_input_shape":[null,121],"dtype":"float32","sparse":false,"name":"policy-model_contentMaskInput"},"inbound_nodes":[]},{"name":"policy-model_encoder/depth0_MultiHeadAttentionLayer","class_name":"MultiHeadAttention","config":{"name":"policy-model_encoder/depth0_MultiHeadAttentionLayer","trainable":true,"key_dim":32,"num_heads":4,"self_attn":true},"inbound_nodes":[[["policy-model_encoder/depth0_QNorm_",0,0,{}],["policy-model_encoder/depth0_qMaskLike",0,0,{}],["policy-model_contentMaskInput",0,0,{}]]]},{"name":"policy-model_encoder/depth0_residual","class_name":"Add","config":{"name":"policy-model_encoder/depth0_residual","trainable":true},"inbound_nodes":[[["policy-model_encoder_inputNorm",0,0,{}],["policy-model_encoder/depth0_MultiHeadAttentionLayer",0,0,{}]]]},{"name":"policy-model_encoder/depth0_ln2","class_name":"RMSNormLayer","config":{"name":"policy-model_encoder/depth0_ln2","trainable":true,"axis":-1,"epsilon":0.000001,"scale":true},"inbound_nodes":[[["policy-model_encoder/depth0_residual",0,0,{}]]]},{"name":"policy-model_encoder/depth0_ffn1","class_name":"Dense","config":{"units":512,"activation":"linear","use_bias":false,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"policy-model_encoder/depth0_ffn1","trainable":true},"inbound_nodes":[[["policy-model_encoder/depth0_ln2",0,0,{}]]]},{"name":"policy-model_encoder/depth0_ffn_gate","class_name":"Dense","config":{"units":512,"activation":"sigmoid","use_bias":false,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"policy-model_encoder/depth0_ffn_gate","trainable":true},"inbound_nodes":[[["policy-model_encoder/depth0_ln2",0,0,{}]]]},{"name":"policy-model_encoder/depth0_ffn_silu","class_name":"Multiply","config":{"name":"policy-model_encoder/depth0_ffn_silu","trainable":true},"inbound_nodes":[[["policy-model_encoder/depth0_ffn1",0,0,{}],["policy-model_encoder/depth0_ffn_gate",0,0,{}]]]},{"name":"policy-model_encoder/depth0_ffn2","class_name":"Dense","config":{"units":128,"activation":"linear","use_bias":false,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"policy-model_encoder/depth0_ffn2","trainable":true},"inbound_nodes":[[["policy-model_encoder/depth0_ffn_silu",0,0,{}]]]},{"name":"policy-model_encoder/depth0_ffnAdd","class_name":"Add","config":{"name":"policy-model_encoder/depth0_ffnAdd","trainable":true},"inbound_nodes":[[["policy-model_encoder/depth0_residual",0,0,{}],["policy-model_encoder/depth0_ffn2",0,0,{}]]]},{"name":"policy-model_encoder/depth1_QNorm_","class_name":"RMSNormLayer","config":{"name":"policy-model_encoder/depth1_QNorm_","trainable":true,"axis":-1,"epsilon":0.000001,"scale":true},"inbound_nodes":[[["policy-model_encoder/depth0_ffnAdd",0,0,{}]]]},{"name":"policy-model_encoder/depth1_qMaskLike","class_name":"MaskLike","config":{"name":"policy-model_encoder/depth1_qMaskLike","trainable":true},"inbound_nodes":[[["policy-model_encoder/depth1_QNorm_",0,0,{}]]]},{"name":"policy-model_encoder/depth1_MultiHeadAttentionLayer","class_name":"MultiHeadAttention","config":{"name":"policy-model_encoder/depth1_MultiHeadAttentionLayer","trainable":true,"key_dim":32,"num_heads":4,"self_attn":true},"inbound_nodes":[[["policy-model_encoder/depth1_QNorm_",0,0,{}],["policy-model_encoder/depth1_qMaskLike",0,0,{}],["policy-model_contentMaskInput",0,0,{}]]]},{"name":"policy-model_encoder/depth1_residual","class_name":"Add","config":{"name":"policy-model_encoder/depth1_residual","trainable":true},"inbound_nodes":[[["policy-model_encoder/depth0_ffnAdd",0,0,{}],["policy-model_encoder/depth1_MultiHeadAttentionLayer",0,0,{}]]]},{"name":"policy-model_encoder/depth1_ln2","class_name":"RMSNormLayer","config":{"name":"policy-model_encoder/depth1_ln2","trainable":true,"axis":-1,"epsilon":0.000001,"scale":true},"inbound_nodes":[[["policy-model_encoder/depth1_residual",0,0,{}]]]},{"name":"policy-model_encoder/depth1_ffn1","class_name":"Dense","config":{"units":512,"activation":"linear","use_bias":false,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"policy-model_encoder/depth1_ffn1","trainable":true},"inbound_nodes":[[["policy-model_encoder/depth1_ln2",0,0,{}]]]},{"name":"policy-model_encoder/depth1_ffn_gate","class_name":"Dense","config":{"units":512,"activation":"sigmoid","use_bias":false,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"policy-model_encoder/depth1_ffn_gate","trainable":true},"inbound_nodes":[[["policy-model_encoder/depth1_ln2",0,0,{}]]]},{"name":"policy-model_encoder/depth1_ffn_silu","class_name":"Multiply","config":{"name":"policy-model_encoder/depth1_ffn_silu","trainable":true},"inbound_nodes":[[["policy-model_encoder/depth1_ffn1",0,0,{}],["policy-model_encoder/depth1_ffn_gate",0,0,{}]]]},{"name":"policy-model_encoder/depth1_ffn2","class_name":"Dense","config":{"units":128,"activation":"linear","use_bias":false,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"policy-model_encoder/depth1_ffn2","trainable":true},"inbound_nodes":[[["policy-model_encoder/depth1_ffn_silu",0,0,{}]]]},{"name":"policy-model_encoder/depth1_ffnAdd","class_name":"Add","config":{"name":"policy-model_encoder/depth1_ffnAdd","trainable":true},"inbound_nodes":[[["policy-model_encoder/depth1_residual",0,0,{}],["policy-model_encoder/depth1_ffn2",0,0,{}]]]},{"name":"policy-model_encoder/depth2_QNorm_","class_name":"RMSNormLayer","config":{"name":"policy-model_encoder/depth2_QNorm_","trainable":true,"axis":-1,"epsilon":0.000001,"scale":true},"inbound_nodes":[[["policy-model_encoder/depth1_ffnAdd",0,0,{}]]]},{"name":"policy-model_encoder/depth2_qMaskLike","class_name":"MaskLike","config":{"name":"policy-model_encoder/depth2_qMaskLike","trainable":true},"inbound_nodes":[[["policy-model_encoder/depth2_QNorm_",0,0,{}]]]},{"name":"policy-model_encoder/depth2_MultiHeadAttentionLayer","class_name":"MultiHeadAttention","config":{"name":"policy-model_encoder/depth2_MultiHeadAttentionLayer","trainable":true,"key_dim":32,"num_heads":4,"self_attn":true},"inbound_nodes":[[["policy-model_encoder/depth2_QNorm_",0,0,{}],["policy-model_encoder/depth2_qMaskLike",0,0,{}],["policy-model_contentMaskInput",0,0,{}]]]},{"name":"policy-model_encoder/depth2_residual","class_name":"Add","config":{"name":"policy-model_encoder/depth2_residual","trainable":true},"inbound_nodes":[[["policy-model_encoder/depth1_ffnAdd",0,0,{}],["policy-model_encoder/depth2_MultiHeadAttentionLayer",0,0,{}]]]},{"name":"policy-model_encoder/depth2_ln2","class_name":"RMSNormLayer","config":{"name":"policy-model_encoder/depth2_ln2","trainable":true,"axis":-1,"epsilon":0.000001,"scale":true},"inbound_nodes":[[["policy-model_encoder/depth2_residual",0,0,{}]]]},{"name":"policy-model_encoder/depth2_ffn1","class_name":"Dense","config":{"units":512,"activation":"linear","use_bias":false,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"policy-model_encoder/depth2_ffn1","trainable":true},"inbound_nodes":[[["policy-model_encoder/depth2_ln2",0,0,{}]]]},{"name":"policy-model_encoder/depth2_ffn_gate","class_name":"Dense","config":{"units":512,"activation":"sigmoid","use_bias":false,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"policy-model_encoder/depth2_ffn_gate","trainable":true},"inbound_nodes":[[["policy-model_encoder/depth2_ln2",0,0,{}]]]},{"name":"policy-model_encoder/depth2_ffn_silu","class_name":"Multiply","config":{"name":"policy-model_encoder/depth2_ffn_silu","trainable":true},"inbound_nodes":[[["policy-model_encoder/depth2_ffn1",0,0,{}],["policy-model_encoder/depth2_ffn_gate",0,0,{}]]]},{"name":"policy-model_encoder/depth2_ffn2","class_name":"Dense","config":{"units":128,"activation":"linear","use_bias":false,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"policy-model_encoder/depth2_ffn2","trainable":true},"inbound_nodes":[[["policy-model_encoder/depth2_ffn_silu",0,0,{}]]]},{"name":"policy-model_encoder/depth2_ffnAdd","class_name":"Add","config":{"name":"policy-model_encoder/depth2_ffnAdd","trainable":true},"inbound_nodes":[[["policy-model_encoder/depth2_residual",0,0,{}],["policy-model_encoder/depth2_ffn2",0,0,{}]]]},{"name":"policy-model_encoder_outputNorm","class_name":"RMSNormLayer","config":{"name":"policy-model_encoder_outputNorm","trainable":true,"axis":-1,"epsilon":0.000001,"scale":true},"inbound_nodes":[[["policy-model_encoder/depth2_ffnAdd",0,0,{}]]]},{"name":"policy-model_moveCells","class_name":"HexRingGather","config":{"name":"policy-model_moveCells","trainable":true,"indexes":[60,61,50,49,59,70,71]},"inbound_nodes":[[["policy-model_encoder_outputNorm",0,0,{}]]]},{"name":"policy-model_move_scorerHidden","class_name":"Dense","config":{"units":128,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"policy-model_move_scorerHidden","trainable":true},"inbound_nodes":[[["policy-model_moveCells",0,0,{}]]]},{"name":"policy-model_fire_scorerHidden","class_name":"Dense","config":{"units":128,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"policy-model_fire_scorerHidden","trainable":true},"inbound_nodes":[[["policy-model_encoder_outputNorm",0,0,{}]]]},{"name":"policy-model_move_scorer","class_name":"Dense","config":{"units":1,"activation":"linear","use_bias":false,"kernel_initializer":{"class_name":"Orthogonal","config":{"gain":0.2,"seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"policy-model_move_scorer","trainable":true},"inbound_nodes":[[["policy-model_move_scorerHidden",0,0,{}]]]},{"name":"policy-model_fire_scorer","class_name":"Dense","config":{"units":1,"activation":"linear","use_bias":false,"kernel_initializer":{"class_name":"Orthogonal","config":{"gain":0.2,"seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"policy-model_fire_scorer","trainable":true},"inbound_nodes":[[["policy-model_fire_scorerHidden",0,0,{}]]]},{"name":"policy-model_move_logits","class_name":"Reshape","config":{"target_shape":[7],"name":"policy-model_move_logits","trainable":true},"inbound_nodes":[[["policy-model_move_scorer",0,0,{}]]]},{"name":"policy-model_fire_logits","class_name":"Reshape","config":{"target_shape":[121],"name":"policy-model_fire_logits","trainable":true},"inbound_nodes":[[["policy-model_fire_scorer",0,0,{}]]]},{"name":"policy-model_logits","class_name":"Concatenate","config":{"axis":-1,"name":"policy-model_logits","trainable":true},"inbound_nodes":[[["policy-model_move_logits",0,0,{}],["policy-model_fire_logits",0,0,{}]]]}],"input_layers":[["policy-model_boardInput",0,0],["policy-model_contentMaskInput",0,0]],"output_layers":[["policy-model_logits",0,0]]},"keras_version":"tfjs-layers 4.22.0","backend":"tensor_flow.js"},"format":"layers-model","generatedBy":"TensorFlow.js tfjs-layers v4.22.0","convertedBy":null,"weightsManifest":[{"paths":["./policy-model.weights.bin"],"weights":[{"name":"policy-model_cell_tokProj/kernel","shape":[19,128],"dtype":"float32"},{"name":"policy-model_encoder_inputNorm/scale","shape":[1,128],"dtype":"float32"},{"name":"policy-model_encoder/depth0_QNorm_/scale","shape":[1,128],"dtype":"float32"},{"name":"policy-model_encoder/depth0_MultiHeadAttentionLayer/wqkv","shape":[128,384],"dtype":"float32"},{"name":"policy-model_encoder/depth0_MultiHeadAttentionLayer/wo","shape":[128,128],"dtype":"float32"},{"name":"policy-model_encoder/depth0_ln2/scale","shape":[1,128],"dtype":"float32"},{"name":"policy-model_encoder/depth0_ffn1/kernel","shape":[128,512],"dtype":"float32"},{"name":"policy-model_encoder/depth0_ffn_gate/kernel","shape":[128,512],"dtype":"float32"},{"name":"policy-model_encoder/depth0_ffn2/kernel","shape":[512,128],"dtype":"float32"},{"name":"policy-model_encoder/depth1_QNorm_/scale","shape":[1,128],"dtype":"float32"},{"name":"policy-model_encoder/depth1_MultiHeadAttentionLayer/wqkv","shape":[128,384],"dtype":"float32"},{"name":"policy-model_encoder/depth1_MultiHeadAttentionLayer/wo","shape":[128,128],"dtype":"float32"},{"name":"policy-model_encoder/depth1_ln2/scale","shape":[1,128],"dtype":"float32"},{"name":"policy-model_encoder/depth1_ffn1/kernel","shape":[128,512],"dtype":"float32"},{"name":"policy-model_encoder/depth1_ffn_gate/kernel","shape":[128,512],"dtype":"float32"},{"name":"policy-model_encoder/depth1_ffn2/kernel","shape":[512,128],"dtype":"float32"},{"name":"policy-model_encoder/depth2_QNorm_/scale","shape":[1,128],"dtype":"float32"},{"name":"policy-model_encoder/depth2_MultiHeadAttentionLayer/wqkv","shape":[128,384],"dtype":"float32"},{"name":"policy-model_encoder/depth2_MultiHeadAttentionLayer/wo","shape":[128,128],"dtype":"float32"},{"name":"policy-model_encoder/depth2_ln2/scale","shape":[1,128],"dtype":"float32"},{"name":"policy-model_encoder/depth2_ffn1/kernel","shape":[128,512],"dtype":"float32"},{"name":"policy-model_encoder/depth2_ffn_gate/kernel","shape":[128,512],"dtype":"float32"},{"name":"policy-model_encoder/depth2_ffn2/kernel","shape":[512,128],"dtype":"float32"},{"name":"policy-model_encoder_outputNorm/scale","shape":[1,128],"dtype":"float32"},{"name":"policy-model_move_scorerHidden/kernel","shape":[128,128],"dtype":"float32"},{"name":"policy-model_move_scorerHidden/bias","shape":[128],"dtype":"float32"},{"name":"policy-model_fire_scorerHidden/kernel","shape":[128,128],"dtype":"float32"},{"name":"policy-model_fire_scorerHidden/bias","shape":[128],"dtype":"float32"},{"name":"policy-model_move_scorer/kernel","shape":[128,1],"dtype":"float32"},{"name":"policy-model_fire_scorer/kernel","shape":[128,1],"dtype":"float32"},{"name":"iter","shape":[],"dtype":"int32","group":"optimizer"},{"name":"policy-model_cell_tokProj/kernel/m","shape":[19,128],"dtype":"float32","group":"optimizer"},{"name":"policy-model_encoder_inputNorm/scale/m","shape":[1,128],"dtype":"float32","group":"optimizer"},{"name":"policy-model_encoder_outputNorm/scale/m","shape":[1,128],"dtype":"float32","group":"optimizer"},{"name":"policy-model_encoder/depth0_ffn_gate/kernel/m","shape":[128,512],"dtype":"float32","group":"optimizer"},{"name":"policy-model_encoder/depth0_ffn1/kernel/m","shape":[128,512],"dtype":"float32","group":"optimizer"},{"name":"policy-model_encoder/depth0_ffn2/kernel/m","shape":[512,128],"dtype":"float32","group":"optimizer"},{"name":"policy-model_encoder/depth0_ln2/scale/m","shape":[1,128],"dtype":"float32","group":"optimizer"},{"name":"policy-model_encoder/depth0_MultiHeadAttentionLayer/wo/m","shape":[128,128],"dtype":"float32","group":"optimizer"},{"name":"policy-model_encoder/depth0_MultiHeadAttentionLayer/wqkv/m","shape":[128,384],"dtype":"float32","group":"optimizer"},{"name":"policy-model_encoder/depth0_QNorm_/scale/m","shape":[1,128],"dtype":"float32","group":"optimizer"},{"name":"policy-model_encoder/depth1_ffn_gate/kernel/m","shape":[128,512],"dtype":"float32","group":"optimizer"},{"name":"policy-model_encoder/depth1_ffn1/kernel/m","shape":[128,512],"dtype":"float32","group":"optimizer"},{"name":"policy-model_encoder/depth1_ffn2/kernel/m","shape":[512,128],"dtype":"float32","group":"optimizer"},{"name":"policy-model_encoder/depth1_ln2/scale/m","shape":[1,128],"dtype":"float32","group":"optimizer"},{"name":"policy-model_encoder/depth1_MultiHeadAttentionLayer/wo/m","shape":[128,128],"dtype":"float32","group":"optimizer"},{"name":"policy-model_encoder/depth1_MultiHeadAttentionLayer/wqkv/m","shape":[128,384],"dtype":"float32","group":"optimizer"},{"name":"policy-model_encoder/depth1_QNorm_/scale/m","shape":[1,128],"dtype":"float32","group":"optimizer"},{"name":"policy-model_encoder/depth2_ffn_gate/kernel/m","shape":[128,512],"dtype":"float32","group":"optimizer"},{"name":"policy-model_encoder/depth2_ffn1/kernel/m","shape":[128,512],"dtype":"float32","group":"optimizer"},{"name":"policy-model_encoder/depth2_ffn2/kernel/m","shape":[512,128],"dtype":"float32","group":"optimizer"},{"name":"policy-model_encoder/depth2_ln2/scale/m","shape":[1,128],"dtype":"float32","group":"optimizer"},{"name":"policy-model_encoder/depth2_MultiHeadAttentionLayer/wo/m","shape":[128,128],"dtype":"float32","group":"optimizer"},{"name":"policy-model_encoder/depth2_MultiHeadAttentionLayer/wqkv/m","shape":[128,384],"dtype":"float32","group":"optimizer"},{"name":"policy-model_encoder/depth2_QNorm_/scale/m","shape":[1,128],"dtype":"float32","group":"optimizer"},{"name":"policy-model_fire_scorer/kernel/m","shape":[128,1],"dtype":"float32","group":"optimizer"},{"name":"policy-model_fire_scorerHidden/bias/m","shape":[128],"dtype":"float32","group":"optimizer"},{"name":"policy-model_fire_scorerHidden/kernel/m","shape":[128,128],"dtype":"float32","group":"optimizer"},{"name":"policy-model_move_scorer/kernel/m","shape":[128,1],"dtype":"float32","group":"optimizer"},{"name":"policy-model_move_scorerHidden/bias/m","shape":[128],"dtype":"float32","group":"optimizer"},{"name":"policy-model_move_scorerHidden/kernel/m","shape":[128,128],"dtype":"float32","group":"optimizer"},{"name":"policy-model_cell_tokProj/kernel/v","shape":[19,128],"dtype":"float32","group":"optimizer"},{"name":"policy-model_encoder_inputNorm/scale/v","shape":[1,128],"dtype":"float32","group":"optimizer"},{"name":"policy-model_encoder_outputNorm/scale/v","shape":[1,128],"dtype":"float32","group":"optimizer"},{"name":"policy-model_encoder/depth0_ffn_gate/kernel/v","shape":[128,512],"dtype":"float32","group":"optimizer"},{"name":"policy-model_encoder/depth0_ffn1/kernel/v","shape":[128,512],"dtype":"float32","group":"optimizer"},{"name":"policy-model_encoder/depth0_ffn2/kernel/v","shape":[512,128],"dtype":"float32","group":"optimizer"},{"name":"policy-model_encoder/depth0_ln2/scale/v","shape":[1,128],"dtype":"float32","group":"optimizer"},{"name":"policy-model_encoder/depth0_MultiHeadAttentionLayer/wo/v","shape":[128,128],"dtype":"float32","group":"optimizer"},{"name":"policy-model_encoder/depth0_MultiHeadAttentionLayer/wqkv/v","shape":[128,384],"dtype":"float32","group":"optimizer"},{"name":"policy-model_encoder/depth0_QNorm_/scale/v","shape":[1,128],"dtype":"float32","group":"optimizer"},{"name":"policy-model_encoder/depth1_ffn_gate/kernel/v","shape":[128,512],"dtype":"float32","group":"optimizer"},{"name":"policy-model_encoder/depth1_ffn1/kernel/v","shape":[128,512],"dtype":"float32","group":"optimizer"},{"name":"policy-model_encoder/depth1_ffn2/kernel/v","shape":[512,128],"dtype":"float32","group":"optimizer"},{"name":"policy-model_encoder/depth1_ln2/scale/v","shape":[1,128],"dtype":"float32","group":"optimizer"},{"name":"policy-model_encoder/depth1_MultiHeadAttentionLayer/wo/v","shape":[128,128],"dtype":"float32","group":"optimizer"},{"name":"policy-model_encoder/depth1_MultiHeadAttentionLayer/wqkv/v","shape":[128,384],"dtype":"float32","group":"optimizer"},{"name":"policy-model_encoder/depth1_QNorm_/scale/v","shape":[1,128],"dtype":"float32","group":"optimizer"},{"name":"policy-model_encoder/depth2_ffn_gate/kernel/v","shape":[128,512],"dtype":"float32","group":"optimizer"},{"name":"policy-model_encoder/depth2_ffn1/kernel/v","shape":[128,512],"dtype":"float32","group":"optimizer"},{"name":"policy-model_encoder/depth2_ffn2/kernel/v","shape":[512,128],"dtype":"float32","group":"optimizer"},{"name":"policy-model_encoder/depth2_ln2/scale/v","shape":[1,128],"dtype":"float32","group":"optimizer"},{"name":"policy-model_encoder/depth2_MultiHeadAttentionLayer/wo/v","shape":[128,128],"dtype":"float32","group":"optimizer"},{"name":"policy-model_encoder/depth2_MultiHeadAttentionLayer/wqkv/v","shape":[128,384],"dtype":"float32","group":"optimizer"},{"name":"policy-model_encoder/depth2_QNorm_/scale/v","shape":[1,128],"dtype":"float32","group":"optimizer"},{"name":"policy-model_fire_scorer/kernel/v","shape":[128,1],"dtype":"float32","group":"optimizer"},{"name":"policy-model_fire_scorerHidden/bias/v","shape":[128],"dtype":"float32","group":"optimizer"},{"name":"policy-model_fire_scorerHidden/kernel/v","shape":[128,128],"dtype":"float32","group":"optimizer"},{"name":"policy-model_move_scorer/kernel/v","shape":[128,1],"dtype":"float32","group":"optimizer"},{"name":"policy-model_move_scorerHidden/bias/v","shape":[128],"dtype":"float32","group":"optimizer"},{"name":"policy-model_move_scorerHidden/kernel/v","shape":[128,128],"dtype":"float32","group":"optimizer"}]}],"userDefinedMetadata":{"curriculumState":{"iteration":3521545,"mapScenarioIndexToSuccessRatio":{"0":0.9850780747920032,"1":0.670205992113415,"2":0.18181818181818182,"3":0}},"lr":0.001,"expIteration":3523596},"trainingConfig":{"loss":"mean_squared_error","metrics":{},"optimizer_config":{"class_name":"AdamW","config":{"learningRate":0.001,"beta1":0.9,"beta2":0.999,"epsilon":0.00001,"weightDecay":0.000001}}}}